una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91cap9.h
/* - ----------------------------------------------------------------------------*/
/* -          ATMEL Microcontroller Software Support  -  ROUSSET  -*/
/* - ----------------------------------------------------------------------------*/
/* -  DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR*/
/* -  IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF*/
/* -  MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE*/
/* -  DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,*/
/* -  INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT*/
/* -  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,*/
/* -  OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF*/
/* -  LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING*/
/* -  NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,*/
/* -  EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.*/
/* - ----------------------------------------------------------------------------*/
/* - File Name           : AT91CAP9_UMC.h*/
/* - Object              : AT91CAP9_UMC definitions*/
/* - Generated           : AT91 SW Application Group  04/28/2008 (18:15:58)*/
/* - */
/* - CVS Reference       : /AT91CAP9_UMC.pl/1.9/Thu Apr 17 13:55:34 2008  */
/* - CVS Reference       : /SYS_AT91CAP9_UMC.pl/1.2/Thu Apr 17 13:55:44 2008  */
/* - CVS Reference       : /HECC_6143A.pl/1.1/Wed Feb  9 17:16:57 2005  */
/* - CVS Reference       : /HBCRAMC1_XXXX.pl/1.1/Wed Jun 14 07:59:13 2006  */
/* - CVS Reference       : /DDRSDRC_XXXX.pl/1.3/Mon Aug 27 11:07:19 2007  */
/* - CVS Reference       : /HSMC3_6105A.pl/1.5/Wed Feb 13 14:38:48 2008  */
/* - CVS Reference       : /HMATRIX1_CAP9.pl/1.2/Wed Jun 14 08:02:21 2006  */
/* - CVS Reference       : /CCR_CAP9.pl/1.1/Wed Jun 14 08:02:21 2006  */
/* - CVS Reference       : /PDC_6074C.pl/1.2/Thu Feb  3 09:02:11 2005  */
/* - CVS Reference       : /DBGU_6059D.pl/1.1/Mon Jan 31 13:54:41 2005  */
/* - CVS Reference       : /AIC_6075A.pl/1.1/Mon Jul 12 17:04:01 2004  */
/* - CVS Reference       : /PIO_6057A.pl/1.2/Thu Feb  3 10:29:42 2005  */
/* - CVS Reference       : /PMC_CAP9.pl/1.2/Mon Oct 23 15:19:41 2006  */
/* - CVS Reference       : /RSTC_6098A.pl/1.3/Thu Nov  4 13:57:00 2004  */
/* - CVS Reference       : /SHDWC_6122A.pl/1.3/Wed Oct  6 14:16:58 2004  */
/* - CVS Reference       : /RTTC_6081A.pl/1.2/Thu Nov  4 13:57:22 2004  */
/* - CVS Reference       : /PITC_6079A.pl/1.2/Thu Nov  4 13:56:22 2004  */
/* - CVS Reference       : /WDTC_6080A.pl/1.3/Thu Nov  4 13:58:52 2004  */
/* - CVS Reference       : /UDP_6ept_puon.pl/1.1/Wed Aug 30 14:20:53 2006  */
/* - CVS Reference       : /UDPHS_SAM9_8ept6dma4iso.pl/1.3/Mon Apr 28 13:59:56 2008  */
/* - CVS Reference       : /TC_6082A.pl/1.7/Wed Mar  9 16:31:51 2005  */
/* - CVS Reference       : /MCI_6101E.pl/1.1/Fri Jun  3 13:20:23 2005  */
/* - CVS Reference       : /TWI_6061B.pl/1.2/Fri Aug  4 08:53:02 2006  */
/* - CVS Reference       : /US_6089J.pl/1.2/Wed Oct 11 13:26:02 2006  */
/* - CVS Reference       : /SSC_6078B.pl/1.2/Thu Apr 17 13:55:44 2008  */
/* - CVS Reference       : /AC97C_XXXX.pl/1.3/Tue Feb 22 17:08:27 2005  */
/* - CVS Reference       : /SPI_6088D.pl/1.3/Fri May 20 14:23:02 2005  */
/* - CVS Reference       : /CAN_6019B.pl/1.1/Mon Jan 31 13:54:30 2005  */
/* - CVS Reference       : /AES_6149A.pl/1.12/Wed Nov  2 14:17:53 2005  */
/* - CVS Reference       : /DES3_6150A.pl/1.1/Mon Jan 17 13:30:33 2005  */
/* - CVS Reference       : /PWM_6044D.pl/1.2/Tue May 10 12:39:09 2005  */
/* - CVS Reference       : /EMACB_6119A.pl/1.6/Wed Jul 13 15:25:00 2005  */
/* - CVS Reference       : /ADC_6051H.pl/1.1/Wed Apr  9 15:19:51 2008  */
/* - CVS Reference       : /ISI_xxxxx.pl/1.3/Thu Mar  3 11:11:48 2005  */
/* - CVS Reference       : /LCDC_6063A.pl/1.3/Fri Dec  9 10:59:26 2005  */
/* - CVS Reference       : /HDMA_XXXX.pl/1.2/Mon Oct 17 12:24:05 2005  */
/* - CVS Reference       : /UHP_6127A.pl/1.1/Wed Feb 23 16:03:17 2005  */
/* - ----------------------------------------------------------------------------*/

#ifndef AT91CAP9_UMC_H
#define AT91CAP9_UMC_H

#ifdef __IAR_SYSTEMS_ICC__

typedef volatile unsigned int AT91_REG;/* Hardware register definition*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Error Correction Code controller*/
/* ******************************************************************************/
typedef struct _AT91S_ECC {
	AT91_REG	 ECC_CR; 	/*  ECC reset register*/
	AT91_REG	 ECC_MR; 	/*  ECC Page size register*/
	AT91_REG	 ECC_SR; 	/*  ECC Status register*/
	AT91_REG	 ECC_PR; 	/*  ECC Parity register*/
	AT91_REG	 ECC_NPR; 	/*  ECC Parity N register*/
	AT91_REG	 Reserved0[58]; 	/* */
	AT91_REG	 ECC_VR; 	/*  ECC Version register*/
} AT91S_ECC, *AT91PS_ECC;

/* -------- ECC_CR : (ECC Offset: 0x0) ECC reset register -------- */
#define AT91C_ECC_RST         ((unsigned int) 0x1 <<  0) /* (ECC) ECC reset parity*/
/* -------- ECC_MR : (ECC Offset: 0x4) ECC page size register -------- */
#define AT91C_ECC_PAGE_SIZE   ((unsigned int) 0x3 <<  0) /* (ECC) Nand Flash page size*/
/* -------- ECC_SR : (ECC Offset: 0x8) ECC status register -------- */
#define AT91C_ECC_RECERR      ((unsigned int) 0x1 <<  0) /* (ECC) ECC error*/
#define AT91C_ECC_ECCERR      ((unsigned int) 0x1 <<  1) /* (ECC) ECC single error*/
#define AT91C_ECC_MULERR      ((unsigned int) 0x1 <<  2) /* (ECC) ECC_MULERR*/
/* -------- ECC_PR : (ECC Offset: 0xc) ECC parity register -------- */
#define AT91C_ECC_BITADDR     ((unsigned int) 0xF <<  0) /* (ECC) Bit address error*/
#define AT91C_ECC_WORDADDR    ((unsigned int) 0xFFF <<  4) /* (ECC) address of the failing bit*/
/* -------- ECC_NPR : (ECC Offset: 0x10) ECC N parity register -------- */
#define AT91C_ECC_NPARITY     ((unsigned int) 0xFFFF <<  0) /* (ECC) ECC parity N */
/* -------- ECC_VR : (ECC Offset: 0xfc) ECC version register -------- */
#define AT91C_ECC_VR          ((unsigned int) 0xF <<  0) /* (ECC) ECC version register*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Busr Cellular RAM Controller Interface*/
/* ******************************************************************************/
typedef struct _AT91S_BCRAMC {
	AT91_REG	 BCRAMC_CR; 	/* BCRAM Controller Configuration Register*/
	AT91_REG	 BCRAMC_TPR; 	/* BCRAM Controller Timing Parameter Register*/
	AT91_REG	 BCRAMC_HSR; 	/* BCRAM Controller High Speed Register*/
	AT91_REG	 BCRAMC_LPR; 	/* BCRAM Controller Low Power Register*/
	AT91_REG	 BCRAMC_MDR; 	/* BCRAM Memory Device Register*/
	AT91_REG	 Reserved0[54]; 	/* */
	AT91_REG	 BCRAMC_PADDSR; 	/* BCRAM PADDR Size Register*/
	AT91_REG	 BCRAMC_IPNR1; 	/* BCRAM IP Name Register 1*/
	AT91_REG	 BCRAMC_IPNR2; 	/* BCRAM IP Name Register 2*/
	AT91_REG	 BCRAMC_IPFR; 	/* BCRAM IP Features Register*/
	AT91_REG	 BCRAMC_VR; 	/* BCRAM Version Register*/
} AT91S_BCRAMC, *AT91PS_BCRAMC;

