una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91cap9.h
/* -------- BCRAMC_CR : (BCRAMC Offset: 0x0) BCRAM Controller Configuration Register -------- */
#define AT91C_BCRAMC_EN       ((unsigned int) 0x1 <<  0) /* (BCRAMC) Enable*/
#define AT91C_BCRAMC_CAS      ((unsigned int) 0x7 <<  4) /* (BCRAMC) CAS Latency*/
#define 	AT91C_BCRAMC_CAS_2                    ((unsigned int) 0x2 <<  4) /* (BCRAMC) 2 cycles Latency for Cellular RAM v1.0/1.5/2.0*/
#define 	AT91C_BCRAMC_CAS_3                    ((unsigned int) 0x3 <<  4) /* (BCRAMC) 3 cycles Latency for Cellular RAM v1.0/1.5/2.0*/
#define 	AT91C_BCRAMC_CAS_4                    ((unsigned int) 0x4 <<  4) /* (BCRAMC) 4 cycles Latency for Cellular RAM v1.5/2.0*/
#define 	AT91C_BCRAMC_CAS_5                    ((unsigned int) 0x5 <<  4) /* (BCRAMC) 5 cycles Latency for Cellular RAM v1.5/2.0*/
#define 	AT91C_BCRAMC_CAS_6                    ((unsigned int) 0x6 <<  4) /* (BCRAMC) 6 cycles Latency for Cellular RAM v1.5/2.0*/
#define AT91C_BCRAMC_DBW      ((unsigned int) 0x1 <<  8) /* (BCRAMC) Data Bus Width*/
#define 	AT91C_BCRAMC_DBW_32_BITS              ((unsigned int) 0x0 <<  8) /* (BCRAMC) 32 Bits datas bus*/
#define 	AT91C_BCRAMC_DBW_16_BITS              ((unsigned int) 0x1 <<  8) /* (BCRAMC) 16 Bits datas bus*/
#define AT91C_BCRAM_NWIR      ((unsigned int) 0x3 << 12) /* (BCRAMC) Number Of Words in Row*/
#define 	AT91C_BCRAM_NWIR_64                   ((unsigned int) 0x0 << 12) /* (BCRAMC) 64 Words in Row*/
#define 	AT91C_BCRAM_NWIR_128                  ((unsigned int) 0x1 << 12) /* (BCRAMC) 128 Words in Row*/
#define 	AT91C_BCRAM_NWIR_256                  ((unsigned int) 0x2 << 12) /* (BCRAMC) 256 Words in Row*/
#define 	AT91C_BCRAM_NWIR_512                  ((unsigned int) 0x3 << 12) /* (BCRAMC) 512 Words in Row*/
#define AT91C_BCRAM_ADMX      ((unsigned int) 0x1 << 16) /* (BCRAMC) ADDR / DATA Mux*/
#define 	AT91C_BCRAM_ADMX_NO_MUX               ((unsigned int) 0x0 << 16) /* (BCRAMC) No ADD/DATA Mux for Cellular RAM v1.0/1.5/2.0*/
#define 	AT91C_BCRAM_ADMX_MUX                  ((unsigned int) 0x1 << 16) /* (BCRAMC) ADD/DATA Mux Only for Cellular RAM v2.0*/
#define AT91C_BCRAM_DS        ((unsigned int) 0x3 << 20) /* (BCRAMC) Drive Strength*/
#define 	AT91C_BCRAM_DS_FULL_DRIVE           ((unsigned int) 0x0 << 20) /* (BCRAMC) Full Cellular RAM Drive*/
#define 	AT91C_BCRAM_DS_HALF_DRIVE           ((unsigned int) 0x1 << 20) /* (BCRAMC) Half Cellular RAM Drive*/
#define 	AT91C_BCRAM_DS_QUARTER_DRIVE        ((unsigned int) 0x2 << 20) /* (BCRAMC) Quarter Cellular RAM Drive*/
#define AT91C_BCRAM_VFLAT     ((unsigned int) 0x1 << 24) /* (BCRAMC) Variable or Fixed Latency*/
#define 	AT91C_BCRAM_VFLAT_VARIABLE             ((unsigned int) 0x0 << 24) /* (BCRAMC) Variable Latency*/
#define 	AT91C_BCRAM_VFLAT_FIXED                ((unsigned int) 0x1 << 24) /* (BCRAMC) Fixed Latency*/
/* -------- BCRAMC_TPR : (BCRAMC Offset: 0x4) BCRAMC Timing Parameter Register -------- */
#define AT91C_BCRAMC_TCW      ((unsigned int) 0xF <<  0) /* (BCRAMC) Chip Enable to End of Write*/
#define 	AT91C_BCRAMC_TCW_0                    ((unsigned int) 0x0) /* (BCRAMC) Value :  0*/
#define 	AT91C_BCRAMC_TCW_1                    ((unsigned int) 0x1) /* (BCRAMC) Value :  1*/
#define 	AT91C_BCRAMC_TCW_2                    ((unsigned int) 0x2) /* (BCRAMC) Value :  2*/
#define 	AT91C_BCRAMC_TCW_3                    ((unsigned int) 0x3) /* (BCRAMC) Value :  3*/
#define 	AT91C_BCRAMC_TCW_4                    ((unsigned int) 0x4) /* (BCRAMC) Value :  4*/
#define 	AT91C_BCRAMC_TCW_5                    ((unsigned int) 0x5) /* (BCRAMC) Value :  5*/
#define 	AT91C_BCRAMC_TCW_6                    ((unsigned int) 0x6) /* (BCRAMC) Value :  6*/
#define 	AT91C_BCRAMC_TCW_7                    ((unsigned int) 0x7) /* (BCRAMC) Value :  7*/
#define 	AT91C_BCRAMC_TCW_8                    ((unsigned int) 0x8) /* (BCRAMC) Value :  8*/
#define 	AT91C_BCRAMC_TCW_9                    ((unsigned int) 0x9) /* (BCRAMC) Value :  9*/
#define 	AT91C_BCRAMC_TCW_10                   ((unsigned int) 0xA) /* (BCRAMC) Value : 10*/
#define 	AT91C_BCRAMC_TCW_11                   ((unsigned int) 0xB) /* (BCRAMC) Value : 11*/
#define 	AT91C_BCRAMC_TCW_12                   ((unsigned int) 0xC) /* (BCRAMC) Value : 12*/
#define 	AT91C_BCRAMC_TCW_13                   ((unsigned int) 0xD) /* (BCRAMC) Value : 13*/
#define 	AT91C_BCRAMC_TCW_14                   ((unsigned int) 0xE) /* (BCRAMC) Value : 14*/
#define 	AT91C_BCRAMC_TCW_15                   ((unsigned int) 0xF) /* (BCRAMC) Value : 15*/
#define AT91C_BCRAMC_TCRES    ((unsigned int) 0x3 <<  4) /* (BCRAMC) CRE Setup*/
#define 	AT91C_BCRAMC_TCRES_0                    ((unsigned int) 0x0 <<  4) /* (BCRAMC) Value :  0*/
#define 	AT91C_BCRAMC_TCRES_1                    ((unsigned int) 0x1 <<  4) /* (BCRAMC) Value :  1*/
#define 	AT91C_BCRAMC_TCRES_2                    ((unsigned int) 0x2 <<  4) /* (BCRAMC) Value :  2*/
#define 	AT91C_BCRAMC_TCRES_3                    ((unsigned int) 0x3 <<  4) /* (BCRAMC) Value :  3*/
#define AT91C_BCRAMC_TCKA     ((unsigned int) 0xF <<  8) /* (BCRAMC) WE High to CLK Valid*/
#define 	AT91C_BCRAMC_TCKA_0                    ((unsigned int) 0x0 <<  8) /* (BCRAMC) Value :  0*/
#define 	AT91C_BCRAMC_TCKA_1                    ((unsigned int) 0x1 <<  8) /* (BCRAMC) Value :  1*/
#define 	AT91C_BCRAMC_TCKA_2                    ((unsigned int) 0x2 <<  8) /* (BCRAMC) Value :  2*/
#define 	AT91C_BCRAMC_TCKA_3                    ((unsigned int) 0x3 <<  8) /* (BCRAMC) Value :  3*/
#define 	AT91C_BCRAMC_TCKA_4                    ((unsigned int) 0x4 <<  8) /* (BCRAMC) Value :  4*/
#define 	AT91C_BCRAMC_TCKA_5                    ((unsigned int) 0x5 <<  8) /* (BCRAMC) Value :  5*/
#define 	AT91C_BCRAMC_TCKA_6                    ((unsigned int) 0x6 <<  8) /* (BCRAMC) Value :  6*/
#define 	AT91C_BCRAMC_TCKA_7                    ((unsigned int) 0x7 <<  8) /* (BCRAMC) Value :  7*/
#define 	AT91C_BCRAMC_TCKA_8                    ((unsigned int) 0x8 <<  8) /* (BCRAMC) Value :  8*/
#define 	AT91C_BCRAMC_TCKA_9                    ((unsigned int) 0x9 <<  8) /* (BCRAMC) Value :  9*/
#define 	AT91C_BCRAMC_TCKA_10                   ((unsigned int) 0xA <<  8) /* (BCRAMC) Value : 10*/
#define 	AT91C_BCRAMC_TCKA_11                   ((unsigned int) 0xB <<  8) /* (BCRAMC) Value : 11*/
#define 	AT91C_BCRAMC_TCKA_12                   ((unsigned int) 0xC <<  8) /* (BCRAMC) Value : 12*/
#define 	AT91C_BCRAMC_TCKA_13                   ((unsigned int) 0xD <<  8) /* (BCRAMC) Value : 13*/
#define 	AT91C_BCRAMC_TCKA_14                   ((unsigned int) 0xE <<  8) /* (BCRAMC) Value : 14*/
#define 	AT91C_BCRAMC_TCKA_15                   ((unsigned int) 0xF <<  8) /* (BCRAMC) Value : 15*/
/* -------- BCRAMC_HSR : (BCRAMC Offset: 0x8) BCRAM Controller High Speed Register -------- */
#define AT91C_BCRAMC_DA       ((unsigned int) 0x1 <<  0) /* (BCRAMC) Decode Cycle Enable Bit*/
#define 	AT91C_BCRAMC_DA_DISABLE              ((unsigned int) 0x0) /* (BCRAMC) Disable Decode Cycle*/
#define 	AT91C_BCRAMC_DA_ENABLE               ((unsigned int) 0x1) /* (BCRAMC) Enable Decode Cycle*/
/* -------- BCRAMC_LPR : (BCRAMC Offset: 0xc) BCRAM Controller Low-power Register -------- */
#define AT91C_BCRAMC_PAR      ((unsigned int) 0x7 <<  0) /* (BCRAMC) Partial Array Refresh*/
#define 	AT91C_BCRAMC_PAR_FULL                 ((unsigned int) 0x0) /* (BCRAMC) Full Refresh*/
#define 	AT91C_BCRAMC_PAR_PARTIAL_BOTTOM_HALF  ((unsigned int) 0x1) /* (BCRAMC) Partial Bottom Half Refresh*/
#define 	AT91C_BCRAMC_PAR_PARTIAL_BOTTOM_QUARTER ((unsigned int) 0x2) /* (BCRAMC) Partial Bottom Quarter Refresh*/
#define 	AT91C_BCRAMC_PAR_PARTIAL_BOTTOM_EIGTH ((unsigned int) 0x3) /* (BCRAMC) Partial Bottom eigth Refresh*/
#define 	AT91C_BCRAMC_PAR_NONE                 ((unsigned int) 0x4) /* (BCRAMC) Not Refreshed*/
#define 	AT91C_BCRAMC_PAR_PARTIAL_TOP_HALF     ((unsigned int) 0x5) /* (BCRAMC) Partial Top Half Refresh*/
#define 	AT91C_BCRAMC_PAR_PARTIAL_TOP_QUARTER  ((unsigned int) 0x6) /* (BCRAMC) Partial Top Quarter Refresh*/
#define 	AT91C_BCRAMC_PAR_PARTIAL_TOP_EIGTH    ((unsigned int) 0x7) /* (BCRAMC) Partial Top eigth Refresh*/
#define AT91C_BCRAMC_TCR      ((unsigned int) 0x3 <<  4) /* (BCRAMC) Temperature Compensated Self Refresh*/
#define 	AT91C_BCRAMC_TCR_85C                  ((unsigned int) 0x0 <<  4) /* (BCRAMC) +85C Temperature*/
#define 	AT91C_BCRAMC_TCR_INTERNAL_OR_70C      ((unsigned int) 0x1 <<  4) /* (BCRAMC) Internal Sensor or +70C Temperature*/
#define 	AT91C_BCRAMC_TCR_45C                  ((unsigned int) 0x2 <<  4) /* (BCRAMC) +45C Temperature*/
#define 	AT91C_BCRAMC_TCR_15C                  ((unsigned int) 0x3 <<  4) /* (BCRAMC) +15C Temperature*/
#define AT91C_BCRAMC_LPCB     ((unsigned int) 0x3 <<  8) /* (BCRAMC) Low-power Command Bit*/
#define 	AT91C_BCRAMC_LPCB_DISABLE              ((unsigned int) 0x0 <<  8) /* (BCRAMC) Disable Low Power Features*/
#define 	AT91C_BCRAMC_LPCB_STANDBY              ((unsigned int) 0x1 <<  8) /* (BCRAMC) Enable Cellular RAM Standby Mode*/
#define 	AT91C_BCRAMC_LPCB_DEEP_POWER_DOWN      ((unsigned int) 0x2 <<  8) /* (BCRAMC) Enable Cellular RAM Deep Power Down Mode*/
/* -------- BCRAMC_MDR : (BCRAMC Offset: 0x10) BCRAM Controller Memory Device Register -------- */
#define AT91C_BCRAMC_MD       ((unsigned int) 0x3 <<  0) /* (BCRAMC) Memory Device Type*/
#define 	AT91C_BCRAMC_MD_BCRAM_V10            ((unsigned int) 0x0) /* (BCRAMC) Busrt Cellular RAM v1.0*/
#define 	AT91C_BCRAMC_MD_BCRAM_V15            ((unsigned int) 0x1) /* (BCRAMC) Busrt Cellular RAM v1.5*/
#define 	AT91C_BCRAMC_MD_BCRAM_V20            ((unsigned int) 0x2) /* (BCRAMC) Busrt Cellular RAM v2.0*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR DDR/SDRAM Controller*/
/* ******************************************************************************/
typedef struct _AT91S_SDDRC {
	AT91_REG	 SDDRC_MR; 	/* */
	AT91_REG	 SDDRC_RTR; 	/* */
	AT91_REG	 SDDRC_CR; 	/* */
	AT91_REG	 SDDRC_T0PR; 	/* */
	AT91_REG	 SDDRC_T1PR; 	/* */
	AT91_REG	 SDDRC_HS; 	/* */
	AT91_REG	 SDDRC_LPR; 	/* */
	AT91_REG	 SDDRC_MDR; 	/* */
	AT91_REG	 Reserved0[55]; 	/* */
	AT91_REG	 SDDRC_VERSION; 	/* */
} AT91S_SDDRC, *AT91PS_SDDRC;

