una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91cap9.h
/* -------- MATRIX_MCFG : (MATRIX Offset: 0x0) Master Configuration Register rom -------- */
#define AT91C_MATRIX_ULBT     ((unsigned int) 0x7 <<  0) /* (MATRIX) Undefined Length Burst Type*/
/* -------- MATRIX_SCFG : (MATRIX Offset: 0x40) Slave Configuration Register -------- */
#define AT91C_MATRIX_SLOT_CYCLE ((unsigned int) 0xFF <<  0) /* (MATRIX) Maximum Number of Allowed Cycles for a Burst*/
#define AT91C_MATRIX_DEFMSTR_TYPE ((unsigned int) 0x3 << 16) /* (MATRIX) Default Master Type*/
#define 	AT91C_MATRIX_DEFMSTR_TYPE_NO_DEFMSTR           ((unsigned int) 0x0 << 16) /* (MATRIX) No Default Master. At the end of current slave access, if no other master request is pending, the slave is deconnected from all masters. This results in having a one cycle latency for the first transfer of a burst.*/
#define 	AT91C_MATRIX_DEFMSTR_TYPE_LAST_DEFMSTR         ((unsigned int) 0x1 << 16) /* (MATRIX) Last Default Master. At the end of current slave access, if no other master request is pending, the slave stay connected with the last master having accessed it. This results in not having the one cycle latency when the last master re-trying access on the slave.*/
#define 	AT91C_MATRIX_DEFMSTR_TYPE_FIXED_DEFMSTR        ((unsigned int) 0x2 << 16) /* (MATRIX) Fixed Default Master. At the end of current slave access, if no other master request is pending, the slave connects with fixed which number is in FIXED_DEFMSTR field. This results in not having the one cycle latency when the fixed master re-trying access on the slave.*/
#define AT91C_MATRIX_FIXED_DEFMSTR ((unsigned int) 0x7 << 18) /* (MATRIX) Fixed Index of Default Master*/
#define 	AT91C_MATRIX_FIXED_DEFMSTR_ARM926I              ((unsigned int) 0x0 << 18) /* (MATRIX) ARM926EJ-S Instruction Master is Default Master*/
#define 	AT91C_MATRIX_FIXED_DEFMSTR_ARM926D              ((unsigned int) 0x1 << 18) /* (MATRIX) ARM926EJ-S Data Master is Default Master*/
#define 	AT91C_MATRIX_FIXED_DEFMSTR_PDC                  ((unsigned int) 0x2 << 18) /* (MATRIX) PDC Master is Default Master*/
#define 	AT91C_MATRIX_FIXED_DEFMSTR_LCDC                 ((unsigned int) 0x3 << 18) /* (MATRIX) LCDC Master is Default Master*/
#define 	AT91C_MATRIX_FIXED_DEFMSTR_2DGC                 ((unsigned int) 0x4 << 18) /* (MATRIX) 2DGC Master is Default Master*/
#define 	AT91C_MATRIX_FIXED_DEFMSTR_ISI                  ((unsigned int) 0x5 << 18) /* (MATRIX) ISI Master is Default Master*/
#define 	AT91C_MATRIX_FIXED_DEFMSTR_DMA                  ((unsigned int) 0x6 << 18) /* (MATRIX) DMA Controller Master is Default Master*/
#define 	AT91C_MATRIX_FIXED_DEFMSTR_EMAC                 ((unsigned int) 0x7 << 18) /* (MATRIX) EMAC Master is Default Master*/
#define 	AT91C_MATRIX_FIXED_DEFMSTR_USB                  ((unsigned int) 0x8 << 18) /* (MATRIX) USB Master is Default Master*/
#define AT91C_MATRIX_ARBT     ((unsigned int) 0x3 << 24) /* (MATRIX) Arbitration Type*/
/* -------- MATRIX_MRCR : (MATRIX Offset: 0x100) MRCR Register -------- */
#define AT91C_MATRIX_RCA926I  ((unsigned int) 0x1 <<  0) /* (MATRIX) Remap Command Bit for ARM926EJ-S Instruction*/
#define AT91C_MATRIX_RCA926D  ((unsigned int) 0x1 <<  1) /* (MATRIX) Remap Command Bit for ARM926EJ-S Data*/
#define AT91C_MATRIX_RCB2     ((unsigned int) 0x1 <<  2) /* (MATRIX) Remap Command Bit for PDC*/
#define AT91C_MATRIX_RCB3     ((unsigned int) 0x1 <<  3) /* (MATRIX) Remap Command Bit for LCD*/
#define AT91C_MATRIX_RCB4     ((unsigned int) 0x1 <<  4) /* (MATRIX) Remap Command Bit for 2DGC*/
#define AT91C_MATRIX_RCB5     ((unsigned int) 0x1 <<  5) /* (MATRIX) Remap Command Bit for ISI*/
#define AT91C_MATRIX_RCB6     ((unsigned int) 0x1 <<  6) /* (MATRIX) Remap Command Bit for DMA*/
#define AT91C_MATRIX_RCB7     ((unsigned int) 0x1 <<  7) /* (MATRIX) Remap Command Bit for EMAC*/
#define AT91C_MATRIX_RCB8     ((unsigned int) 0x1 <<  8) /* (MATRIX) Remap Command Bit for USB*/
#define AT91C_MATRIX_RCB9     ((unsigned int) 0x1 <<  9) /* (MATRIX) Remap Command Bit for USB*/
#define AT91C_MATRIX_RCB10    ((unsigned int) 0x1 << 10) /* (MATRIX) Remap Command Bit for USB*/
#define AT91C_MATRIX_RCB11    ((unsigned int) 0x1 << 11) /* (MATRIX) Remap Command Bit for USB*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR AHB CCFG Interface*/
/* ******************************************************************************/
typedef struct _AT91S_CCFG {
	AT91_REG	 CCFG_RAM; 	/*  Slave 0 (Ram) Special Function Register*/
	AT91_REG	 CCFG_MPBS0; 	/*  Slave 1 (MP Block Slave 0) Special Function Register*/
	AT91_REG	 CCFG_UDPHS; 	/*  Slave 2 (AHB Periphs) Special Function Register*/
	AT91_REG	 CCFG_MPBS1; 	/*  Slave 3 (MP Block Slave 1) Special Function Register*/
	AT91_REG	 CCFG_EBICSA; 	/*  EBI Chip Select Assignement Register*/
	AT91_REG	 CCFG_HDDRC2; 	/*  Slave 5 (DDRC Port 2) Special Function Register*/
	AT91_REG	 CCFG_HDDRC3; 	/*  Slave 6 (DDRC Port 3) Special Function Register*/
	AT91_REG	 CCFG_MPBS2; 	/*  Slave 7 (MP Block Slave 2) Special Function Register*/
	AT91_REG	 CCFG_MPBS3; 	/*  Slave 7 (MP Block Slave 3) Special Function Register*/
	AT91_REG	 CCFG_BRIDGE; 	/*  Slave 8 (APB Bridge) Special Function Register*/
	AT91_REG	 Reserved0[49]; 	/* */
	AT91_REG	 CCFG_MATRIXVERSION; 	/*  Version Register*/
} AT91S_CCFG, *AT91PS_CCFG;

/* -------- CCFG_TCMR : (CCFG Offset: 0x0) TCM Configuration -------- */
#define AT91C_CCFG_ITCM_SIZE  ((unsigned int) 0xF <<  0) /* (CCFG) Size of ITCM enabled memory block*/
#define 	AT91C_CCFG_ITCM_SIZE_0KB                  ((unsigned int) 0x0) /* (CCFG) 0 KB (No ITCM Memory)*/
#define 	AT91C_CCFG_ITCM_SIZE_16KB                 ((unsigned int) 0x5) /* (CCFG) 16 KB*/
#define 	AT91C_CCFG_ITCM_SIZE_32KB                 ((unsigned int) 0x6) /* (CCFG) 32 KB*/
#define AT91C_CCFG_DTCM_SIZE  ((unsigned int) 0xF <<  4) /* (CCFG) Size of DTCM enabled memory block*/
#define 	AT91C_CCFG_DTCM_SIZE_0KB                  ((unsigned int) 0x0 <<  4) /* (CCFG) 0 KB (No DTCM Memory)*/
#define 	AT91C_CCFG_DTCM_SIZE_16KB                 ((unsigned int) 0x5 <<  4) /* (CCFG) 16 KB*/
#define 	AT91C_CCFG_DTCM_SIZE_32KB                 ((unsigned int) 0x6 <<  4) /* (CCFG) 32 KB*/
#define AT91C_CCFG_WAIT_STATE_TCM ((unsigned int) 0x1 << 11) /* (CCFG) Wait state TCM register*/
#define 	AT91C_CCFG_WAIT_STATE_TCM_NO_WS                ((unsigned int) 0x0 << 11) /* (CCFG) NO WAIT STATE : 0 WS*/
#define 	AT91C_CCFG_WAIT_STATE_TCM_ONE_WS               ((unsigned int) 0x1 << 11) /* (CCFG) 1 WS activated (only for RATIO 3:1 or 4:1*/
/* -------- CCFG_UDPHS : (CCFG Offset: 0x8) UDPHS Configuration -------- */
#define AT91C_CCFG_UDPHS_UDP_SELECT ((unsigned int) 0x1 << 31) /* (CCFG) UDPHS or UDP Selection*/
#define 	AT91C_CCFG_UDPHS_UDP_SELECT_UDPHS                ((unsigned int) 0x0 << 31) /* (CCFG) UDPHS Selected.*/
#define 	AT91C_CCFG_UDPHS_UDP_SELECT_UDP                  ((unsigned int) 0x1 << 31) /* (CCFG) UDP Selected.*/
/* -------- CCFG_EBICSA : (CCFG Offset: 0x10) EBI Chip Select Assignement Register -------- */
#define AT91C_EBI_CS1A        ((unsigned int) 0x1 <<  1) /* (CCFG) Chip Select 1 Assignment*/
#define 	AT91C_EBI_CS1A_SMC                  ((unsigned int) 0x0 <<  1) /* (CCFG) Chip Select 1 is assigned to the Static Memory Controller.*/
#define 	AT91C_EBI_CS1A_BCRAMC               ((unsigned int) 0x1 <<  1) /* (CCFG) Chip Select 1 is assigned to the BCRAM Controller.*/
#define AT91C_EBI_CS3A        ((unsigned int) 0x1 <<  3) /* (CCFG) Chip Select 3 Assignment*/
#define 	AT91C_EBI_CS3A_SMC                  ((unsigned int) 0x0 <<  3) /* (CCFG) Chip Select 3 is only assigned to the Static Memory Controller and NCS3 behaves as defined by the SMC.*/
#define 	AT91C_EBI_CS3A_SM                   ((unsigned int) 0x1 <<  3) /* (CCFG) Chip Select 3 is assigned to the Static Memory Controller and the SmartMedia Logic is activated.*/
#define AT91C_EBI_CS4A        ((unsigned int) 0x1 <<  4) /* (CCFG) Chip Select 4 Assignment*/
#define 	AT91C_EBI_CS4A_SMC                  ((unsigned int) 0x0 <<  4) /* (CCFG) Chip Select 4 is only assigned to the Static Memory Controller and NCS4 behaves as defined by the SMC.*/
#define 	AT91C_EBI_CS4A_CF                   ((unsigned int) 0x1 <<  4) /* (CCFG) Chip Select 4 is assigned to the Static Memory Controller and the CompactFlash Logic (first slot) is activated.*/
#define AT91C_EBI_CS5A        ((unsigned int) 0x1 <<  5) /* (CCFG) Chip Select 5 Assignment*/
#define 	AT91C_EBI_CS5A_SMC                  ((unsigned int) 0x0 <<  5) /* (CCFG) Chip Select 5 is only assigned to the Static Memory Controller and NCS5 behaves as defined by the SMC*/
#define 	AT91C_EBI_CS5A_CF                   ((unsigned int) 0x1 <<  5) /* (CCFG) Chip Select 5 is assigned to the Static Memory Controller and the CompactFlash Logic (second slot) is activated.*/
#define AT91C_EBI_DBPUC       ((unsigned int) 0x1 <<  8) /* (CCFG) Data Bus Pull-up Configuration*/
#define AT91C_EBI_DDRPUC      ((unsigned int) 0x1 <<  9) /* (CCFG) DDDR DQS Pull-up Configuration*/
#define AT91C_EBI_SUP         ((unsigned int) 0x1 << 16) /* (CCFG) EBI Supply*/
#define 	AT91C_EBI_SUP_1V8                  ((unsigned int) 0x0 << 16) /* (CCFG) EBI Supply is 1.8V*/
#define 	AT91C_EBI_SUP_3V3                  ((unsigned int) 0x1 << 16) /* (CCFG) EBI Supply is 3.3V*/
#define AT91C_EBI_LP          ((unsigned int) 0x1 << 17) /* (CCFG) EBI Low Power Reduction*/
#define 	AT91C_EBI_LP_LOW_DRIVE            ((unsigned int) 0x0 << 17) /* (CCFG) EBI Pads are in Standard drive*/
#define 	AT91C_EBI_LP_STD_DRIVE            ((unsigned int) 0x1 << 17) /* (CCFG) EBI Pads are in Low Drive (Low Power)*/
#define AT91C_CCFG_DDR_SDR_SELECT ((unsigned int) 0x1 << 31) /* (CCFG) DDR or SDR Selection*/
#define 	AT91C_CCFG_DDR_SDR_SELECT_DDR                  ((unsigned int) 0x0 << 31) /* (CCFG) DDR Selected.*/
#define 	AT91C_CCFG_DDR_SDR_SELECT_SDR                  ((unsigned int) 0x1 << 31) /* (CCFG) SDR Selected.*/
/* -------- CCFG_EBI1CSA : (CCFG Offset: 0x14) EBI1 Chip Select Assignement Register -------- */
#define AT91C_EBI_CS2A        ((unsigned int) 0x1 <<  3) /* (CCFG) EBI1 Chip Select 2 Assignment*/
#define 	AT91C_EBI_CS2A_SMC                  ((unsigned int) 0x0 <<  3) /* (CCFG) Chip Select 2 is assigned to the Static Memory Controller.*/
#define 	AT91C_EBI_CS2A_SM                   ((unsigned int) 0x1 <<  3) /* (CCFG) Chip Select 2 is assigned to the Static Memory Controller and the SmartMedia Logic is activated.*/
/* -------- CCFG_EBICSA : (CCFG Offset: 0x18) EBI Chip Select Assignement Register -------- */
#define AT91C_EBI_SUPPLY      ((unsigned int) 0x1 << 16) /* (CCFG) EBI supply set to 1.8*/
#define AT91C_EBI_DRV         ((unsigned int) 0x1 << 17) /* (CCFG) Drive type for EBI pads*/
#define AT91C_CCFG_DDR_DRV    ((unsigned int) 0x1 << 18) /* (CCFG) Drive type for DDR2 dedicated port*/
/* -------- CCFG_BRIDGE : (CCFG Offset: 0x24) BRIDGE Configuration -------- */
#define AT91C_CCFG_AES_TDES_SELECT ((unsigned int) 0x1 << 31) /* (CCFG) AES or TDES Selection*/
#define 	AT91C_CCFG_AES_TDES_SELECT_AES                  ((unsigned int) 0x0 << 31) /* (CCFG) AES Selected.*/
#define 	AT91C_CCFG_AES_TDES_SELECT_TDES                 ((unsigned int) 0x1 << 31) /* (CCFG) TDES Selected.*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Peripheral DMA Controller*/
/* ******************************************************************************/
typedef struct _AT91S_PDC {
	AT91_REG	 PDC_RPR; 	/* Receive Pointer Register*/
	AT91_REG	 PDC_RCR; 	/* Receive Counter Register*/
	AT91_REG	 PDC_TPR; 	/* Transmit Pointer Register*/
	AT91_REG	 PDC_TCR; 	/* Transmit Counter Register*/
	AT91_REG	 PDC_RNPR; 	/* Receive Next Pointer Register*/
	AT91_REG	 PDC_RNCR; 	/* Receive Next Counter Register*/
	AT91_REG	 PDC_TNPR; 	/* Transmit Next Pointer Register*/
	AT91_REG	 PDC_TNCR; 	/* Transmit Next Counter Register*/
	AT91_REG	 PDC_PTCR; 	/* PDC Transfer Control Register*/
	AT91_REG	 PDC_PTSR; 	/* PDC Transfer Status Register*/
} AT91S_PDC, *AT91PS_PDC;

/* -------- PDC_PTCR : (PDC Offset: 0x20) PDC Transfer Control Register -------- */
#define AT91C_PDC_RXTEN       ((unsigned int) 0x1 <<  0) /* (PDC) Receiver Transfer Enable*/
#define AT91C_PDC_RXTDIS      ((unsigned int) 0x1 <<  1) /* (PDC) Receiver Transfer Disable*/
#define AT91C_PDC_TXTEN       ((unsigned int) 0x1 <<  8) /* (PDC) Transmitter Transfer Enable*/
#define AT91C_PDC_TXTDIS      ((unsigned int) 0x1 <<  9) /* (PDC) Transmitter Transfer Disable*/
/* -------- PDC_PTSR : (PDC Offset: 0x24) PDC Transfer Status Register -------- */

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Debug Unit*/
/* ******************************************************************************/
typedef struct _AT91S_DBGU {
	AT91_REG	 DBGU_CR; 	/* Control Register*/
	AT91_REG	 DBGU_MR; 	/* Mode Register*/
	AT91_REG	 DBGU_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 DBGU_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 DBGU_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 DBGU_CSR; 	/* Channel Status Register*/
	AT91_REG	 DBGU_RHR; 	/* Receiver Holding Register*/
	AT91_REG	 DBGU_THR; 	/* Transmitter Holding Register*/
	AT91_REG	 DBGU_BRGR; 	/* Baud Rate Generator Register*/
	AT91_REG	 Reserved0[7]; 	/* */
	AT91_REG	 DBGU_CIDR; 	/* Chip ID Register*/
	AT91_REG	 DBGU_EXID; 	/* Chip ID Extension Register*/
	AT91_REG	 DBGU_FNTR; 	/* Force NTRST Register*/
	AT91_REG	 Reserved1[45]; 	/* */
	AT91_REG	 DBGU_RPR; 	/* Receive Pointer Register*/
	AT91_REG	 DBGU_RCR; 	/* Receive Counter Register*/
	AT91_REG	 DBGU_TPR; 	/* Transmit Pointer Register*/
	AT91_REG	 DBGU_TCR; 	/* Transmit Counter Register*/
	AT91_REG	 DBGU_RNPR; 	/* Receive Next Pointer Register*/
	AT91_REG	 DBGU_RNCR; 	/* Receive Next Counter Register*/
	AT91_REG	 DBGU_TNPR; 	/* Transmit Next Pointer Register*/
	AT91_REG	 DBGU_TNCR; 	/* Transmit Next Counter Register*/
	AT91_REG	 DBGU_PTCR; 	/* PDC Transfer Control Register*/
	AT91_REG	 DBGU_PTSR; 	/* PDC Transfer Status Register*/
} AT91S_DBGU, *AT91PS_DBGU;

