una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91cap9.h
/* -------- UDPHS_EPTCFG : (UDPHS_EPT Offset: 0x0) UDPHS Endpoint Config Register -------- */
#define AT91C_UDPHS_EPT_SIZE  ((unsigned int) 0x7 <<  0) /* (UDPHS_EPT) Endpoint Size*/
#define 	AT91C_UDPHS_EPT_SIZE_8                    ((unsigned int) 0x0) /* (UDPHS_EPT)    8 bytes*/
#define 	AT91C_UDPHS_EPT_SIZE_16                   ((unsigned int) 0x1) /* (UDPHS_EPT)   16 bytes*/
#define 	AT91C_UDPHS_EPT_SIZE_32                   ((unsigned int) 0x2) /* (UDPHS_EPT)   32 bytes*/
#define 	AT91C_UDPHS_EPT_SIZE_64                   ((unsigned int) 0x3) /* (UDPHS_EPT)   64 bytes*/
#define 	AT91C_UDPHS_EPT_SIZE_128                  ((unsigned int) 0x4) /* (UDPHS_EPT)  128 bytes*/
#define 	AT91C_UDPHS_EPT_SIZE_256                  ((unsigned int) 0x5) /* (UDPHS_EPT)  256 bytes (if possible)*/
#define 	AT91C_UDPHS_EPT_SIZE_512                  ((unsigned int) 0x6) /* (UDPHS_EPT)  512 bytes (if possible)*/
#define 	AT91C_UDPHS_EPT_SIZE_1024                 ((unsigned int) 0x7) /* (UDPHS_EPT) 1024 bytes (if possible)*/
#define AT91C_UDPHS_EPT_DIR   ((unsigned int) 0x1 <<  3) /* (UDPHS_EPT) Endpoint Direction 0:OUT, 1:IN*/
#define 	AT91C_UDPHS_EPT_DIR_OUT                  ((unsigned int) 0x0 <<  3) /* (UDPHS_EPT) Direction OUT*/
#define 	AT91C_UDPHS_EPT_DIR_IN                   ((unsigned int) 0x1 <<  3) /* (UDPHS_EPT) Direction IN*/
#define AT91C_UDPHS_EPT_TYPE  ((unsigned int) 0x3 <<  4) /* (UDPHS_EPT) Endpoint Type*/
#define 	AT91C_UDPHS_EPT_TYPE_CTL_EPT              ((unsigned int) 0x0 <<  4) /* (UDPHS_EPT) Control endpoint*/
#define 	AT91C_UDPHS_EPT_TYPE_ISO_EPT              ((unsigned int) 0x1 <<  4) /* (UDPHS_EPT) Isochronous endpoint*/
#define 	AT91C_UDPHS_EPT_TYPE_BUL_EPT              ((unsigned int) 0x2 <<  4) /* (UDPHS_EPT) Bulk endpoint*/
#define 	AT91C_UDPHS_EPT_TYPE_INT_EPT              ((unsigned int) 0x3 <<  4) /* (UDPHS_EPT) Interrupt endpoint*/
#define AT91C_UDPHS_BK_NUMBER ((unsigned int) 0x3 <<  6) /* (UDPHS_EPT) Number of Banks*/
#define 	AT91C_UDPHS_BK_NUMBER_0                    ((unsigned int) 0x0 <<  6) /* (UDPHS_EPT) Zero Bank, the EndPoint is not mapped in memory*/
#define 	AT91C_UDPHS_BK_NUMBER_1                    ((unsigned int) 0x1 <<  6) /* (UDPHS_EPT) One Bank (Bank0)*/
#define 	AT91C_UDPHS_BK_NUMBER_2                    ((unsigned int) 0x2 <<  6) /* (UDPHS_EPT) Double bank (Ping-Pong : Bank0 / Bank1)*/
#define 	AT91C_UDPHS_BK_NUMBER_3                    ((unsigned int) 0x3 <<  6) /* (UDPHS_EPT) Triple Bank (Bank0 / Bank1 / Bank2) (if possible)*/
#define AT91C_UDPHS_NB_TRANS  ((unsigned int) 0x3 <<  8) /* (UDPHS_EPT) Number Of Transaction per Micro-Frame (High-Bandwidth iso only)*/
#define AT91C_UDPHS_EPT_MAPD  ((unsigned int) 0x1 << 31) /* (UDPHS_EPT) Endpoint Mapped (read only*/
/* -------- UDPHS_EPTCTLENB : (UDPHS_EPT Offset: 0x4) UDPHS Endpoint Control Enable Register -------- */
#define AT91C_UDPHS_EPT_ENABL ((unsigned int) 0x1 <<  0) /* (UDPHS_EPT) Endpoint Enable*/
#define AT91C_UDPHS_AUTO_VALID ((unsigned int) 0x1 <<  1) /* (UDPHS_EPT) Packet Auto-Valid Enable/Disable*/
#define AT91C_UDPHS_INTDIS_DMA ((unsigned int) 0x1 <<  3) /* (UDPHS_EPT) Endpoint Interrupts DMA Request Enable/Disable*/
#define AT91C_UDPHS_NYET_DIS  ((unsigned int) 0x1 <<  4) /* (UDPHS_EPT) NYET Enable/Disable*/
#define AT91C_UDPHS_DATAX_RX  ((unsigned int) 0x1 <<  6) /* (UDPHS_EPT) DATAx Interrupt Enable/Disable*/
#define AT91C_UDPHS_MDATA_RX  ((unsigned int) 0x1 <<  7) /* (UDPHS_EPT) MDATA Interrupt Enabled/Disable*/
#define AT91C_UDPHS_ERR_OVFLW ((unsigned int) 0x1 <<  8) /* (UDPHS_EPT) OverFlow Error Interrupt Enable/Disable/Status*/
#define AT91C_UDPHS_RX_BK_RDY ((unsigned int) 0x1 <<  9) /* (UDPHS_EPT) Received OUT Data*/
#define AT91C_UDPHS_TX_COMPLT ((unsigned int) 0x1 << 10) /* (UDPHS_EPT) Transmitted IN Data Complete Interrupt Enable/Disable or Transmitted IN Data Complete (clear)*/
#define AT91C_UDPHS_ERR_TRANS ((unsigned int) 0x1 << 11) /* (UDPHS_EPT) Transaction Error Interrupt Enable/Disable*/
#define AT91C_UDPHS_TX_PK_RDY ((unsigned int) 0x1 << 11) /* (UDPHS_EPT) TX Packet Ready Interrupt Enable/Disable*/
#define AT91C_UDPHS_RX_SETUP  ((unsigned int) 0x1 << 12) /* (UDPHS_EPT) Received SETUP Interrupt Enable/Disable*/
#define AT91C_UDPHS_ERR_FL_ISO ((unsigned int) 0x1 << 12) /* (UDPHS_EPT) Error Flow Clear/Interrupt Enable/Disable*/
#define AT91C_UDPHS_STALL_SNT ((unsigned int) 0x1 << 13) /* (UDPHS_EPT) Stall Sent Clear*/
#define AT91C_UDPHS_ERR_CRISO ((unsigned int) 0x1 << 13) /* (UDPHS_EPT) CRC error / Error NB Trans / Interrupt Enable/Disable*/
#define AT91C_UDPHS_NAK_IN    ((unsigned int) 0x1 << 14) /* (UDPHS_EPT) NAKIN ERROR FLUSH / Clear / Interrupt Enable/Disable*/
#define AT91C_UDPHS_NAK_OUT   ((unsigned int) 0x1 << 15) /* (UDPHS_EPT) NAKOUT / Clear / Interrupt Enable/Disable*/
#define AT91C_UDPHS_BUSY_BANK ((unsigned int) 0x1 << 18) /* (UDPHS_EPT) Busy Bank Interrupt Enable/Disable*/
#define AT91C_UDPHS_SHRT_PCKT ((unsigned int) 0x1 << 31) /* (UDPHS_EPT) Short Packet / Interrupt Enable/Disable*/
/* -------- UDPHS_EPTCTLDIS : (UDPHS_EPT Offset: 0x8) UDPHS Endpoint Control Disable Register -------- */
#define AT91C_UDPHS_EPT_DISABL ((unsigned int) 0x1 <<  0) /* (UDPHS_EPT) Endpoint Disable*/
/* -------- UDPHS_EPTCTL : (UDPHS_EPT Offset: 0xc) UDPHS Endpoint Control Register -------- */
/* -------- UDPHS_EPTSETSTA : (UDPHS_EPT Offset: 0x14) UDPHS Endpoint Set Status Register -------- */
#define AT91C_UDPHS_FRCESTALL ((unsigned int) 0x1 <<  5) /* (UDPHS_EPT) Stall Handshake Request Set/Clear/Status*/
#define AT91C_UDPHS_KILL_BANK ((unsigned int) 0x1 <<  9) /* (UDPHS_EPT) KILL Bank*/
/* -------- UDPHS_EPTCLRSTA : (UDPHS_EPT Offset: 0x18) UDPHS Endpoint Clear Status Register -------- */
#define AT91C_UDPHS_TOGGLESQ  ((unsigned int) 0x1 <<  6) /* (UDPHS_EPT) Data Toggle Clear*/
/* -------- UDPHS_EPTSTA : (UDPHS_EPT Offset: 0x1c) UDPHS Endpoint Status Register -------- */
#define AT91C_UDPHS_TOGGLESQ_STA ((unsigned int) 0x3 <<  6) /* (UDPHS_EPT) Toggle Sequencing*/
#define 	AT91C_UDPHS_TOGGLESQ_STA_00                   ((unsigned int) 0x0 <<  6) /* (UDPHS_EPT) Data0*/
#define 	AT91C_UDPHS_TOGGLESQ_STA_01                   ((unsigned int) 0x1 <<  6) /* (UDPHS_EPT) Data1*/
#define 	AT91C_UDPHS_TOGGLESQ_STA_10                   ((unsigned int) 0x2 <<  6) /* (UDPHS_EPT) Data2 (only for High-Bandwidth Isochronous EndPoint)*/
#define 	AT91C_UDPHS_TOGGLESQ_STA_11                   ((unsigned int) 0x3 <<  6) /* (UDPHS_EPT) MData (only for High-Bandwidth Isochronous EndPoint)*/
#define AT91C_UDPHS_CONTROL_DIR ((unsigned int) 0x3 << 16) /* (UDPHS_EPT) */
#define 	AT91C_UDPHS_CONTROL_DIR_00                   ((unsigned int) 0x0 << 16) /* (UDPHS_EPT) Bank 0*/
#define 	AT91C_UDPHS_CONTROL_DIR_01                   ((unsigned int) 0x1 << 16) /* (UDPHS_EPT) Bank 1*/
#define 	AT91C_UDPHS_CONTROL_DIR_10                   ((unsigned int) 0x2 << 16) /* (UDPHS_EPT) Bank 2*/
#define 	AT91C_UDPHS_CONTROL_DIR_11                   ((unsigned int) 0x3 << 16) /* (UDPHS_EPT) Invalid*/
#define AT91C_UDPHS_CURRENT_BANK ((unsigned int) 0x3 << 16) /* (UDPHS_EPT) */
#define 	AT91C_UDPHS_CURRENT_BANK_00                   ((unsigned int) 0x0 << 16) /* (UDPHS_EPT) Bank 0*/
#define 	AT91C_UDPHS_CURRENT_BANK_01                   ((unsigned int) 0x1 << 16) /* (UDPHS_EPT) Bank 1*/
#define 	AT91C_UDPHS_CURRENT_BANK_10                   ((unsigned int) 0x2 << 16) /* (UDPHS_EPT) Bank 2*/
#define 	AT91C_UDPHS_CURRENT_BANK_11                   ((unsigned int) 0x3 << 16) /* (UDPHS_EPT) Invalid*/
#define AT91C_UDPHS_BUSY_BANK_STA ((unsigned int) 0x3 << 18) /* (UDPHS_EPT) Busy Bank Number*/
#define 	AT91C_UDPHS_BUSY_BANK_STA_00                   ((unsigned int) 0x0 << 18) /* (UDPHS_EPT) All banks are free*/
#define 	AT91C_UDPHS_BUSY_BANK_STA_01                   ((unsigned int) 0x1 << 18) /* (UDPHS_EPT) 1 busy bank*/
#define 	AT91C_UDPHS_BUSY_BANK_STA_10                   ((unsigned int) 0x2 << 18) /* (UDPHS_EPT) 2 busy banks*/
#define 	AT91C_UDPHS_BUSY_BANK_STA_11                   ((unsigned int) 0x3 << 18) /* (UDPHS_EPT) 3 busy banks (if possible)*/
#define AT91C_UDPHS_BYTE_COUNT ((unsigned int) 0x7FF << 20) /* (UDPHS_EPT) UDPHS Byte Count*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR UDPHS DMA struct*/
/* ******************************************************************************/
typedef struct _AT91S_UDPHS_DMA {
	AT91_REG	 UDPHS_DMANXTDSC; 	/* UDPHS DMA Channel Next Descriptor Address*/
	AT91_REG	 UDPHS_DMAADDRESS; 	/* UDPHS DMA Channel Address Register*/
	AT91_REG	 UDPHS_DMACONTROL; 	/* UDPHS DMA Channel Control Register*/
	AT91_REG	 UDPHS_DMASTATUS; 	/* UDPHS DMA Channel Status Register*/
} AT91S_UDPHS_DMA, *AT91PS_UDPHS_DMA;

/* -------- UDPHS_DMANXTDSC : (UDPHS_DMA Offset: 0x0) UDPHS DMA Next Descriptor Address Register -------- */
#define AT91C_UDPHS_NXT_DSC_ADD ((unsigned int) 0xFFFFFFF <<  4) /* (UDPHS_DMA) next Channel Descriptor*/
/* -------- UDPHS_DMAADDRESS : (UDPHS_DMA Offset: 0x4) UDPHS DMA Channel Address Register -------- */
#define AT91C_UDPHS_BUFF_ADD  ((unsigned int) 0x0 <<  0) /* (UDPHS_DMA) starting address of a DMA Channel transfer*/
/* -------- UDPHS_DMACONTROL : (UDPHS_DMA Offset: 0x8) UDPHS DMA Channel Control Register -------- */
#define AT91C_UDPHS_CHANN_ENB ((unsigned int) 0x1 <<  0) /* (UDPHS_DMA) Channel Enabled*/
#define AT91C_UDPHS_LDNXT_DSC ((unsigned int) 0x1 <<  1) /* (UDPHS_DMA) Load Next Channel Transfer Descriptor Enable*/
#define AT91C_UDPHS_END_TR_EN ((unsigned int) 0x1 <<  2) /* (UDPHS_DMA) Buffer Close Input Enable*/
#define AT91C_UDPHS_END_B_EN  ((unsigned int) 0x1 <<  3) /* (UDPHS_DMA) End of DMA Buffer Packet Validation*/
#define AT91C_UDPHS_END_TR_IT ((unsigned int) 0x1 <<  4) /* (UDPHS_DMA) End Of Transfer Interrupt Enable*/
#define AT91C_UDPHS_END_BUFFIT ((unsigned int) 0x1 <<  5) /* (UDPHS_DMA) End Of Channel Buffer Interrupt Enable*/
#define AT91C_UDPHS_DESC_LD_IT ((unsigned int) 0x1 <<  6) /* (UDPHS_DMA) Descriptor Loaded Interrupt Enable*/
#define AT91C_UDPHS_BURST_LCK ((unsigned int) 0x1 <<  7) /* (UDPHS_DMA) Burst Lock Enable*/
#define AT91C_UDPHS_BUFF_LENGTH ((unsigned int) 0xFFFF << 16) /* (UDPHS_DMA) Buffer Byte Length (write only)*/
/* -------- UDPHS_DMASTATUS : (UDPHS_DMA Offset: 0xc) UDPHS DMA Channelx Status Register -------- */
#define AT91C_UDPHS_CHANN_ACT ((unsigned int) 0x1 <<  1) /* (UDPHS_DMA) */
#define AT91C_UDPHS_END_TR_ST ((unsigned int) 0x1 <<  4) /* (UDPHS_DMA) */
#define AT91C_UDPHS_END_BF_ST ((unsigned int) 0x1 <<  5) /* (UDPHS_DMA) */
#define AT91C_UDPHS_DESC_LDST ((unsigned int) 0x1 <<  6) /* (UDPHS_DMA) */
#define AT91C_UDPHS_BUFF_COUNT ((unsigned int) 0xFFFF << 16) /* (UDPHS_DMA) */

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR UDPHS High Speed Device Interface*/
/* ******************************************************************************/
typedef struct _AT91S_UDPHS {
	AT91_REG	 UDPHS_CTRL; 	/* UDPHS Control Register*/
	AT91_REG	 UDPHS_FNUM; 	/* UDPHS Frame Number Register*/
	AT91_REG	 Reserved0[2]; 	/* */
	AT91_REG	 UDPHS_IEN; 	/* UDPHS Interrupt Enable Register*/
	AT91_REG	 UDPHS_INTSTA; 	/* UDPHS Interrupt Status Register*/
	AT91_REG	 UDPHS_CLRINT; 	/* UDPHS Clear Interrupt Register*/
	AT91_REG	 UDPHS_EPTRST; 	/* UDPHS Endpoints Reset Register*/
	AT91_REG	 Reserved1[44]; 	/* */
	AT91_REG	 UDPHS_TSTSOFCNT; 	/* UDPHS Test SOF Counter Register*/
	AT91_REG	 UDPHS_TSTCNTA; 	/* UDPHS Test A Counter Register*/
	AT91_REG	 UDPHS_TSTCNTB; 	/* UDPHS Test B Counter Register*/
	AT91_REG	 UDPHS_TSTMODREG; 	/* UDPHS Test Mode Register*/
	AT91_REG	 UDPHS_TST; 	/* UDPHS Test Register*/
	AT91_REG	 Reserved2[2]; 	/* */
	AT91_REG	 UDPHS_RIPPADDRSIZE; 	/* UDPHS PADDRSIZE Register*/
	AT91_REG	 UDPHS_RIPNAME1; 	/* UDPHS Name1 Register*/
	AT91_REG	 UDPHS_RIPNAME2; 	/* UDPHS Name2 Register*/
	AT91_REG	 UDPHS_IPFEATURES; 	/* UDPHS Features Register*/
	AT91_REG	 UDPHS_IPVERSION; 	/* UDPHS Version Register*/
	AT91S_UDPHS_EPT	 UDPHS_EPT[8]; 	/* UDPHS Endpoint struct*/
	AT91_REG	 Reserved3[64]; 	/* */
	AT91S_UDPHS_DMA	 UDPHS_DMA[6]; 	/* UDPHS DMA channel struct (not use [0])*/
} AT91S_UDPHS, *AT91PS_UDPHS;

/* -------- UDPHS_CTRL : (UDPHS Offset: 0x0) UDPHS Control Register -------- */
#define AT91C_UDPHS_DEV_ADDR  ((unsigned int) 0x7F <<  0) /* (UDPHS) UDPHS Address*/
#define AT91C_UDPHS_FADDR_EN  ((unsigned int) 0x1 <<  7) /* (UDPHS) Function Address Enable*/
#define AT91C_UDPHS_EN_UDPHS  ((unsigned int) 0x1 <<  8) /* (UDPHS) UDPHS Enable*/
#define AT91C_UDPHS_DETACH    ((unsigned int) 0x1 <<  9) /* (UDPHS) Detach Command*/
#define AT91C_UDPHS_REWAKEUP  ((unsigned int) 0x1 << 10) /* (UDPHS) Send Remote Wake Up*/
#define AT91C_UDPHS_PULLD_DIS ((unsigned int) 0x1 << 11) /* (UDPHS) PullDown Disable*/
/* -------- UDPHS_FNUM : (UDPHS Offset: 0x4) UDPHS Frame Number Register -------- */
#define AT91C_UDPHS_MICRO_FRAME_NUM ((unsigned int) 0x7 <<  0) /* (UDPHS) Micro Frame Number*/
#define AT91C_UDPHS_FRAME_NUMBER ((unsigned int) 0x7FF <<  3) /* (UDPHS) Frame Number as defined in the Packet Field Formats*/
#define AT91C_UDPHS_FNUM_ERR  ((unsigned int) 0x1 << 31) /* (UDPHS) Frame Number CRC Error*/
/* -------- UDPHS_IEN : (UDPHS Offset: 0x10) UDPHS Interrupt Enable Register -------- */
#define AT91C_UDPHS_DET_SUSPD ((unsigned int) 0x1 <<  1) /* (UDPHS) Suspend Interrupt Enable/Clear/Status*/
#define AT91C_UDPHS_MICRO_SOF ((unsigned int) 0x1 <<  2) /* (UDPHS) Micro-SOF Interrupt Enable/Clear/Status*/
#define AT91C_UDPHS_IEN_SOF   ((unsigned int) 0x1 <<  3) /* (UDPHS) SOF Interrupt Enable/Clear/Status*/
#define AT91C_UDPHS_ENDRESET  ((unsigned int) 0x1 <<  4) /* (UDPHS) End Of Reset Interrupt Enable/Clear/Status*/
#define AT91C_UDPHS_WAKE_UP   ((unsigned int) 0x1 <<  5) /* (UDPHS) Wake Up CPU Interrupt Enable/Clear/Status*/
#define AT91C_UDPHS_ENDOFRSM  ((unsigned int) 0x1 <<  6) /* (UDPHS) End Of Resume Interrupt Enable/Clear/Status*/
#define AT91C_UDPHS_UPSTR_RES ((unsigned int) 0x1 <<  7) /* (UDPHS) Upstream Resume Interrupt Enable/Clear/Status*/
#define AT91C_UDPHS_EPT_INT_0 ((unsigned int) 0x1 <<  8) /* (UDPHS) Endpoint 0 Interrupt Enable/Status*/
#define AT91C_UDPHS_EPT_INT_1 ((unsigned int) 0x1 <<  9) /* (UDPHS) Endpoint 1 Interrupt Enable/Status*/
#define AT91C_UDPHS_EPT_INT_2 ((unsigned int) 0x1 << 10) /* (UDPHS) Endpoint 2 Interrupt Enable/Status*/
#define AT91C_UDPHS_EPT_INT_3 ((unsigned int) 0x1 << 11) /* (UDPHS) Endpoint 3 Interrupt Enable/Status*/
#define AT91C_UDPHS_EPT_INT_4 ((unsigned int) 0x1 << 12) /* (UDPHS) Endpoint 4 Interrupt Enable/Status*/
#define AT91C_UDPHS_EPT_INT_5 ((unsigned int) 0x1 << 13) /* (UDPHS) Endpoint 5 Interrupt Enable/Status*/
#define AT91C_UDPHS_EPT_INT_6 ((unsigned int) 0x1 << 14) /* (UDPHS) Endpoint 6 Interrupt Enable/Status*/
#define AT91C_UDPHS_EPT_INT_7 ((unsigned int) 0x1 << 15) /* (UDPHS) Endpoint 7 Interrupt Enable/Status*/
#define AT91C_UDPHS_DMA_INT_1 ((unsigned int) 0x1 << 25) /* (UDPHS) DMA Channel 1 Interrupt Enable/Status*/
#define AT91C_UDPHS_DMA_INT_2 ((unsigned int) 0x1 << 26) /* (UDPHS) DMA Channel 2 Interrupt Enable/Status*/
#define AT91C_UDPHS_DMA_INT_3 ((unsigned int) 0x1 << 27) /* (UDPHS) DMA Channel 3 Interrupt Enable/Status*/
#define AT91C_UDPHS_DMA_INT_4 ((unsigned int) 0x1 << 28) /* (UDPHS) DMA Channel 4 Interrupt Enable/Status*/
#define AT91C_UDPHS_DMA_INT_5 ((unsigned int) 0x1 << 29) /* (UDPHS) DMA Channel 5 Interrupt Enable/Status*/
#define AT91C_UDPHS_DMA_INT_6 ((unsigned int) 0x1 << 30) /* (UDPHS) DMA Channel 6 Interrupt Enable/Status*/
/* -------- UDPHS_INTSTA : (UDPHS Offset: 0x14) UDPHS Interrupt Status Register -------- */
#define AT91C_UDPHS_SPEED     ((unsigned int) 0x1 <<  0) /* (UDPHS) Speed Status*/
/* -------- UDPHS_CLRINT : (UDPHS Offset: 0x18) UDPHS Clear Interrupt Register -------- */
/* -------- UDPHS_EPTRST : (UDPHS Offset: 0x1c) UDPHS Endpoints Reset Register -------- */
#define AT91C_UDPHS_RST_EPT_0 ((unsigned int) 0x1 <<  0) /* (UDPHS) Endpoint Reset 0*/
#define AT91C_UDPHS_RST_EPT_1 ((unsigned int) 0x1 <<  1) /* (UDPHS) Endpoint Reset 1*/
#define AT91C_UDPHS_RST_EPT_2 ((unsigned int) 0x1 <<  2) /* (UDPHS) Endpoint Reset 2*/
#define AT91C_UDPHS_RST_EPT_3 ((unsigned int) 0x1 <<  3) /* (UDPHS) Endpoint Reset 3*/
#define AT91C_UDPHS_RST_EPT_4 ((unsigned int) 0x1 <<  4) /* (UDPHS) Endpoint Reset 4*/
#define AT91C_UDPHS_RST_EPT_5 ((unsigned int) 0x1 <<  5) /* (UDPHS) Endpoint Reset 5*/
#define AT91C_UDPHS_RST_EPT_6 ((unsigned int) 0x1 <<  6) /* (UDPHS) Endpoint Reset 6*/
#define AT91C_UDPHS_RST_EPT_7 ((unsigned int) 0x1 <<  7) /* (UDPHS) Endpoint Reset 7*/
/* -------- UDPHS_TSTSOFCNT : (UDPHS Offset: 0xd0) UDPHS Test SOF Counter Register -------- */
#define AT91C_UDPHS_SOFCNTMAX ((unsigned int) 0x3 <<  0) /* (UDPHS) SOF Counter Max Value*/
#define AT91C_UDPHS_SOFCTLOAD ((unsigned int) 0x1 <<  7) /* (UDPHS) SOF Counter Load*/
/* -------- UDPHS_TSTCNTA : (UDPHS Offset: 0xd4) UDPHS Test A Counter Register -------- */
#define AT91C_UDPHS_CNTAMAX   ((unsigned int) 0x7FFF <<  0) /* (UDPHS) A Counter Max Value*/
#define AT91C_UDPHS_CNTALOAD  ((unsigned int) 0x1 << 15) /* (UDPHS) A Counter Load*/
/* -------- UDPHS_TSTCNTB : (UDPHS Offset: 0xd8) UDPHS Test B Counter Register -------- */
#define AT91C_UDPHS_CNTBMAX   ((unsigned int) 0x7FFF <<  0) /* (UDPHS) B Counter Max Value*/
#define AT91C_UDPHS_CNTBLOAD  ((unsigned int) 0x1 << 15) /* (UDPHS) B Counter Load*/
/* -------- UDPHS_TSTMODREG : (UDPHS Offset: 0xdc) UDPHS Test Mode Register -------- */
#define AT91C_UDPHS_TSTMODE   ((unsigned int) 0x1F <<  1) /* (UDPHS) UDPHS Core TestModeReg*/
/* -------- UDPHS_TST : (UDPHS Offset: 0xe0) UDPHS Test Register -------- */
#define AT91C_UDPHS_SPEED_CFG ((unsigned int) 0x3 <<  0) /* (UDPHS) Speed Configuration*/
#define 	AT91C_UDPHS_SPEED_CFG_NM                   ((unsigned int) 0x0) /* (UDPHS) Normal Mode*/
#define 	AT91C_UDPHS_SPEED_CFG_RS                   ((unsigned int) 0x1) /* (UDPHS) Reserved*/
#define 	AT91C_UDPHS_SPEED_CFG_HS                   ((unsigned int) 0x2) /* (UDPHS) Force High Speed*/
#define 	AT91C_UDPHS_SPEED_CFG_FS                   ((unsigned int) 0x3) /* (UDPHS) Force Full-Speed*/
#define AT91C_UDPHS_TST_J     ((unsigned int) 0x1 <<  2) /* (UDPHS) TestJMode*/
#define AT91C_UDPHS_TST_K     ((unsigned int) 0x1 <<  3) /* (UDPHS) TestKMode*/
#define AT91C_UDPHS_TST_PKT   ((unsigned int) 0x1 <<  4) /* (UDPHS) TestPacketMode*/
#define AT91C_UDPHS_OPMODE2   ((unsigned int) 0x1 <<  5) /* (UDPHS) OpMode2*/
/* -------- UDPHS_RIPPADDRSIZE : (UDPHS Offset: 0xec) UDPHS PADDRSIZE Register -------- */
#define AT91C_UDPHS_IPPADDRSIZE ((unsigned int) 0x0 <<  0) /* (UDPHS) 2^UDPHSDEV_PADDR_SIZE*/
/* -------- UDPHS_RIPNAME1 : (UDPHS Offset: 0xf0) UDPHS Name Register -------- */
#define AT91C_UDPHS_IPNAME1   ((unsigned int) 0x0 <<  0) /* (UDPHS) ASCII string HUSB*/
/* -------- UDPHS_RIPNAME2 : (UDPHS Offset: 0xf4) UDPHS Name Register -------- */
#define AT91C_UDPHS_IPNAME2   ((unsigned int) 0x0 <<  0) /* (UDPHS) ASCII string 2DEV*/
/* -------- UDPHS_IPFEATURES : (UDPHS Offset: 0xf8) UDPHS Features Register -------- */
#define AT91C_UDPHS_EPT_NBR_MAX ((unsigned int) 0xF <<  0) /* (UDPHS) Max Number of Endpoints*/
#define AT91C_UDPHS_DMA_CHANNEL_NBR ((unsigned int) 0x7 <<  4) /* (UDPHS) Number of DMA Channels*/
#define AT91C_UDPHS_DMA_B_SIZ ((unsigned int) 0x1 <<  7) /* (UDPHS) DMA Buffer Size*/
#define AT91C_UDPHS_DMA_FIFO_WORD_DEPTH ((unsigned int) 0xF <<  8) /* (UDPHS) DMA FIFO Depth in words*/
#define AT91C_UDPHS_FIFO_MAX_SIZE ((unsigned int) 0x7 << 12) /* (UDPHS) DPRAM size*/
#define AT91C_UDPHS_BW_DPRAM  ((unsigned int) 0x1 << 15) /* (UDPHS) DPRAM byte write capability*/
#define AT91C_UDPHS_DATAB16_8 ((unsigned int) 0x1 << 16) /* (UDPHS) UTMI DataBus16_8*/
#define AT91C_UDPHS_ISO_EPT_1 ((unsigned int) 0x1 << 17) /* (UDPHS) Endpoint 1 High Bandwidth Isochronous Capability*/
#define AT91C_UDPHS_ISO_EPT_2 ((unsigned int) 0x1 << 18) /* (UDPHS) Endpoint 2 High Bandwidth Isochronous Capability*/
#define AT91C_UDPHS_ISO_EPT_3 ((unsigned int) 0x1 << 19) /* (UDPHS) Endpoint 3 High Bandwidth Isochronous Capability*/
#define AT91C_UDPHS_ISO_EPT_4 ((unsigned int) 0x1 << 20) /* (UDPHS) Endpoint 4 High Bandwidth Isochronous Capability*/
/* -------- UDPHS_IPVERSION : (UDPHS Offset: 0xfc) UDPHS Version Register -------- */
#define AT91C_UDPHS_VERSION_NUM ((unsigned int) 0xFFFF <<  0) /* (UDPHS) Give the IP version*/
#define AT91C_UDPHS_METAL_FIX_NUM ((unsigned int) 0x7 << 16) /* (UDPHS) Give the number of metal fixes*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Timer Counter Channel Interface*/
/* ******************************************************************************/
typedef struct _AT91S_TC {
	AT91_REG	 TC_CCR; 	/* Channel Control Register*/
	AT91_REG	 TC_CMR; 	/* Channel Mode Register (Capture Mode / Waveform Mode)*/
	AT91_REG	 Reserved0[2]; 	/* */
	AT91_REG	 TC_CV; 	/* Counter Value*/
	AT91_REG	 TC_RA; 	/* Register A*/
	AT91_REG	 TC_RB; 	/* Register B*/
	AT91_REG	 TC_RC; 	/* Register C*/
	AT91_REG	 TC_SR; 	/* Status Register*/
	AT91_REG	 TC_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 TC_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 TC_IMR; 	/* Interrupt Mask Register*/
} AT91S_TC, *AT91PS_TC;

