una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91cap9.h
/* -------- TCB_BCR : (TCB Offset: 0xc0) TC Block Control Register -------- */
#define AT91C_TCB_SYNC        ((unsigned int) 0x1 <<  0) /* (TCB) Synchro Command*/
/* -------- TCB_BMR : (TCB Offset: 0xc4) TC Block Mode Register -------- */
#define AT91C_TCB_TC0XC0S     ((unsigned int) 0x3 <<  0) /* (TCB) External Clock Signal 0 Selection*/
#define 	AT91C_TCB_TC0XC0S_TCLK0                ((unsigned int) 0x0) /* (TCB) TCLK0 connected to XC0*/
#define 	AT91C_TCB_TC0XC0S_NONE                 ((unsigned int) 0x1) /* (TCB) None signal connected to XC0*/
#define 	AT91C_TCB_TC0XC0S_TIOA1                ((unsigned int) 0x2) /* (TCB) TIOA1 connected to XC0*/
#define 	AT91C_TCB_TC0XC0S_TIOA2                ((unsigned int) 0x3) /* (TCB) TIOA2 connected to XC0*/
#define AT91C_TCB_TC1XC1S     ((unsigned int) 0x3 <<  2) /* (TCB) External Clock Signal 1 Selection*/
#define 	AT91C_TCB_TC1XC1S_TCLK1                ((unsigned int) 0x0 <<  2) /* (TCB) TCLK1 connected to XC1*/
#define 	AT91C_TCB_TC1XC1S_NONE                 ((unsigned int) 0x1 <<  2) /* (TCB) None signal connected to XC1*/
#define 	AT91C_TCB_TC1XC1S_TIOA0                ((unsigned int) 0x2 <<  2) /* (TCB) TIOA0 connected to XC1*/
#define 	AT91C_TCB_TC1XC1S_TIOA2                ((unsigned int) 0x3 <<  2) /* (TCB) TIOA2 connected to XC1*/
#define AT91C_TCB_TC2XC2S     ((unsigned int) 0x3 <<  4) /* (TCB) External Clock Signal 2 Selection*/
#define 	AT91C_TCB_TC2XC2S_TCLK2                ((unsigned int) 0x0 <<  4) /* (TCB) TCLK2 connected to XC2*/
#define 	AT91C_TCB_TC2XC2S_NONE                 ((unsigned int) 0x1 <<  4) /* (TCB) None signal connected to XC2*/
#define 	AT91C_TCB_TC2XC2S_TIOA0                ((unsigned int) 0x2 <<  4) /* (TCB) TIOA0 connected to XC2*/
#define 	AT91C_TCB_TC2XC2S_TIOA1                ((unsigned int) 0x3 <<  4) /* (TCB) TIOA2 connected to XC2*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Multimedia Card Interface*/
/* ******************************************************************************/
typedef struct _AT91S_MCI {
	AT91_REG	 MCI_CR; 	/* MCI Control Register*/
	AT91_REG	 MCI_MR; 	/* MCI Mode Register*/
	AT91_REG	 MCI_DTOR; 	/* MCI Data Timeout Register*/
	AT91_REG	 MCI_SDCR; 	/* MCI SD/SDIO Card Register*/
	AT91_REG	 MCI_ARGR; 	/* MCI Argument Register*/
	AT91_REG	 MCI_CMDR; 	/* MCI Command Register*/
	AT91_REG	 MCI_BLKR; 	/* MCI Block Register*/
	AT91_REG	 MCI_CSTOR; 	/* MCI Completion Signal Timeout Register*/
	AT91_REG	 MCI_RSPR[4]; 	/* MCI Response Register*/
	AT91_REG	 MCI_RDR; 	/* MCI Receive Data Register*/
	AT91_REG	 MCI_TDR; 	/* MCI Transmit Data Register*/
	AT91_REG	 Reserved0[2]; 	/* */
	AT91_REG	 MCI_SR; 	/* MCI Status Register*/
	AT91_REG	 MCI_IER; 	/* MCI Interrupt Enable Register*/
	AT91_REG	 MCI_IDR; 	/* MCI Interrupt Disable Register*/
	AT91_REG	 MCI_IMR; 	/* MCI Interrupt Mask Register*/
	AT91_REG	 MCI_DMA; 	/* MCI DMA Configuration Register*/
	AT91_REG	 MCI_CFG; 	/* MCI Configuration Register*/
	AT91_REG	 Reserved1[35]; 	/* */
	AT91_REG	 MCI_WPCR; 	/* MCI Write Protection Control Register*/
	AT91_REG	 MCI_WPSR; 	/* MCI Write Protection Status Register*/
	AT91_REG	 Reserved2[4]; 	/* */
	AT91_REG	 MCI_VR; 	/* MCI Version Register*/
	AT91_REG	 MCI_RPR; 	/* Receive Pointer Register*/
	AT91_REG	 MCI_RCR; 	/* Receive Counter Register*/
	AT91_REG	 MCI_TPR; 	/* Transmit Pointer Register*/
	AT91_REG	 MCI_TCR; 	/* Transmit Counter Register*/
	AT91_REG	 MCI_RNPR; 	/* Receive Next Pointer Register*/
	AT91_REG	 MCI_RNCR; 	/* Receive Next Counter Register*/
	AT91_REG	 MCI_TNPR; 	/* Transmit Next Pointer Register*/
	AT91_REG	 MCI_TNCR; 	/* Transmit Next Counter Register*/
	AT91_REG	 MCI_PTCR; 	/* PDC Transfer Control Register*/
	AT91_REG	 MCI_PTSR; 	/* PDC Transfer Status Register*/
	AT91_REG	 Reserved3[54]; 	/* */
	AT91_REG	 MCI_FIFO; 	/* MCI FIFO Aperture Register*/
} AT91S_MCI, *AT91PS_MCI;

/* -------- MCI_CR : (MCI Offset: 0x0) MCI Control Register -------- */
#define AT91C_MCI_MCIEN       ((unsigned int) 0x1 <<  0) /* (MCI) Multimedia Interface Enable*/
#define 	AT91C_MCI_MCIEN_0                    ((unsigned int) 0x0) /* (MCI) No effect*/
#define 	AT91C_MCI_MCIEN_1                    ((unsigned int) 0x1) /* (MCI) Enable the MultiMedia Interface if MCIDIS is 0*/
#define AT91C_MCI_MCIDIS      ((unsigned int) 0x1 <<  1) /* (MCI) Multimedia Interface Disable*/
#define 	AT91C_MCI_MCIDIS_0                    ((unsigned int) 0x0 <<  1) /* (MCI) No effect*/
#define 	AT91C_MCI_MCIDIS_1                    ((unsigned int) 0x1 <<  1) /* (MCI) Disable the MultiMedia Interface*/
#define AT91C_MCI_PWSEN       ((unsigned int) 0x1 <<  2) /* (MCI) Power Save Mode Enable*/
#define 	AT91C_MCI_PWSEN_0                    ((unsigned int) 0x0 <<  2) /* (MCI) No effect*/
#define 	AT91C_MCI_PWSEN_1                    ((unsigned int) 0x1 <<  2) /* (MCI) Enable the Power-saving mode if PWSDIS is 0.*/
#define AT91C_MCI_PWSDIS      ((unsigned int) 0x1 <<  3) /* (MCI) Power Save Mode Disable*/
#define 	AT91C_MCI_PWSDIS_0                    ((unsigned int) 0x0 <<  3) /* (MCI) No effect*/
#define 	AT91C_MCI_PWSDIS_1                    ((unsigned int) 0x1 <<  3) /* (MCI) Disable the Power-saving mode.*/
#define AT91C_MCI_IOWAITEN    ((unsigned int) 0x1 <<  4) /* (MCI) SDIO Read Wait Enable*/
#define 	AT91C_MCI_IOWAITEN_0                    ((unsigned int) 0x0 <<  4) /* (MCI) No effect*/
#define 	AT91C_MCI_IOWAITEN_1                    ((unsigned int) 0x1 <<  4) /* (MCI) Enables the SDIO Read Wait Operation.*/
#define AT91C_MCI_IOWAITDIS   ((unsigned int) 0x1 <<  5) /* (MCI) SDIO Read Wait Disable*/
#define 	AT91C_MCI_IOWAITDIS_0                    ((unsigned int) 0x0 <<  5) /* (MCI) No effect*/
#define 	AT91C_MCI_IOWAITDIS_1                    ((unsigned int) 0x1 <<  5) /* (MCI) Disables the SDIO Read Wait Operation.*/
#define AT91C_MCI_SWRST       ((unsigned int) 0x1 <<  7) /* (MCI) MCI Software reset*/
#define 	AT91C_MCI_SWRST_0                    ((unsigned int) 0x0 <<  7) /* (MCI) No effect*/
#define 	AT91C_MCI_SWRST_1                    ((unsigned int) 0x1 <<  7) /* (MCI) Resets the MCI*/
/* -------- MCI_MR : (MCI Offset: 0x4) MCI Mode Register -------- */
#define AT91C_MCI_CLKDIV      ((unsigned int) 0xFF <<  0) /* (MCI) Clock Divider*/
#define AT91C_MCI_PWSDIV      ((unsigned int) 0x7 <<  8) /* (MCI) Power Saving Divider*/
#define AT91C_MCI_RDPROOF     ((unsigned int) 0x1 << 11) /* (MCI) Read Proof Enable*/
#define 	AT91C_MCI_RDPROOF_DISABLE              ((unsigned int) 0x0 << 11) /* (MCI) Disables Read Proof*/
#define 	AT91C_MCI_RDPROOF_ENABLE               ((unsigned int) 0x1 << 11) /* (MCI) Enables Read Proof*/
#define AT91C_MCI_WRPROOF     ((unsigned int) 0x1 << 12) /* (MCI) Write Proof Enable*/
#define 	AT91C_MCI_WRPROOF_DISABLE              ((unsigned int) 0x0 << 12) /* (MCI) Disables Write Proof*/
#define 	AT91C_MCI_WRPROOF_ENABLE               ((unsigned int) 0x1 << 12) /* (MCI) Enables Write Proof*/
#define AT91C_MCI_PDCFBYTE    ((unsigned int) 0x1 << 13) /* (MCI) PDC Force Byte Transfer*/
#define 	AT91C_MCI_PDCFBYTE_DISABLE              ((unsigned int) 0x0 << 13) /* (MCI) Disables PDC Force Byte Transfer*/
#define 	AT91C_MCI_PDCFBYTE_ENABLE               ((unsigned int) 0x1 << 13) /* (MCI) Enables PDC Force Byte Transfer*/
#define AT91C_MCI_PDCPADV     ((unsigned int) 0x1 << 14) /* (MCI) PDC Padding Value*/
#define AT91C_MCI_PDCMODE     ((unsigned int) 0x1 << 15) /* (MCI) PDC Oriented Mode*/
#define 	AT91C_MCI_PDCMODE_DISABLE              ((unsigned int) 0x0 << 15) /* (MCI) Disables PDC Transfer*/
#define 	AT91C_MCI_PDCMODE_ENABLE               ((unsigned int) 0x1 << 15) /* (MCI) Enables PDC Transfer*/
#define AT91C_MCI_BLKLEN      ((unsigned int) 0xFFFF << 16) /* (MCI) Data Block Length*/
/* -------- MCI_DTOR : (MCI Offset: 0x8) MCI Data Timeout Register -------- */
#define AT91C_MCI_DTOCYC      ((unsigned int) 0xF <<  0) /* (MCI) Data Timeout Cycle Number*/
#define AT91C_MCI_DTOMUL      ((unsigned int) 0x7 <<  4) /* (MCI) Data Timeout Multiplier*/
#define 	AT91C_MCI_DTOMUL_1                    ((unsigned int) 0x0 <<  4) /* (MCI) DTOCYC x 1*/
#define 	AT91C_MCI_DTOMUL_16                   ((unsigned int) 0x1 <<  4) /* (MCI) DTOCYC x 16*/
#define 	AT91C_MCI_DTOMUL_128                  ((unsigned int) 0x2 <<  4) /* (MCI) DTOCYC x 128*/
#define 	AT91C_MCI_DTOMUL_256                  ((unsigned int) 0x3 <<  4) /* (MCI) DTOCYC x 256*/
#define 	AT91C_MCI_DTOMUL_1024                 ((unsigned int) 0x4 <<  4) /* (MCI) DTOCYC x 1024*/
#define 	AT91C_MCI_DTOMUL_4096                 ((unsigned int) 0x5 <<  4) /* (MCI) DTOCYC x 4096*/
#define 	AT91C_MCI_DTOMUL_65536                ((unsigned int) 0x6 <<  4) /* (MCI) DTOCYC x 65536*/
#define 	AT91C_MCI_DTOMUL_1048576              ((unsigned int) 0x7 <<  4) /* (MCI) DTOCYC x 1048576*/
/* -------- MCI_SDCR : (MCI Offset: 0xc) MCI SD Card Register -------- */
#define AT91C_MCI_SCDSEL      ((unsigned int) 0x3 <<  0) /* (MCI) SD Card/SDIO Selector*/
#define 	AT91C_MCI_SCDSEL_SLOTA                ((unsigned int) 0x0) /* (MCI) Slot A selected*/
#define 	AT91C_MCI_SCDSEL_SLOTB                ((unsigned int) 0x1) /* (MCI) Slot B selected*/
#define 	AT91C_MCI_SCDSEL_SLOTC                ((unsigned int) 0x2) /* (MCI) Slot C selected*/
#define 	AT91C_MCI_SCDSEL_SLOTD                ((unsigned int) 0x3) /* (MCI) Slot D selected*/
#define AT91C_MCI_SCDBUS      ((unsigned int) 0x1 <<  6) /* (MCI) SDCard/SDIO Bus Width*/
#define 	AT91C_MCI_SCDBUS_1BIT                 ((unsigned int) 0x0 <<  6) /* (MCI) 1-bit data bus*/
#define 	AT91C_MCI_SCDBUS_4BITS                ((unsigned int) 0x2 <<  6) /* (MCI) 4-bits data bus*/
#define 	AT91C_MCI_SCDBUS_8BITS                ((unsigned int) 0x3 <<  6) /* (MCI) 8-bits data bus*/
/* -------- MCI_CMDR : (MCI Offset: 0x14) MCI Command Register -------- */
#define AT91C_MCI_CMDNB       ((unsigned int) 0x3F <<  0) /* (MCI) Command Number*/
#define AT91C_MCI_RSPTYP      ((unsigned int) 0x3 <<  6) /* (MCI) Response Type*/
#define 	AT91C_MCI_RSPTYP_NO                   ((unsigned int) 0x0 <<  6) /* (MCI) No response*/
#define 	AT91C_MCI_RSPTYP_48                   ((unsigned int) 0x1 <<  6) /* (MCI) 48-bit response*/
#define 	AT91C_MCI_RSPTYP_136                  ((unsigned int) 0x2 <<  6) /* (MCI) 136-bit response*/
#define 	AT91C_MCI_RSPTYP_R1B                  ((unsigned int) 0x3 <<  6) /* (MCI) R1b response*/
#define AT91C_MCI_SPCMD       ((unsigned int) 0x7 <<  8) /* (MCI) Special CMD*/
#define 	AT91C_MCI_SPCMD_NONE                 ((unsigned int) 0x0 <<  8) /* (MCI) Not a special CMD*/
#define 	AT91C_MCI_SPCMD_INIT                 ((unsigned int) 0x1 <<  8) /* (MCI) Initialization CMD*/
#define 	AT91C_MCI_SPCMD_SYNC                 ((unsigned int) 0x2 <<  8) /* (MCI) Synchronized CMD*/
#define 	AT91C_MCI_SPCMD_CE_ATA               ((unsigned int) 0x3 <<  8) /* (MCI) CE-ATA Completion Signal disable CMD*/
#define 	AT91C_MCI_SPCMD_IT_CMD               ((unsigned int) 0x4 <<  8) /* (MCI) Interrupt command*/
#define 	AT91C_MCI_SPCMD_IT_REP               ((unsigned int) 0x5 <<  8) /* (MCI) Interrupt response*/
#define AT91C_MCI_OPDCMD      ((unsigned int) 0x1 << 11) /* (MCI) Open Drain Command*/
#define 	AT91C_MCI_OPDCMD_PUSHPULL             ((unsigned int) 0x0 << 11) /* (MCI) Push/pull command*/
#define 	AT91C_MCI_OPDCMD_OPENDRAIN            ((unsigned int) 0x1 << 11) /* (MCI) Open drain command*/
#define AT91C_MCI_MAXLAT      ((unsigned int) 0x1 << 12) /* (MCI) Maximum Latency for Command to respond*/
#define 	AT91C_MCI_MAXLAT_5                    ((unsigned int) 0x0 << 12) /* (MCI) 5 cycles maximum latency*/
#define 	AT91C_MCI_MAXLAT_64                   ((unsigned int) 0x1 << 12) /* (MCI) 64 cycles maximum latency*/
#define AT91C_MCI_TRCMD       ((unsigned int) 0x3 << 16) /* (MCI) Transfer CMD*/
#define 	AT91C_MCI_TRCMD_NO                   ((unsigned int) 0x0 << 16) /* (MCI) No transfer*/
#define 	AT91C_MCI_TRCMD_START                ((unsigned int) 0x1 << 16) /* (MCI) Start transfer*/
#define 	AT91C_MCI_TRCMD_STOP                 ((unsigned int) 0x2 << 16) /* (MCI) Stop transfer*/
#define AT91C_MCI_TRDIR       ((unsigned int) 0x1 << 18) /* (MCI) Transfer Direction*/
#define 	AT91C_MCI_TRDIR_WRITE                ((unsigned int) 0x0 << 18) /* (MCI) Write*/
#define 	AT91C_MCI_TRDIR_READ                 ((unsigned int) 0x1 << 18) /* (MCI) Read*/
#define AT91C_MCI_TRTYP       ((unsigned int) 0x7 << 19) /* (MCI) Transfer Type*/
#define 	AT91C_MCI_TRTYP_BLOCK                ((unsigned int) 0x0 << 19) /* (MCI) MMC/SDCard Single Block Transfer type*/
#define 	AT91C_MCI_TRTYP_MULTIPLE             ((unsigned int) 0x1 << 19) /* (MCI) MMC/SDCard Multiple Block transfer type*/
#define 	AT91C_MCI_TRTYP_STREAM               ((unsigned int) 0x2 << 19) /* (MCI) MMC Stream transfer type*/
#define 	AT91C_MCI_TRTYP_SDIO_BYTE            ((unsigned int) 0x4 << 19) /* (MCI) SDIO Byte transfer type*/
#define 	AT91C_MCI_TRTYP_SDIO_BLOCK           ((unsigned int) 0x5 << 19) /* (MCI) SDIO Block transfer type*/
#define AT91C_MCI_IOSPCMD     ((unsigned int) 0x3 << 24) /* (MCI) SDIO Special Command*/
#define 	AT91C_MCI_IOSPCMD_NONE                 ((unsigned int) 0x0 << 24) /* (MCI) NOT a special command*/
#define 	AT91C_MCI_IOSPCMD_SUSPEND              ((unsigned int) 0x1 << 24) /* (MCI) SDIO Suspend Command*/
#define 	AT91C_MCI_IOSPCMD_RESUME               ((unsigned int) 0x2 << 24) /* (MCI) SDIO Resume Command*/
#define AT91C_MCI_ATACS       ((unsigned int) 0x1 << 26) /* (MCI) ATA with command completion signal*/
#define 	AT91C_MCI_ATACS_NORMAL               ((unsigned int) 0x0 << 26) /* (MCI) normal operation mode*/
#define 	AT91C_MCI_ATACS_COMPLETION           ((unsigned int) 0x1 << 26) /* (MCI) completion signal is expected within MCI_CSTOR*/
/* -------- MCI_BLKR : (MCI Offset: 0x18) MCI Block Register -------- */
#define AT91C_MCI_BCNT        ((unsigned int) 0xFFFF <<  0) /* (MCI) MMC/SDIO Block Count / SDIO Byte Count*/
/* -------- MCI_CSTOR : (MCI Offset: 0x1c) MCI Completion Signal Timeout Register -------- */
#define AT91C_MCI_CSTOCYC     ((unsigned int) 0xF <<  0) /* (MCI) Completion Signal Timeout Cycle Number*/
#define AT91C_MCI_CSTOMUL     ((unsigned int) 0x7 <<  4) /* (MCI) Completion Signal Timeout Multiplier*/
#define 	AT91C_MCI_CSTOMUL_1                    ((unsigned int) 0x0 <<  4) /* (MCI) CSTOCYC x 1*/
#define 	AT91C_MCI_CSTOMUL_16                   ((unsigned int) 0x1 <<  4) /* (MCI) CSTOCYC x  16*/
#define 	AT91C_MCI_CSTOMUL_128                  ((unsigned int) 0x2 <<  4) /* (MCI) CSTOCYC x  128*/
#define 	AT91C_MCI_CSTOMUL_256                  ((unsigned int) 0x3 <<  4) /* (MCI) CSTOCYC x  256*/
#define 	AT91C_MCI_CSTOMUL_1024                 ((unsigned int) 0x4 <<  4) /* (MCI) CSTOCYC x  1024*/
#define 	AT91C_MCI_CSTOMUL_4096                 ((unsigned int) 0x5 <<  4) /* (MCI) CSTOCYC x  4096*/
#define 	AT91C_MCI_CSTOMUL_65536                ((unsigned int) 0x6 <<  4) /* (MCI) CSTOCYC x  65536*/
#define 	AT91C_MCI_CSTOMUL_1048576              ((unsigned int) 0x7 <<  4) /* (MCI) CSTOCYC x  1048576*/
/* -------- MCI_SR : (MCI Offset: 0x40) MCI Status Register -------- */
#define AT91C_MCI_CMDRDY      ((unsigned int) 0x1 <<  0) /* (MCI) Command Ready flag*/
#define AT91C_MCI_RXRDY       ((unsigned int) 0x1 <<  1) /* (MCI) RX Ready flag*/
#define AT91C_MCI_TXRDY       ((unsigned int) 0x1 <<  2) /* (MCI) TX Ready flag*/
#define AT91C_MCI_BLKE        ((unsigned int) 0x1 <<  3) /* (MCI) Data Block Transfer Ended flag*/
#define AT91C_MCI_DTIP        ((unsigned int) 0x1 <<  4) /* (MCI) Data Transfer in Progress flag*/
#define AT91C_MCI_NOTBUSY     ((unsigned int) 0x1 <<  5) /* (MCI) Data Line Not Busy flag*/
#define AT91C_MCI_ENDRX       ((unsigned int) 0x1 <<  6) /* (MCI) End of RX Buffer flag*/
#define AT91C_MCI_ENDTX       ((unsigned int) 0x1 <<  7) /* (MCI) End of TX Buffer flag*/
#define AT91C_MCI_SDIOIRQA    ((unsigned int) 0x1 <<  8) /* (MCI) SDIO Interrupt for Slot A*/
#define AT91C_MCI_SDIOIRQB    ((unsigned int) 0x1 <<  9) /* (MCI) SDIO Interrupt for Slot B*/
#define AT91C_MCI_SDIOIRQC    ((unsigned int) 0x1 << 10) /* (MCI) SDIO Interrupt for Slot C*/
#define AT91C_MCI_SDIOIRQD    ((unsigned int) 0x1 << 11) /* (MCI) SDIO Interrupt for Slot D*/
#define AT91C_MCI_SDIOWAIT    ((unsigned int) 0x1 << 12) /* (MCI) SDIO Read Wait operation flag*/
#define AT91C_MCI_CSRCV       ((unsigned int) 0x1 << 13) /* (MCI) CE-ATA Completion Signal flag*/
#define AT91C_MCI_RXBUFF      ((unsigned int) 0x1 << 14) /* (MCI) RX Buffer Full flag*/
#define AT91C_MCI_TXBUFE      ((unsigned int) 0x1 << 15) /* (MCI) TX Buffer Empty flag*/
#define AT91C_MCI_RINDE       ((unsigned int) 0x1 << 16) /* (MCI) Response Index Error flag*/
#define AT91C_MCI_RDIRE       ((unsigned int) 0x1 << 17) /* (MCI) Response Direction Error flag*/
#define AT91C_MCI_RCRCE       ((unsigned int) 0x1 << 18) /* (MCI) Response CRC Error flag*/
#define AT91C_MCI_RENDE       ((unsigned int) 0x1 << 19) /* (MCI) Response End Bit Error flag*/
#define AT91C_MCI_RTOE        ((unsigned int) 0x1 << 20) /* (MCI) Response Time-out Error flag*/
#define AT91C_MCI_DCRCE       ((unsigned int) 0x1 << 21) /* (MCI) data CRC Error flag*/
#define AT91C_MCI_DTOE        ((unsigned int) 0x1 << 22) /* (MCI) Data timeout Error flag*/
#define AT91C_MCI_CSTOE       ((unsigned int) 0x1 << 23) /* (MCI) Completion Signal timeout Error flag*/
#define AT91C_MCI_BLKOVRE     ((unsigned int) 0x1 << 24) /* (MCI) DMA Block Overrun Error flag*/
#define AT91C_MCI_DMADONE     ((unsigned int) 0x1 << 25) /* (MCI) DMA Transfer Done flag*/
#define AT91C_MCI_FIFOEMPTY   ((unsigned int) 0x1 << 26) /* (MCI) FIFO Empty flag*/
#define AT91C_MCI_XFRDONE     ((unsigned int) 0x1 << 27) /* (MCI) Transfer Done flag*/
#define AT91C_MCI_OVRE        ((unsigned int) 0x1 << 30) /* (MCI) Overrun flag*/
#define AT91C_MCI_UNRE        ((unsigned int) 0x1 << 31) /* (MCI) Underrun flag*/
/* -------- MCI_IER : (MCI Offset: 0x44) MCI Interrupt Enable Register -------- */
/* -------- MCI_IDR : (MCI Offset: 0x48) MCI Interrupt Disable Register -------- */
/* -------- MCI_IMR : (MCI Offset: 0x4c) MCI Interrupt Mask Register -------- */
/* -------- MCI_DMA : (MCI Offset: 0x50) MCI DMA Configuration Register -------- */
#define AT91C_MCI_OFFSET      ((unsigned int) 0x3 <<  0) /* (MCI) DMA Write Buffer Offset*/
#define AT91C_MCI_CHKSIZE     ((unsigned int) 0x7 <<  4) /* (MCI) DMA Channel Read/Write Chunk Size*/
#define 	AT91C_MCI_CHKSIZE_1                    ((unsigned int) 0x0 <<  4) /* (MCI) Number of data transferred is 1*/
#define 	AT91C_MCI_CHKSIZE_4                    ((unsigned int) 0x1 <<  4) /* (MCI) Number of data transferred is 4*/
#define 	AT91C_MCI_CHKSIZE_8                    ((unsigned int) 0x2 <<  4) /* (MCI) Number of data transferred is 8*/
#define 	AT91C_MCI_CHKSIZE_16                   ((unsigned int) 0x3 <<  4) /* (MCI) Number of data transferred is 16*/
#define 	AT91C_MCI_CHKSIZE_32                   ((unsigned int) 0x4 <<  4) /* (MCI) Number of data transferred is 32*/
#define AT91C_MCI_DMAEN       ((unsigned int) 0x1 <<  8) /* (MCI) DMA Hardware Handshaking Enable*/
#define 	AT91C_MCI_DMAEN_DISABLE              ((unsigned int) 0x0 <<  8) /* (MCI) DMA interface is disabled*/
#define 	AT91C_MCI_DMAEN_ENABLE               ((unsigned int) 0x1 <<  8) /* (MCI) DMA interface is enabled*/
/* -------- MCI_CFG : (MCI Offset: 0x54) MCI Configuration Register -------- */
#define AT91C_MCI_FIFOMODE    ((unsigned int) 0x1 <<  0) /* (MCI) MCI Internal FIFO Control Mode*/
#define 	AT91C_MCI_FIFOMODE_AMOUNTDATA           ((unsigned int) 0x0) /* (MCI) A write transfer starts when a sufficient amount of datas is written into the FIFO*/
#define 	AT91C_MCI_FIFOMODE_ONEDATA              ((unsigned int) 0x1) /* (MCI) A write transfer starts as soon as one data is written into the FIFO*/
#define AT91C_MCI_FERRCTRL    ((unsigned int) 0x1 <<  4) /* (MCI) Flow Error Flag Reset Control Mode*/
#define 	AT91C_MCI_FERRCTRL_RWCMD                ((unsigned int) 0x0 <<  4) /* (MCI) When an underflow/overflow condition flag is set, a new Write/Read command is needed to reset the flag*/
#define 	AT91C_MCI_FERRCTRL_READSR               ((unsigned int) 0x1 <<  4) /* (MCI) When an underflow/overflow condition flag is set, a read status resets the flag*/
#define AT91C_MCI_HSMODE      ((unsigned int) 0x1 <<  8) /* (MCI) High Speed Mode*/
#define 	AT91C_MCI_HSMODE_DISABLE              ((unsigned int) 0x0 <<  8) /* (MCI) Default Bus Timing Mode*/
#define 	AT91C_MCI_HSMODE_ENABLE               ((unsigned int) 0x1 <<  8) /* (MCI) High Speed Mode*/
#define AT91C_MCI_LSYNC       ((unsigned int) 0x1 << 12) /* (MCI) Synchronize on last block*/
#define 	AT91C_MCI_LSYNC_CURRENT              ((unsigned int) 0x0 << 12) /* (MCI) Pending command sent at end of current data block*/
#define 	AT91C_MCI_LSYNC_INFINITE             ((unsigned int) 0x1 << 12) /* (MCI) Pending command sent at end of block transfer when transfer length is not infinite*/
/* -------- MCI_WPCR : (MCI Offset: 0xe4) Write Protection Control Register -------- */
#define AT91C_MCI_WP_EN       ((unsigned int) 0x1 <<  0) /* (MCI) Write Protection Enable*/
#define 	AT91C_MCI_WP_EN_DISABLE              ((unsigned int) 0x0) /* (MCI) Write Operation is disabled (if WP_KEY corresponds)*/
#define 	AT91C_MCI_WP_EN_ENABLE               ((unsigned int) 0x1) /* (MCI) Write Operation is enabled (if WP_KEY corresponds)*/
#define AT91C_MCI_WP_KEY      ((unsigned int) 0xFFFFFF <<  8) /* (MCI) Write Protection Key*/
/* -------- MCI_WPSR : (MCI Offset: 0xe8) Write Protection Status Register -------- */
#define AT91C_MCI_WP_VS       ((unsigned int) 0xF <<  0) /* (MCI) Write Protection Violation Status*/
#define 	AT91C_MCI_WP_VS_NO_VIOLATION         ((unsigned int) 0x0) /* (MCI) No Write Protection Violation detected since last read*/
#define 	AT91C_MCI_WP_VS_ON_WRITE             ((unsigned int) 0x1) /* (MCI) Write Protection Violation detected since last read*/
#define 	AT91C_MCI_WP_VS_ON_RESET             ((unsigned int) 0x2) /* (MCI) Software Reset Violation detected since last read*/
#define 	AT91C_MCI_WP_VS_ON_BOTH              ((unsigned int) 0x3) /* (MCI) Write Protection and Software Reset Violation detected since last read*/
#define AT91C_MCI_WP_VSRC     ((unsigned int) 0xF <<  8) /* (MCI) Write Protection Violation Source*/
#define 	AT91C_MCI_WP_VSRC_NO_VIOLATION         ((unsigned int) 0x0 <<  8) /* (MCI) No Write Protection Violation detected since last read*/
#define 	AT91C_MCI_WP_VSRC_MCI_MR               ((unsigned int) 0x1 <<  8) /* (MCI) Write Protection Violation detected on MCI_MR since last read*/
#define 	AT91C_MCI_WP_VSRC_MCI_DTOR             ((unsigned int) 0x2 <<  8) /* (MCI) Write Protection Violation detected on MCI_DTOR since last read*/
#define 	AT91C_MCI_WP_VSRC_MCI_SDCR             ((unsigned int) 0x3 <<  8) /* (MCI) Write Protection Violation detected on MCI_SDCR since last read*/
#define 	AT91C_MCI_WP_VSRC_MCI_CSTOR            ((unsigned int) 0x4 <<  8) /* (MCI) Write Protection Violation detected on MCI_CSTOR since last read*/
#define 	AT91C_MCI_WP_VSRC_MCI_DMA              ((unsigned int) 0x5 <<  8) /* (MCI) Write Protection Violation detected on MCI_DMA since last read*/
#define 	AT91C_MCI_WP_VSRC_MCI_CFG              ((unsigned int) 0x6 <<  8) /* (MCI) Write Protection Violation detected on MCI_CFG since last read*/
#define 	AT91C_MCI_WP_VSRC_MCI_DEL              ((unsigned int) 0x7 <<  8) /* (MCI) Write Protection Violation detected on MCI_DEL since last read*/

