una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91cap9.h
/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR AC97 Controller Interface*/
/* ******************************************************************************/
typedef struct _AT91S_AC97C {
	AT91_REG	 Reserved0[2]; 	/* */
	AT91_REG	 AC97C_MR; 	/* Mode Register*/
	AT91_REG	 Reserved1[1]; 	/* */
	AT91_REG	 AC97C_ICA; 	/* Input Channel AssignementRegister*/
	AT91_REG	 AC97C_OCA; 	/* Output Channel Assignement Register*/
	AT91_REG	 Reserved2[2]; 	/* */
	AT91_REG	 AC97C_CARHR; 	/* Channel A Receive Holding Register*/
	AT91_REG	 AC97C_CATHR; 	/* Channel A Transmit Holding Register*/
	AT91_REG	 AC97C_CASR; 	/* Channel A Status Register*/
	AT91_REG	 AC97C_CAMR; 	/* Channel A Mode Register*/
	AT91_REG	 AC97C_CBRHR; 	/* Channel B Receive Holding Register (optional)*/
	AT91_REG	 AC97C_CBTHR; 	/* Channel B Transmit Holding Register (optional)*/
	AT91_REG	 AC97C_CBSR; 	/* Channel B Status Register*/
	AT91_REG	 AC97C_CBMR; 	/* Channel B Mode Register*/
	AT91_REG	 AC97C_CORHR; 	/* COdec Transmit Holding Register*/
	AT91_REG	 AC97C_COTHR; 	/* COdec Transmit Holding Register*/
	AT91_REG	 AC97C_COSR; 	/* CODEC Status Register*/
	AT91_REG	 AC97C_COMR; 	/* CODEC Mask Status Register*/
	AT91_REG	 AC97C_SR; 	/* Status Register*/
	AT91_REG	 AC97C_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 AC97C_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 AC97C_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 Reserved3[39]; 	/* */
	AT91_REG	 AC97C_VERSION; 	/* Version Register*/
	AT91_REG	 AC97C_RPR; 	/* Receive Pointer Register*/
	AT91_REG	 AC97C_RCR; 	/* Receive Counter Register*/
	AT91_REG	 AC97C_TPR; 	/* Transmit Pointer Register*/
	AT91_REG	 AC97C_TCR; 	/* Transmit Counter Register*/
	AT91_REG	 AC97C_RNPR; 	/* Receive Next Pointer Register*/
	AT91_REG	 AC97C_RNCR; 	/* Receive Next Counter Register*/
	AT91_REG	 AC97C_TNPR; 	/* Transmit Next Pointer Register*/
	AT91_REG	 AC97C_TNCR; 	/* Transmit Next Counter Register*/
	AT91_REG	 AC97C_PTCR; 	/* PDC Transfer Control Register*/
	AT91_REG	 AC97C_PTSR; 	/* PDC Transfer Status Register*/
} AT91S_AC97C, *AT91PS_AC97C;

/* -------- AC97C_MR : (AC97C Offset: 0x8) AC97C Mode Register -------- */
#define AT91C_AC97C_ENA       ((unsigned int) 0x1 <<  0) /* (AC97C) AC97 Controller Global Enable*/
#define AT91C_AC97C_WRST      ((unsigned int) 0x1 <<  1) /* (AC97C) Warm Reset*/
#define AT91C_AC97C_VRA       ((unsigned int) 0x1 <<  2) /* (AC97C) Variable RAte (for Data Slots)*/
/* -------- AC97C_ICA : (AC97C Offset: 0x10) AC97C Input Channel Assignement Register -------- */
#define AT91C_AC97C_CHID3     ((unsigned int) 0x7 <<  0) /* (AC97C) Channel Id for the input slot 3*/
#define 	AT91C_AC97C_CHID3_NONE                 ((unsigned int) 0x0) /* (AC97C) No data will be transmitted during this slot*/
#define 	AT91C_AC97C_CHID3_CA                   ((unsigned int) 0x1) /* (AC97C) Channel A data will be transmitted during this slot*/
#define 	AT91C_AC97C_CHID3_CB                   ((unsigned int) 0x2) /* (AC97C) Channel B data will be transmitted during this slot*/
#define 	AT91C_AC97C_CHID3_CC                   ((unsigned int) 0x3) /* (AC97C) Channel C data will be transmitted during this slot*/
#define AT91C_AC97C_CHID4     ((unsigned int) 0x7 <<  3) /* (AC97C) Channel Id for the input slot 4*/
#define 	AT91C_AC97C_CHID4_NONE                 ((unsigned int) 0x0 <<  3) /* (AC97C) No data will be transmitted during this slot*/
#define 	AT91C_AC97C_CHID4_CA                   ((unsigned int) 0x1 <<  3) /* (AC97C) Channel A data will be transmitted during this slot*/
#define 	AT91C_AC97C_CHID4_CB                   ((unsigned int) 0x2 <<  3) /* (AC97C) Channel B data will be transmitted during this slot*/
#define 	AT91C_AC97C_CHID4_CC                   ((unsigned int) 0x3 <<  3) /* (AC97C) Channel C data will be transmitted during this slot*/
#define AT91C_AC97C_CHID5     ((unsigned int) 0x7 <<  6) /* (AC97C) Channel Id for the input slot 5*/
#define 	AT91C_AC97C_CHID5_NONE                 ((unsigned int) 0x0 <<  6) /* (AC97C) No data will be transmitted during this slot*/
#define 	AT91C_AC97C_CHID5_CA                   ((unsigned int) 0x1 <<  6) /* (AC97C) Channel A data will be transmitted during this slot*/
#define 	AT91C_AC97C_CHID5_CB                   ((unsigned int) 0x2 <<  6) /* (AC97C) Channel B data will be transmitted during this slot*/
#define 	AT91C_AC97C_CHID5_CC                   ((unsigned int) 0x3 <<  6) /* (AC97C) Channel C data will be transmitted during this slot*/
#define AT91C_AC97C_CHID6     ((unsigned int) 0x7 <<  9) /* (AC97C) Channel Id for the input slot 6*/
#define 	AT91C_AC97C_CHID6_NONE                 ((unsigned int) 0x0 <<  9) /* (AC97C) No data will be transmitted during this slot*/
#define 	AT91C_AC97C_CHID6_CA                   ((unsigned int) 0x1 <<  9) /* (AC97C) Channel A data will be transmitted during this slot*/
#define 	AT91C_AC97C_CHID6_CB                   ((unsigned int) 0x2 <<  9) /* (AC97C) Channel B data will be transmitted during this slot*/
#define 	AT91C_AC97C_CHID6_CC                   ((unsigned int) 0x3 <<  9) /* (AC97C) Channel C data will be transmitted during this slot*/
#define AT91C_AC97C_CHID7     ((unsigned int) 0x7 << 12) /* (AC97C) Channel Id for the input slot 7*/
#define 	AT91C_AC97C_CHID7_NONE                 ((unsigned int) 0x0 << 12) /* (AC97C) No data will be transmitted during this slot*/
#define 	AT91C_AC97C_CHID7_CA                   ((unsigned int) 0x1 << 12) /* (AC97C) Channel A data will be transmitted during this slot*/
#define 	AT91C_AC97C_CHID7_CB                   ((unsigned int) 0x2 << 12) /* (AC97C) Channel B data will be transmitted during this slot*/
#define 	AT91C_AC97C_CHID7_CC                   ((unsigned int) 0x3 << 12) /* (AC97C) Channel C data will be transmitted during this slot*/
#define AT91C_AC97C_CHID8     ((unsigned int) 0x7 << 15) /* (AC97C) Channel Id for the input slot 8*/
#define 	AT91C_AC97C_CHID8_NONE                 ((unsigned int) 0x0 << 15) /* (AC97C) No data will be transmitted during this slot*/
#define 	AT91C_AC97C_CHID8_CA                   ((unsigned int) 0x1 << 15) /* (AC97C) Channel A data will be transmitted during this slot*/
#define 	AT91C_AC97C_CHID8_CB                   ((unsigned int) 0x2 << 15) /* (AC97C) Channel B data will be transmitted during this slot*/
#define 	AT91C_AC97C_CHID8_CC                   ((unsigned int) 0x3 << 15) /* (AC97C) Channel C data will be transmitted during this slot*/
#define AT91C_AC97C_CHID9     ((unsigned int) 0x7 << 18) /* (AC97C) Channel Id for the input slot 9*/
#define 	AT91C_AC97C_CHID9_NONE                 ((unsigned int) 0x0 << 18) /* (AC97C) No data will be transmitted during this slot*/
#define 	AT91C_AC97C_CHID9_CA                   ((unsigned int) 0x1 << 18) /* (AC97C) Channel A data will be transmitted during this slot*/
#define 	AT91C_AC97C_CHID9_CB                   ((unsigned int) 0x2 << 18) /* (AC97C) Channel B data will be transmitted during this slot*/
#define 	AT91C_AC97C_CHID9_CC                   ((unsigned int) 0x3 << 18) /* (AC97C) Channel C data will be transmitted during this slot*/
#define AT91C_AC97C_CHID10    ((unsigned int) 0x7 << 21) /* (AC97C) Channel Id for the input slot 10*/
#define 	AT91C_AC97C_CHID10_NONE                 ((unsigned int) 0x0 << 21) /* (AC97C) No data will be transmitted during this slot*/
#define 	AT91C_AC97C_CHID10_CA                   ((unsigned int) 0x1 << 21) /* (AC97C) Channel A data will be transmitted during this slot*/
#define 	AT91C_AC97C_CHID10_CB                   ((unsigned int) 0x2 << 21) /* (AC97C) Channel B data will be transmitted during this slot*/
#define 	AT91C_AC97C_CHID10_CC                   ((unsigned int) 0x3 << 21) /* (AC97C) Channel C data will be transmitted during this slot*/
#define AT91C_AC97C_CHID11    ((unsigned int) 0x7 << 24) /* (AC97C) Channel Id for the input slot 11*/
#define 	AT91C_AC97C_CHID11_NONE                 ((unsigned int) 0x0 << 24) /* (AC97C) No data will be transmitted during this slot*/
#define 	AT91C_AC97C_CHID11_CA                   ((unsigned int) 0x1 << 24) /* (AC97C) Channel A data will be transmitted during this slot*/
#define 	AT91C_AC97C_CHID11_CB                   ((unsigned int) 0x2 << 24) /* (AC97C) Channel B data will be transmitted during this slot*/
#define 	AT91C_AC97C_CHID11_CC                   ((unsigned int) 0x3 << 24) /* (AC97C) Channel C data will be transmitted during this slot*/
#define AT91C_AC97C_CHID12    ((unsigned int) 0x7 << 27) /* (AC97C) Channel Id for the input slot 12*/
#define 	AT91C_AC97C_CHID12_NONE                 ((unsigned int) 0x0 << 27) /* (AC97C) No data will be transmitted during this slot*/
#define 	AT91C_AC97C_CHID12_CA                   ((unsigned int) 0x1 << 27) /* (AC97C) Channel A data will be transmitted during this slot*/
#define 	AT91C_AC97C_CHID12_CB                   ((unsigned int) 0x2 << 27) /* (AC97C) Channel B data will be transmitted during this slot*/
#define 	AT91C_AC97C_CHID12_CC                   ((unsigned int) 0x3 << 27) /* (AC97C) Channel C data will be transmitted during this slot*/
/* -------- AC97C_OCA : (AC97C Offset: 0x14) AC97C Output Channel Assignement Register -------- */
/* -------- AC97C_CARHR : (AC97C Offset: 0x20) AC97C Channel A Receive Holding Register -------- */
#define AT91C_AC97C_RDATA     ((unsigned int) 0xFFFFF <<  0) /* (AC97C) Receive data*/
/* -------- AC97C_CATHR : (AC97C Offset: 0x24) AC97C Channel A Transmit Holding Register -------- */
#define AT91C_AC97C_TDATA     ((unsigned int) 0xFFFFF <<  0) /* (AC97C) Transmit data*/
/* -------- AC97C_CASR : (AC97C Offset: 0x28) AC97C Channel A Status Register -------- */
#define AT91C_AC97C_TXRDY     ((unsigned int) 0x1 <<  0) /* (AC97C) */
#define AT91C_AC97C_TXEMPTY   ((unsigned int) 0x1 <<  1) /* (AC97C) */
#define AT91C_AC97C_UNRUN     ((unsigned int) 0x1 <<  2) /* (AC97C) */
#define AT91C_AC97C_RXRDY     ((unsigned int) 0x1 <<  4) /* (AC97C) */
#define AT91C_AC97C_OVRUN     ((unsigned int) 0x1 <<  5) /* (AC97C) */
#define AT91C_AC97C_ENDTX     ((unsigned int) 0x1 << 10) /* (AC97C) */
#define AT91C_AC97C_TXBUFE    ((unsigned int) 0x1 << 11) /* (AC97C) */
#define AT91C_AC97C_ENDRX     ((unsigned int) 0x1 << 14) /* (AC97C) */
#define AT91C_AC97C_RXBUFF    ((unsigned int) 0x1 << 15) /* (AC97C) */
/* -------- AC97C_CAMR : (AC97C Offset: 0x2c) AC97C Channel A Mode Register -------- */
#define AT91C_AC97C_SIZE      ((unsigned int) 0x3 << 16) /* (AC97C) */
#define 	AT91C_AC97C_SIZE_20_BITS              ((unsigned int) 0x0 << 16) /* (AC97C) Data size is 20 bits*/
#define 	AT91C_AC97C_SIZE_18_BITS              ((unsigned int) 0x1 << 16) /* (AC97C) Data size is 18 bits*/
#define 	AT91C_AC97C_SIZE_16_BITS              ((unsigned int) 0x2 << 16) /* (AC97C) Data size is 16 bits*/
#define 	AT91C_AC97C_SIZE_10_BITS              ((unsigned int) 0x3 << 16) /* (AC97C) Data size is 10 bits*/
#define AT91C_AC97C_CEM       ((unsigned int) 0x1 << 18) /* (AC97C) */
#define AT91C_AC97C_CEN       ((unsigned int) 0x1 << 21) /* (AC97C) */
#define AT91C_AC97C_PDCEN     ((unsigned int) 0x1 << 22) /* (AC97C) */
/* -------- AC97C_CBRHR : (AC97C Offset: 0x30) AC97C Channel B Receive Holding Register -------- */
/* -------- AC97C_CBTHR : (AC97C Offset: 0x34) AC97C Channel B Transmit Holding Register -------- */
/* -------- AC97C_CBSR : (AC97C Offset: 0x38) AC97C Channel B Status Register -------- */
/* -------- AC97C_CBMR : (AC97C Offset: 0x3c) AC97C Channel B Mode Register -------- */
/* -------- AC97C_CORHR : (AC97C Offset: 0x40) AC97C Codec Channel Receive Holding Register -------- */
#define AT91C_AC97C_SDATA     ((unsigned int) 0xFFFF <<  0) /* (AC97C) Status Data*/
/* -------- AC97C_COTHR : (AC97C Offset: 0x44) AC97C Codec Channel Transmit Holding Register -------- */
#define AT91C_AC97C_CDATA     ((unsigned int) 0xFFFF <<  0) /* (AC97C) Command Data*/
#define AT91C_AC97C_CADDR     ((unsigned int) 0x7F << 16) /* (AC97C) COdec control register index*/
#define AT91C_AC97C_READ      ((unsigned int) 0x1 << 23) /* (AC97C) Read/Write command*/
/* -------- AC97C_COSR : (AC97C Offset: 0x48) AC97C CODEC Status Register -------- */
/* -------- AC97C_COMR : (AC97C Offset: 0x4c) AC97C CODEC Mode Register -------- */
/* -------- AC97C_SR : (AC97C Offset: 0x50) AC97C Status Register -------- */
#define AT91C_AC97C_SOF       ((unsigned int) 0x1 <<  0) /* (AC97C) */
#define AT91C_AC97C_WKUP      ((unsigned int) 0x1 <<  1) /* (AC97C) */
#define AT91C_AC97C_COEVT     ((unsigned int) 0x1 <<  2) /* (AC97C) */
#define AT91C_AC97C_CAEVT     ((unsigned int) 0x1 <<  3) /* (AC97C) */
#define AT91C_AC97C_CBEVT     ((unsigned int) 0x1 <<  4) /* (AC97C) */
/* -------- AC97C_IER : (AC97C Offset: 0x54) AC97C Interrupt Enable Register -------- */
/* -------- AC97C_IDR : (AC97C Offset: 0x58) AC97C Interrupt Disable Register -------- */
/* -------- AC97C_IMR : (AC97C Offset: 0x5c) AC97C Interrupt Mask Register -------- */

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Serial Parallel Interface*/
/* ******************************************************************************/
typedef struct _AT91S_SPI {
	AT91_REG	 SPI_CR; 	/* Control Register*/
	AT91_REG	 SPI_MR; 	/* Mode Register*/
	AT91_REG	 SPI_RDR; 	/* Receive Data Register*/
	AT91_REG	 SPI_TDR; 	/* Transmit Data Register*/
	AT91_REG	 SPI_SR; 	/* Status Register*/
	AT91_REG	 SPI_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 SPI_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 SPI_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 Reserved0[4]; 	/* */
	AT91_REG	 SPI_CSR[4]; 	/* Chip Select Register*/
	AT91_REG	 Reserved1[48]; 	/* */
	AT91_REG	 SPI_RPR; 	/* Receive Pointer Register*/
	AT91_REG	 SPI_RCR; 	/* Receive Counter Register*/
	AT91_REG	 SPI_TPR; 	/* Transmit Pointer Register*/
	AT91_REG	 SPI_TCR; 	/* Transmit Counter Register*/
	AT91_REG	 SPI_RNPR; 	/* Receive Next Pointer Register*/
	AT91_REG	 SPI_RNCR; 	/* Receive Next Counter Register*/
	AT91_REG	 SPI_TNPR; 	/* Transmit Next Pointer Register*/
	AT91_REG	 SPI_TNCR; 	/* Transmit Next Counter Register*/
	AT91_REG	 SPI_PTCR; 	/* PDC Transfer Control Register*/
	AT91_REG	 SPI_PTSR; 	/* PDC Transfer Status Register*/
} AT91S_SPI, *AT91PS_SPI;

