una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91cap9.h
/* -------- SPI_CR : (SPI Offset: 0x0) SPI Control Register -------- */
#define AT91C_SPI_SPIEN       ((unsigned int) 0x1 <<  0) /* (SPI) SPI Enable*/
#define AT91C_SPI_SPIDIS      ((unsigned int) 0x1 <<  1) /* (SPI) SPI Disable*/
#define AT91C_SPI_SWRST       ((unsigned int) 0x1 <<  7) /* (SPI) SPI Software reset*/
#define AT91C_SPI_LASTXFER    ((unsigned int) 0x1 << 24) /* (SPI) SPI Last Transfer*/
/* -------- SPI_MR : (SPI Offset: 0x4) SPI Mode Register -------- */
#define AT91C_SPI_MSTR        ((unsigned int) 0x1 <<  0) /* (SPI) Master/Slave Mode*/
#define AT91C_SPI_PS          ((unsigned int) 0x1 <<  1) /* (SPI) Peripheral Select*/
#define 	AT91C_SPI_PS_FIXED                ((unsigned int) 0x0 <<  1) /* (SPI) Fixed Peripheral Select*/
#define 	AT91C_SPI_PS_VARIABLE             ((unsigned int) 0x1 <<  1) /* (SPI) Variable Peripheral Select*/
#define AT91C_SPI_PCSDEC      ((unsigned int) 0x1 <<  2) /* (SPI) Chip Select Decode*/
#define AT91C_SPI_FDIV        ((unsigned int) 0x1 <<  3) /* (SPI) Clock Selection*/
#define AT91C_SPI_MODFDIS     ((unsigned int) 0x1 <<  4) /* (SPI) Mode Fault Detection*/
#define AT91C_SPI_LLB         ((unsigned int) 0x1 <<  7) /* (SPI) Clock Selection*/
#define AT91C_SPI_PCS         ((unsigned int) 0xF << 16) /* (SPI) Peripheral Chip Select*/
#define AT91C_SPI_DLYBCS      ((unsigned int) 0xFF << 24) /* (SPI) Delay Between Chip Selects*/
/* -------- SPI_RDR : (SPI Offset: 0x8) Receive Data Register -------- */
#define AT91C_SPI_RD          ((unsigned int) 0xFFFF <<  0) /* (SPI) Receive Data*/
#define AT91C_SPI_RPCS        ((unsigned int) 0xF << 16) /* (SPI) Peripheral Chip Select Status*/
/* -------- SPI_TDR : (SPI Offset: 0xc) Transmit Data Register -------- */
#define AT91C_SPI_TD          ((unsigned int) 0xFFFF <<  0) /* (SPI) Transmit Data*/
#define AT91C_SPI_TPCS        ((unsigned int) 0xF << 16) /* (SPI) Peripheral Chip Select Status*/
/* -------- SPI_SR : (SPI Offset: 0x10) Status Register -------- */
#define AT91C_SPI_RDRF        ((unsigned int) 0x1 <<  0) /* (SPI) Receive Data Register Full*/
#define AT91C_SPI_TDRE        ((unsigned int) 0x1 <<  1) /* (SPI) Transmit Data Register Empty*/
#define AT91C_SPI_MODF        ((unsigned int) 0x1 <<  2) /* (SPI) Mode Fault Error*/
#define AT91C_SPI_OVRES       ((unsigned int) 0x1 <<  3) /* (SPI) Overrun Error Status*/
#define AT91C_SPI_ENDRX       ((unsigned int) 0x1 <<  4) /* (SPI) End of Receiver Transfer*/
#define AT91C_SPI_ENDTX       ((unsigned int) 0x1 <<  5) /* (SPI) End of Receiver Transfer*/
#define AT91C_SPI_RXBUFF      ((unsigned int) 0x1 <<  6) /* (SPI) RXBUFF Interrupt*/
#define AT91C_SPI_TXBUFE      ((unsigned int) 0x1 <<  7) /* (SPI) TXBUFE Interrupt*/
#define AT91C_SPI_NSSR        ((unsigned int) 0x1 <<  8) /* (SPI) NSSR Interrupt*/
#define AT91C_SPI_TXEMPTY     ((unsigned int) 0x1 <<  9) /* (SPI) TXEMPTY Interrupt*/
#define AT91C_SPI_SPIENS      ((unsigned int) 0x1 << 16) /* (SPI) Enable Status*/
/* -------- SPI_IER : (SPI Offset: 0x14) Interrupt Enable Register -------- */
/* -------- SPI_IDR : (SPI Offset: 0x18) Interrupt Disable Register -------- */
/* -------- SPI_IMR : (SPI Offset: 0x1c) Interrupt Mask Register -------- */
/* -------- SPI_CSR : (SPI Offset: 0x30) Chip Select Register -------- */
#define AT91C_SPI_CPOL        ((unsigned int) 0x1 <<  0) /* (SPI) Clock Polarity*/
#define AT91C_SPI_NCPHA       ((unsigned int) 0x1 <<  1) /* (SPI) Clock Phase*/
#define AT91C_SPI_CSAAT       ((unsigned int) 0x1 <<  3) /* (SPI) Chip Select Active After Transfer*/
#define AT91C_SPI_BITS        ((unsigned int) 0xF <<  4) /* (SPI) Bits Per Transfer*/
#define 	AT91C_SPI_BITS_8                    ((unsigned int) 0x0 <<  4) /* (SPI) 8 Bits Per transfer*/
#define 	AT91C_SPI_BITS_9                    ((unsigned int) 0x1 <<  4) /* (SPI) 9 Bits Per transfer*/
#define 	AT91C_SPI_BITS_10                   ((unsigned int) 0x2 <<  4) /* (SPI) 10 Bits Per transfer*/
#define 	AT91C_SPI_BITS_11                   ((unsigned int) 0x3 <<  4) /* (SPI) 11 Bits Per transfer*/
#define 	AT91C_SPI_BITS_12                   ((unsigned int) 0x4 <<  4) /* (SPI) 12 Bits Per transfer*/
#define 	AT91C_SPI_BITS_13                   ((unsigned int) 0x5 <<  4) /* (SPI) 13 Bits Per transfer*/
#define 	AT91C_SPI_BITS_14                   ((unsigned int) 0x6 <<  4) /* (SPI) 14 Bits Per transfer*/
#define 	AT91C_SPI_BITS_15                   ((unsigned int) 0x7 <<  4) /* (SPI) 15 Bits Per transfer*/
#define 	AT91C_SPI_BITS_16                   ((unsigned int) 0x8 <<  4) /* (SPI) 16 Bits Per transfer*/
#define AT91C_SPI_SCBR        ((unsigned int) 0xFF <<  8) /* (SPI) Serial Clock Baud Rate*/
#define AT91C_SPI_DLYBS       ((unsigned int) 0xFF << 16) /* (SPI) Delay Before SPCK*/
#define AT91C_SPI_DLYBCT      ((unsigned int) 0xFF << 24) /* (SPI) Delay Between Consecutive Transfers*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Control Area Network MailBox Interface*/
/* ******************************************************************************/
typedef struct _AT91S_CAN_MB {
	AT91_REG	 CAN_MB_MMR; 	/* MailBox Mode Register*/
	AT91_REG	 CAN_MB_MAM; 	/* MailBox Acceptance Mask Register*/
	AT91_REG	 CAN_MB_MID; 	/* MailBox ID Register*/
	AT91_REG	 CAN_MB_MFID; 	/* MailBox Family ID Register*/
	AT91_REG	 CAN_MB_MSR; 	/* MailBox Status Register*/
	AT91_REG	 CAN_MB_MDL; 	/* MailBox Data Low Register*/
	AT91_REG	 CAN_MB_MDH; 	/* MailBox Data High Register*/
	AT91_REG	 CAN_MB_MCR; 	/* MailBox Control Register*/
} AT91S_CAN_MB, *AT91PS_CAN_MB;

/* -------- CAN_MMR : (CAN_MB Offset: 0x0) CAN Message Mode Register -------- */
#define AT91C_CAN_MTIMEMARK   ((unsigned int) 0xFFFF <<  0) /* (CAN_MB) Mailbox Timemark*/
#define AT91C_CAN_PRIOR       ((unsigned int) 0xF << 16) /* (CAN_MB) Mailbox Priority*/
#define AT91C_CAN_MOT         ((unsigned int) 0x7 << 24) /* (CAN_MB) Mailbox Object Type*/
#define 	AT91C_CAN_MOT_DIS                  ((unsigned int) 0x0 << 24) /* (CAN_MB) */
#define 	AT91C_CAN_MOT_RX                   ((unsigned int) 0x1 << 24) /* (CAN_MB) */
#define 	AT91C_CAN_MOT_RXOVERWRITE          ((unsigned int) 0x2 << 24) /* (CAN_MB) */
#define 	AT91C_CAN_MOT_TX                   ((unsigned int) 0x3 << 24) /* (CAN_MB) */
#define 	AT91C_CAN_MOT_CONSUMER             ((unsigned int) 0x4 << 24) /* (CAN_MB) */
#define 	AT91C_CAN_MOT_PRODUCER             ((unsigned int) 0x5 << 24) /* (CAN_MB) */
/* -------- CAN_MAM : (CAN_MB Offset: 0x4) CAN Message Acceptance Mask Register -------- */
#define AT91C_CAN_MIDvB       ((unsigned int) 0x3FFFF <<  0) /* (CAN_MB) Complementary bits for identifier in extended mode*/
#define AT91C_CAN_MIDvA       ((unsigned int) 0x7FF << 18) /* (CAN_MB) Identifier for standard frame mode*/
#define AT91C_CAN_MIDE        ((unsigned int) 0x1 << 29) /* (CAN_MB) Identifier Version*/
/* -------- CAN_MID : (CAN_MB Offset: 0x8) CAN Message ID Register -------- */
/* -------- CAN_MFID : (CAN_MB Offset: 0xc) CAN Message Family ID Register -------- */
/* -------- CAN_MSR : (CAN_MB Offset: 0x10) CAN Message Status Register -------- */
#define AT91C_CAN_MTIMESTAMP  ((unsigned int) 0xFFFF <<  0) /* (CAN_MB) Timer Value*/
#define AT91C_CAN_MDLC        ((unsigned int) 0xF << 16) /* (CAN_MB) Mailbox Data Length Code*/
#define AT91C_CAN_MRTR        ((unsigned int) 0x1 << 20) /* (CAN_MB) Mailbox Remote Transmission Request*/
#define AT91C_CAN_MABT        ((unsigned int) 0x1 << 22) /* (CAN_MB) Mailbox Message Abort*/
#define AT91C_CAN_MRDY        ((unsigned int) 0x1 << 23) /* (CAN_MB) Mailbox Ready*/
#define AT91C_CAN_MMI         ((unsigned int) 0x1 << 24) /* (CAN_MB) Mailbox Message Ignored*/
/* -------- CAN_MDL : (CAN_MB Offset: 0x14) CAN Message Data Low Register -------- */
/* -------- CAN_MDH : (CAN_MB Offset: 0x18) CAN Message Data High Register -------- */
/* -------- CAN_MCR : (CAN_MB Offset: 0x1c) CAN Message Control Register -------- */
#define AT91C_CAN_MACR        ((unsigned int) 0x1 << 22) /* (CAN_MB) Abort Request for Mailbox*/
#define AT91C_CAN_MTCR        ((unsigned int) 0x1 << 23) /* (CAN_MB) Mailbox Transfer Command*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Control Area Network Interface*/
/* ******************************************************************************/
typedef struct _AT91S_CAN {
	AT91_REG	 CAN_MR; 	/* Mode Register*/
	AT91_REG	 CAN_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 CAN_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 CAN_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 CAN_SR; 	/* Status Register*/
	AT91_REG	 CAN_BR; 	/* Baudrate Register*/
	AT91_REG	 CAN_TIM; 	/* Timer Register*/
	AT91_REG	 CAN_TIMESTP; 	/* Time Stamp Register*/
	AT91_REG	 CAN_ECR; 	/* Error Counter Register*/
	AT91_REG	 CAN_TCR; 	/* Transfer Command Register*/
	AT91_REG	 CAN_ACR; 	/* Abort Command Register*/
	AT91_REG	 Reserved0[52]; 	/* */
	AT91_REG	 CAN_VR; 	/* Version Register*/
	AT91_REG	 Reserved1[64]; 	/* */
	AT91S_CAN_MB	 CAN_MB0; 	/* CAN Mailbox 0*/
	AT91S_CAN_MB	 CAN_MB1; 	/* CAN Mailbox 1*/
	AT91S_CAN_MB	 CAN_MB2; 	/* CAN Mailbox 2*/
	AT91S_CAN_MB	 CAN_MB3; 	/* CAN Mailbox 3*/
	AT91S_CAN_MB	 CAN_MB4; 	/* CAN Mailbox 4*/
	AT91S_CAN_MB	 CAN_MB5; 	/* CAN Mailbox 5*/
	AT91S_CAN_MB	 CAN_MB6; 	/* CAN Mailbox 6*/
	AT91S_CAN_MB	 CAN_MB7; 	/* CAN Mailbox 7*/
	AT91S_CAN_MB	 CAN_MB8; 	/* CAN Mailbox 8*/
	AT91S_CAN_MB	 CAN_MB9; 	/* CAN Mailbox 9*/
	AT91S_CAN_MB	 CAN_MB10; 	/* CAN Mailbox 10*/
	AT91S_CAN_MB	 CAN_MB11; 	/* CAN Mailbox 11*/
	AT91S_CAN_MB	 CAN_MB12; 	/* CAN Mailbox 12*/
	AT91S_CAN_MB	 CAN_MB13; 	/* CAN Mailbox 13*/
	AT91S_CAN_MB	 CAN_MB14; 	/* CAN Mailbox 14*/
	AT91S_CAN_MB	 CAN_MB15; 	/* CAN Mailbox 15*/
} AT91S_CAN, *AT91PS_CAN;

/* -------- CAN_MR : (CAN Offset: 0x0) CAN Mode Register -------- */
#define AT91C_CAN_CANEN       ((unsigned int) 0x1 <<  0) /* (CAN) CAN Controller Enable*/
#define AT91C_CAN_LPM         ((unsigned int) 0x1 <<  1) /* (CAN) Disable/Enable Low Power Mode*/
#define AT91C_CAN_ABM         ((unsigned int) 0x1 <<  2) /* (CAN) Disable/Enable Autobaud/Listen Mode*/
#define AT91C_CAN_OVL         ((unsigned int) 0x1 <<  3) /* (CAN) Disable/Enable Overload Frame*/
#define AT91C_CAN_TEOF        ((unsigned int) 0x1 <<  4) /* (CAN) Time Stamp messages at each end of Frame*/
#define AT91C_CAN_TTM         ((unsigned int) 0x1 <<  5) /* (CAN) Disable/Enable Time Trigger Mode*/
#define AT91C_CAN_TIMFRZ      ((unsigned int) 0x1 <<  6) /* (CAN) Enable Timer Freeze*/
#define AT91C_CAN_DRPT        ((unsigned int) 0x1 <<  7) /* (CAN) Disable Repeat*/
/* -------- CAN_IER : (CAN Offset: 0x4) CAN Interrupt Enable Register -------- */
#define AT91C_CAN_MB0         ((unsigned int) 0x1 <<  0) /* (CAN) Mailbox 0 Flag*/
#define AT91C_CAN_MB1         ((unsigned int) 0x1 <<  1) /* (CAN) Mailbox 1 Flag*/
#define AT91C_CAN_MB2         ((unsigned int) 0x1 <<  2) /* (CAN) Mailbox 2 Flag*/
#define AT91C_CAN_MB3         ((unsigned int) 0x1 <<  3) /* (CAN) Mailbox 3 Flag*/
#define AT91C_CAN_MB4         ((unsigned int) 0x1 <<  4) /* (CAN) Mailbox 4 Flag*/
#define AT91C_CAN_MB5         ((unsigned int) 0x1 <<  5) /* (CAN) Mailbox 5 Flag*/
#define AT91C_CAN_MB6         ((unsigned int) 0x1 <<  6) /* (CAN) Mailbox 6 Flag*/
#define AT91C_CAN_MB7         ((unsigned int) 0x1 <<  7) /* (CAN) Mailbox 7 Flag*/
#define AT91C_CAN_MB8         ((unsigned int) 0x1 <<  8) /* (CAN) Mailbox 8 Flag*/
#define AT91C_CAN_MB9         ((unsigned int) 0x1 <<  9) /* (CAN) Mailbox 9 Flag*/
#define AT91C_CAN_MB10        ((unsigned int) 0x1 << 10) /* (CAN) Mailbox 10 Flag*/
#define AT91C_CAN_MB11        ((unsigned int) 0x1 << 11) /* (CAN) Mailbox 11 Flag*/
#define AT91C_CAN_MB12        ((unsigned int) 0x1 << 12) /* (CAN) Mailbox 12 Flag*/
#define AT91C_CAN_MB13        ((unsigned int) 0x1 << 13) /* (CAN) Mailbox 13 Flag*/
#define AT91C_CAN_MB14        ((unsigned int) 0x1 << 14) /* (CAN) Mailbox 14 Flag*/
#define AT91C_CAN_MB15        ((unsigned int) 0x1 << 15) /* (CAN) Mailbox 15 Flag*/
#define AT91C_CAN_ERRA        ((unsigned int) 0x1 << 16) /* (CAN) Error Active Mode Flag*/
#define AT91C_CAN_WARN        ((unsigned int) 0x1 << 17) /* (CAN) Warning Limit Flag*/
#define AT91C_CAN_ERRP        ((unsigned int) 0x1 << 18) /* (CAN) Error Passive Mode Flag*/
#define AT91C_CAN_BOFF        ((unsigned int) 0x1 << 19) /* (CAN) Bus Off Mode Flag*/
#define AT91C_CAN_SLEEP       ((unsigned int) 0x1 << 20) /* (CAN) Sleep Flag*/
#define AT91C_CAN_WAKEUP      ((unsigned int) 0x1 << 21) /* (CAN) Wakeup Flag*/
#define AT91C_CAN_TOVF        ((unsigned int) 0x1 << 22) /* (CAN) Timer Overflow Flag*/
#define AT91C_CAN_TSTP        ((unsigned int) 0x1 << 23) /* (CAN) Timestamp Flag*/
#define AT91C_CAN_CERR        ((unsigned int) 0x1 << 24) /* (CAN) CRC Error*/
#define AT91C_CAN_SERR        ((unsigned int) 0x1 << 25) /* (CAN) Stuffing Error*/
#define AT91C_CAN_AERR        ((unsigned int) 0x1 << 26) /* (CAN) Acknowledgment Error*/
#define AT91C_CAN_FERR        ((unsigned int) 0x1 << 27) /* (CAN) Form Error*/
#define AT91C_CAN_BERR        ((unsigned int) 0x1 << 28) /* (CAN) Bit Error*/
/* -------- CAN_IDR : (CAN Offset: 0x8) CAN Interrupt Disable Register -------- */
/* -------- CAN_IMR : (CAN Offset: 0xc) CAN Interrupt Mask Register -------- */
/* -------- CAN_SR : (CAN Offset: 0x10) CAN Status Register -------- */
#define AT91C_CAN_RBSY        ((unsigned int) 0x1 << 29) /* (CAN) Receiver Busy*/
#define AT91C_CAN_TBSY        ((unsigned int) 0x1 << 30) /* (CAN) Transmitter Busy*/
#define AT91C_CAN_OVLY        ((unsigned int) 0x1 << 31) /* (CAN) Overload Busy*/
/* -------- CAN_BR : (CAN Offset: 0x14) CAN Baudrate Register -------- */
#define AT91C_CAN_PHASE2      ((unsigned int) 0x7 <<  0) /* (CAN) Phase 2 segment*/
#define AT91C_CAN_PHASE1      ((unsigned int) 0x7 <<  4) /* (CAN) Phase 1 segment*/
#define AT91C_CAN_PROPAG      ((unsigned int) 0x7 <<  8) /* (CAN) Programmation time segment*/
#define AT91C_CAN_SYNC        ((unsigned int) 0x3 << 12) /* (CAN) Re-synchronization jump width segment*/
#define AT91C_CAN_BRP         ((unsigned int) 0x7F << 16) /* (CAN) Baudrate Prescaler*/
#define AT91C_CAN_SMP         ((unsigned int) 0x1 << 24) /* (CAN) Sampling mode*/
/* -------- CAN_TIM : (CAN Offset: 0x18) CAN Timer Register -------- */
#define AT91C_CAN_TIMER       ((unsigned int) 0xFFFF <<  0) /* (CAN) Timer field*/
/* -------- CAN_TIMESTP : (CAN Offset: 0x1c) CAN Timestamp Register -------- */
/* -------- CAN_ECR : (CAN Offset: 0x20) CAN Error Counter Register -------- */
#define AT91C_CAN_REC         ((unsigned int) 0xFF <<  0) /* (CAN) Receive Error Counter*/
#define AT91C_CAN_TEC         ((unsigned int) 0xFF << 16) /* (CAN) Transmit Error Counter*/
/* -------- CAN_TCR : (CAN Offset: 0x24) CAN Transfer Command Register -------- */
#define AT91C_CAN_TIMRST      ((unsigned int) 0x1 << 31) /* (CAN) Timer Reset Field*/
/* -------- CAN_ACR : (CAN Offset: 0x28) CAN Abort Command Register -------- */

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Advanced  Encryption Standard*/
/* ******************************************************************************/
typedef struct _AT91S_AES {
	AT91_REG	 AES_CR; 	/* Control Register*/
	AT91_REG	 AES_MR; 	/* Mode Register*/
	AT91_REG	 Reserved0[2]; 	/* */
	AT91_REG	 AES_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 AES_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 AES_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 AES_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 AES_KEYWxR[8]; 	/* Key Word x Register*/
	AT91_REG	 AES_IDATAxR[4]; 	/* Input Data x Register*/
	AT91_REG	 AES_ODATAxR[4]; 	/* Output Data x Register*/
	AT91_REG	 AES_IVxR[4]; 	/* Initialization Vector x Register*/
	AT91_REG	 Reserved1[35]; 	/* */
	AT91_REG	 AES_VR; 	/* AES Version Register*/
	AT91_REG	 AES_RPR; 	/* Receive Pointer Register*/
	AT91_REG	 AES_RCR; 	/* Receive Counter Register*/
	AT91_REG	 AES_TPR; 	/* Transmit Pointer Register*/
	AT91_REG	 AES_TCR; 	/* Transmit Counter Register*/
	AT91_REG	 AES_RNPR; 	/* Receive Next Pointer Register*/
	AT91_REG	 AES_RNCR; 	/* Receive Next Counter Register*/
	AT91_REG	 AES_TNPR; 	/* Transmit Next Pointer Register*/
	AT91_REG	 AES_TNCR; 	/* Transmit Next Counter Register*/
	AT91_REG	 AES_PTCR; 	/* PDC Transfer Control Register*/
	AT91_REG	 AES_PTSR; 	/* PDC Transfer Status Register*/
} AT91S_AES, *AT91PS_AES;

