una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91cap9.h
/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR System Peripherals*/
/* ******************************************************************************/
typedef struct _AT91S_SYS {
	AT91_REG	 SYS_ECC_CR; 	/*  ECC reset register*/
	AT91_REG	 SYS_ECC_MR; 	/*  ECC Page size register*/
	AT91_REG	 SYS_ECC_SR; 	/*  ECC Status register*/
	AT91_REG	 SYS_ECC_PR; 	/*  ECC Parity register*/
	AT91_REG	 SYS_ECC_NPR; 	/*  ECC Parity N register*/
	AT91_REG	 Reserved0[58]; 	/* */
	AT91_REG	 SYS_ECC_VR; 	/*  ECC Version register*/
	AT91_REG	 Reserved1[64]; 	/* */
	AT91_REG	 SYS_BCRAMC_CR; 	/* BCRAM Controller Configuration Register*/
	AT91_REG	 SYS_BCRAMC_TPR; 	/* BCRAM Controller Timing Parameter Register*/
	AT91_REG	 SYS_BCRAMC_HSR; 	/* BCRAM Controller High Speed Register*/
	AT91_REG	 SYS_BCRAMC_LPR; 	/* BCRAM Controller Low Power Register*/
	AT91_REG	 SYS_BCRAMC_MDR; 	/* BCRAM Memory Device Register*/
	AT91_REG	 Reserved2[54]; 	/* */
	AT91_REG	 SYS_BCRAMC_PADDSR; 	/* BCRAM PADDR Size Register*/
	AT91_REG	 SYS_BCRAMC_IPNR1; 	/* BCRAM IP Name Register 1*/
	AT91_REG	 SYS_BCRAMC_IPNR2; 	/* BCRAM IP Name Register 2*/
	AT91_REG	 SYS_BCRAMC_IPFR; 	/* BCRAM IP Features Register*/
	AT91_REG	 SYS_BCRAMC_VR; 	/* BCRAM Version Register*/
	AT91_REG	 Reserved3[64]; 	/* */
	AT91_REG	 SYS_SDRAMC_MR; 	/* SDRAM Controller Mode Register*/
	AT91_REG	 SYS_SDRAMC_TR; 	/* SDRAM Controller Refresh Timer Register*/
	AT91_REG	 SYS_SDRAMC_CR; 	/* SDRAM Controller Configuration Register*/
	AT91_REG	 SYS_SDRAMC_HSR; 	/* SDRAM Controller High Speed Register*/
	AT91_REG	 SYS_SDRAMC_LPR; 	/* SDRAM Controller Low Power Register*/
	AT91_REG	 SYS_SDRAMC_IER; 	/* SDRAM Controller Interrupt Enable Register*/
	AT91_REG	 SYS_SDRAMC_IDR; 	/* SDRAM Controller Interrupt Disable Register*/
	AT91_REG	 SYS_SDRAMC_IMR; 	/* SDRAM Controller Interrupt Mask Register*/
	AT91_REG	 SYS_SDRAMC_ISR; 	/* SDRAM Controller Interrupt Mask Register*/
	AT91_REG	 SYS_SDRAMC_MDR; 	/* SDRAM Memory Device Register*/
	AT91_REG	 Reserved4[118]; 	/* */
	AT91_REG	 SYS_SMC_SETUP0; 	/*  Setup Register for CS 0*/
	AT91_REG	 SYS_SMC_PULSE0; 	/*  Pulse Register for CS 0*/
	AT91_REG	 SYS_SMC_CYCLE0; 	/*  Cycle Register for CS 0*/
	AT91_REG	 SYS_SMC_CTRL0; 	/*  Control Register for CS 0*/
	AT91_REG	 SYS_SMC_SETUP1; 	/*  Setup Register for CS 1*/
	AT91_REG	 SYS_SMC_PULSE1; 	/*  Pulse Register for CS 1*/
	AT91_REG	 SYS_SMC_CYCLE1; 	/*  Cycle Register for CS 1*/
	AT91_REG	 SYS_SMC_CTRL1; 	/*  Control Register for CS 1*/
	AT91_REG	 SYS_SMC_SETUP2; 	/*  Setup Register for CS 2*/
	AT91_REG	 SYS_SMC_PULSE2; 	/*  Pulse Register for CS 2*/
	AT91_REG	 SYS_SMC_CYCLE2; 	/*  Cycle Register for CS 2*/
	AT91_REG	 SYS_SMC_CTRL2; 	/*  Control Register for CS 2*/
	AT91_REG	 SYS_SMC_SETUP3; 	/*  Setup Register for CS 3*/
	AT91_REG	 SYS_SMC_PULSE3; 	/*  Pulse Register for CS 3*/
	AT91_REG	 SYS_SMC_CYCLE3; 	/*  Cycle Register for CS 3*/
	AT91_REG	 SYS_SMC_CTRL3; 	/*  Control Register for CS 3*/
	AT91_REG	 SYS_SMC_SETUP4; 	/*  Setup Register for CS 4*/
	AT91_REG	 SYS_SMC_PULSE4; 	/*  Pulse Register for CS 4*/
	AT91_REG	 SYS_SMC_CYCLE4; 	/*  Cycle Register for CS 4*/
	AT91_REG	 SYS_SMC_CTRL4; 	/*  Control Register for CS 4*/
	AT91_REG	 SYS_SMC_SETUP5; 	/*  Setup Register for CS 5*/
	AT91_REG	 SYS_SMC_PULSE5; 	/*  Pulse Register for CS 5*/
	AT91_REG	 SYS_SMC_CYCLE5; 	/*  Cycle Register for CS 5*/
	AT91_REG	 SYS_SMC_CTRL5; 	/*  Control Register for CS 5*/
	AT91_REG	 SYS_SMC_SETUP6; 	/*  Setup Register for CS 6*/
	AT91_REG	 SYS_SMC_PULSE6; 	/*  Pulse Register for CS 6*/
	AT91_REG	 SYS_SMC_CYCLE6; 	/*  Cycle Register for CS 6*/
	AT91_REG	 SYS_SMC_CTRL6; 	/*  Control Register for CS 6*/
	AT91_REG	 SYS_SMC_SETUP7; 	/*  Setup Register for CS 7*/
	AT91_REG	 SYS_SMC_PULSE7; 	/*  Pulse Register for CS 7*/
	AT91_REG	 SYS_SMC_CYCLE7; 	/*  Cycle Register for CS 7*/
	AT91_REG	 SYS_SMC_CTRL7; 	/*  Control Register for CS 7*/
	AT91_REG	 Reserved5[16]; 	/* */
	AT91_REG	 SYS_SMC_DELAY1; 	/* SMC Delay Control Register*/
	AT91_REG	 SYS_SMC_DELAY2; 	/* SMC Delay Control Register*/
	AT91_REG	 SYS_SMC_DELAY3; 	/* SMC Delay Control Register*/
	AT91_REG	 SYS_SMC_DELAY4; 	/* SMC Delay Control Register*/
	AT91_REG	 SYS_SMC_DELAY5; 	/* SMC Delay Control Register*/
	AT91_REG	 SYS_SMC_DELAY6; 	/* SMC Delay Control Register*/
	AT91_REG	 SYS_SMC_DELAY7; 	/* SMC Delay Control Register*/
	AT91_REG	 SYS_SMC_DELAY8; 	/* SMC Delay Control Register*/
	AT91_REG	 Reserved6[72]; 	/* */
	AT91_REG	 SYS_MATRIX_MCFG[12]; 	/*  Master Configuration Register */
	AT91_REG	 Reserved7[4]; 	/* */
	AT91_REG	 SYS_MATRIX_SCFG[9]; 	/*  Slave Configuration Register */
	AT91_REG	 Reserved8[7]; 	/* */
	AT91S_MATRIX_PRS	 SYS_MATRIX_PRS[9]; 	/*  Slave Priority Registers*/
	AT91_REG	 Reserved9[14]; 	/* */
	AT91_REG	 SYS_MATRIX_MRCR; 	/*  Master Remp Control Register */
	AT91_REG	 Reserved10[63]; 	/* */
	AT91_REG	 SYS_HDMA_GCFG; 	/* HDMA Global Configuration Register*/
	AT91_REG	 SYS_HDMA_EN; 	/* HDMA Controller Enable Register*/
	AT91_REG	 SYS_HDMA_SREQ; 	/* HDMA Software Single Request Register*/
	AT91_REG	 SYS_HDMA_BREQ; 	/* HDMA Software Chunk Transfer Request Register*/
	AT91_REG	 SYS_HDMA_LAST; 	/* HDMA Software Last Transfer Flag Register*/
	AT91_REG	 SYS_HDMA_SYNC; 	/* HDMA Request Synchronization Register*/
	AT91_REG	 SYS_HDMA_EBCIER; 	/* HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Interrupt Enable register*/
	AT91_REG	 SYS_HDMA_EBCIDR; 	/* HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Interrupt Disable register*/
	AT91_REG	 SYS_HDMA_EBCIMR; 	/* HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Mask Register*/
	AT91_REG	 SYS_HDMA_EBCISR; 	/* HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Status Register*/
	AT91_REG	 SYS_HDMA_CHER; 	/* HDMA Channel Handler Enable Register*/
	AT91_REG	 SYS_HDMA_CHDR; 	/* HDMA Channel Handler Disable Register*/
	AT91_REG	 SYS_HDMA_CHSR; 	/* HDMA Channel Handler Status Register*/
	AT91_REG	 Reserved11[2]; 	/* */
	AT91S_HDMA_CH	 SYS_HDMA_CH[4]; 	/* HDMA Channel structure*/
	AT91_REG	 Reserved12[81]; 	/* */
	AT91_REG	 SYS_DBGU_CR; 	/* Control Register*/
	AT91_REG	 SYS_DBGU_MR; 	/* Mode Register*/
	AT91_REG	 SYS_DBGU_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 SYS_DBGU_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 SYS_DBGU_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 SYS_DBGU_CSR; 	/* Channel Status Register*/
	AT91_REG	 SYS_DBGU_RHR; 	/* Receiver Holding Register*/
	AT91_REG	 SYS_DBGU_THR; 	/* Transmitter Holding Register*/
	AT91_REG	 SYS_DBGU_BRGR; 	/* Baud Rate Generator Register*/
	AT91_REG	 Reserved13[7]; 	/* */
	AT91_REG	 SYS_DBGU_CIDR; 	/* Chip ID Register*/
	AT91_REG	 SYS_DBGU_EXID; 	/* Chip ID Extension Register*/
	AT91_REG	 SYS_DBGU_FNTR; 	/* Force NTRST Register*/
	AT91_REG	 Reserved14[45]; 	/* */
	AT91_REG	 SYS_DBGU_RPR; 	/* Receive Pointer Register*/
	AT91_REG	 SYS_DBGU_RCR; 	/* Receive Counter Register*/
	AT91_REG	 SYS_DBGU_TPR; 	/* Transmit Pointer Register*/
	AT91_REG	 SYS_DBGU_TCR; 	/* Transmit Counter Register*/
	AT91_REG	 SYS_DBGU_RNPR; 	/* Receive Next Pointer Register*/
	AT91_REG	 SYS_DBGU_RNCR; 	/* Receive Next Counter Register*/
	AT91_REG	 SYS_DBGU_TNPR; 	/* Transmit Next Pointer Register*/
	AT91_REG	 SYS_DBGU_TNCR; 	/* Transmit Next Counter Register*/
	AT91_REG	 SYS_DBGU_PTCR; 	/* PDC Transfer Control Register*/
	AT91_REG	 SYS_DBGU_PTSR; 	/* PDC Transfer Status Register*/
	AT91_REG	 Reserved15[54]; 	/* */
	AT91_REG	 SYS_AIC_SMR[32]; 	/* Source Mode Register*/
	AT91_REG	 SYS_AIC_SVR[32]; 	/* Source Vector Register*/
	AT91_REG	 SYS_AIC_IVR; 	/* IRQ Vector Register*/
	AT91_REG	 SYS_AIC_FVR; 	/* FIQ Vector Register*/
	AT91_REG	 SYS_AIC_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 SYS_AIC_IPR; 	/* Interrupt Pending Register*/
	AT91_REG	 SYS_AIC_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 SYS_AIC_CISR; 	/* Core Interrupt Status Register*/
	AT91_REG	 Reserved16[2]; 	/* */
	AT91_REG	 SYS_AIC_IECR; 	/* Interrupt Enable Command Register*/
	AT91_REG	 SYS_AIC_IDCR; 	/* Interrupt Disable Command Register*/
	AT91_REG	 SYS_AIC_ICCR; 	/* Interrupt Clear Command Register*/
	AT91_REG	 SYS_AIC_ISCR; 	/* Interrupt Set Command Register*/
	AT91_REG	 SYS_AIC_EOICR; 	/* End of Interrupt Command Register*/
	AT91_REG	 SYS_AIC_SPU; 	/* Spurious Vector Register*/
	AT91_REG	 SYS_AIC_DCR; 	/* Debug Control Register (Protect)*/
	AT91_REG	 Reserved17[1]; 	/* */
	AT91_REG	 SYS_AIC_FFER; 	/* Fast Forcing Enable Register*/
	AT91_REG	 SYS_AIC_FFDR; 	/* Fast Forcing Disable Register*/
	AT91_REG	 SYS_AIC_FFSR; 	/* Fast Forcing Status Register*/
	AT91_REG	 Reserved18[45]; 	/* */
	AT91_REG	 SYS_PIOA_PER; 	/* PIO Enable Register*/
	AT91_REG	 SYS_PIOA_PDR; 	/* PIO Disable Register*/
	AT91_REG	 SYS_PIOA_PSR; 	/* PIO Status Register*/
	AT91_REG	 Reserved19[1]; 	/* */
	AT91_REG	 SYS_PIOA_OER; 	/* Output Enable Register*/
	AT91_REG	 SYS_PIOA_ODR; 	/* Output Disable Registerr*/
	AT91_REG	 SYS_PIOA_OSR; 	/* Output Status Register*/
	AT91_REG	 Reserved20[1]; 	/* */
	AT91_REG	 SYS_PIOA_IFER; 	/* Input Filter Enable Register*/
	AT91_REG	 SYS_PIOA_IFDR; 	/* Input Filter Disable Register*/
	AT91_REG	 SYS_PIOA_IFSR; 	/* Input Filter Status Register*/
	AT91_REG	 Reserved21[1]; 	/* */
	AT91_REG	 SYS_PIOA_SODR; 	/* Set Output Data Register*/
	AT91_REG	 SYS_PIOA_CODR; 	/* Clear Output Data Register*/
	AT91_REG	 SYS_PIOA_ODSR; 	/* Output Data Status Register*/
	AT91_REG	 SYS_PIOA_PDSR; 	/* Pin Data Status Register*/
	AT91_REG	 SYS_PIOA_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 SYS_PIOA_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 SYS_PIOA_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 SYS_PIOA_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 SYS_PIOA_MDER; 	/* Multi-driver Enable Register*/
	AT91_REG	 SYS_PIOA_MDDR; 	/* Multi-driver Disable Register*/
	AT91_REG	 SYS_PIOA_MDSR; 	/* Multi-driver Status Register*/
	AT91_REG	 Reserved22[1]; 	/* */
	AT91_REG	 SYS_PIOA_PPUDR; 	/* Pull-up Disable Register*/
	AT91_REG	 SYS_PIOA_PPUER; 	/* Pull-up Enable Register*/
	AT91_REG	 SYS_PIOA_PPUSR; 	/* Pull-up Status Register*/
	AT91_REG	 Reserved23[1]; 	/* */
	AT91_REG	 SYS_PIOA_ASR; 	/* Select A Register*/
	AT91_REG	 SYS_PIOA_BSR; 	/* Select B Register*/
	AT91_REG	 SYS_PIOA_ABSR; 	/* AB Select Status Register*/
	AT91_REG	 Reserved24[9]; 	/* */
	AT91_REG	 SYS_PIOA_OWER; 	/* Output Write Enable Register*/
	AT91_REG	 SYS_PIOA_OWDR; 	/* Output Write Disable Register*/
	AT91_REG	 SYS_PIOA_OWSR; 	/* Output Write Status Register*/
	AT91_REG	 Reserved25[1]; 	/* */
	AT91_REG	 SYS_PIOA_SLEWRATE1; 	/* PIO Slewrate Control Register*/
	AT91_REG	 Reserved26[3]; 	/* */
	AT91_REG	 SYS_PIOA_DELAY1; 	/* PIO Delay Control Register*/
	AT91_REG	 SYS_PIOA_DELAY2; 	/* PIO Delay Control Register*/
	AT91_REG	 SYS_PIOA_DELAY3; 	/* PIO Delay Control Register*/
	AT91_REG	 SYS_PIOA_DELAY4; 	/* PIO Delay Control Register*/
	AT91_REG	 Reserved27[11]; 	/* */
	AT91_REG	 SYS_PIOA_VERSION; 	/* PIO Version Register*/
	AT91_REG	 Reserved28[64]; 	/* */
	AT91_REG	 SYS_PIOB_PER; 	/* PIO Enable Register*/
	AT91_REG	 SYS_PIOB_PDR; 	/* PIO Disable Register*/
	AT91_REG	 SYS_PIOB_PSR; 	/* PIO Status Register*/
	AT91_REG	 Reserved29[1]; 	/* */
	AT91_REG	 SYS_PIOB_OER; 	/* Output Enable Register*/
	AT91_REG	 SYS_PIOB_ODR; 	/* Output Disable Registerr*/
	AT91_REG	 SYS_PIOB_OSR; 	/* Output Status Register*/
	AT91_REG	 Reserved30[1]; 	/* */
	AT91_REG	 SYS_PIOB_IFER; 	/* Input Filter Enable Register*/
	AT91_REG	 SYS_PIOB_IFDR; 	/* Input Filter Disable Register*/
	AT91_REG	 SYS_PIOB_IFSR; 	/* Input Filter Status Register*/
	AT91_REG	 Reserved31[1]; 	/* */
	AT91_REG	 SYS_PIOB_SODR; 	/* Set Output Data Register*/
	AT91_REG	 SYS_PIOB_CODR; 	/* Clear Output Data Register*/
	AT91_REG	 SYS_PIOB_ODSR; 	/* Output Data Status Register*/
	AT91_REG	 SYS_PIOB_PDSR; 	/* Pin Data Status Register*/
	AT91_REG	 SYS_PIOB_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 SYS_PIOB_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 SYS_PIOB_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 SYS_PIOB_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 SYS_PIOB_MDER; 	/* Multi-driver Enable Register*/
	AT91_REG	 SYS_PIOB_MDDR; 	/* Multi-driver Disable Register*/
	AT91_REG	 SYS_PIOB_MDSR; 	/* Multi-driver Status Register*/
	AT91_REG	 Reserved32[1]; 	/* */
	AT91_REG	 SYS_PIOB_PPUDR; 	/* Pull-up Disable Register*/
	AT91_REG	 SYS_PIOB_PPUER; 	/* Pull-up Enable Register*/
	AT91_REG	 SYS_PIOB_PPUSR; 	/* Pull-up Status Register*/
	AT91_REG	 Reserved33[1]; 	/* */
	AT91_REG	 SYS_PIOB_ASR; 	/* Select A Register*/
	AT91_REG	 SYS_PIOB_BSR; 	/* Select B Register*/
	AT91_REG	 SYS_PIOB_ABSR; 	/* AB Select Status Register*/
	AT91_REG	 Reserved34[9]; 	/* */
	AT91_REG	 SYS_PIOB_OWER; 	/* Output Write Enable Register*/
	AT91_REG	 SYS_PIOB_OWDR; 	/* Output Write Disable Register*/
	AT91_REG	 SYS_PIOB_OWSR; 	/* Output Write Status Register*/
	AT91_REG	 Reserved35[1]; 	/* */
	AT91_REG	 SYS_PIOB_SLEWRATE1; 	/* PIO Slewrate Control Register*/
	AT91_REG	 Reserved36[3]; 	/* */
	AT91_REG	 SYS_PIOB_DELAY1; 	/* PIO Delay Control Register*/
	AT91_REG	 SYS_PIOB_DELAY2; 	/* PIO Delay Control Register*/
	AT91_REG	 SYS_PIOB_DELAY3; 	/* PIO Delay Control Register*/
	AT91_REG	 SYS_PIOB_DELAY4; 	/* PIO Delay Control Register*/
	AT91_REG	 Reserved37[11]; 	/* */
	AT91_REG	 SYS_PIOB_VERSION; 	/* PIO Version Register*/
	AT91_REG	 Reserved38[64]; 	/* */
	AT91_REG	 SYS_PIOC_PER; 	/* PIO Enable Register*/
	AT91_REG	 SYS_PIOC_PDR; 	/* PIO Disable Register*/
	AT91_REG	 SYS_PIOC_PSR; 	/* PIO Status Register*/
	AT91_REG	 Reserved39[1]; 	/* */
	AT91_REG	 SYS_PIOC_OER; 	/* Output Enable Register*/
	AT91_REG	 SYS_PIOC_ODR; 	/* Output Disable Registerr*/
	AT91_REG	 SYS_PIOC_OSR; 	/* Output Status Register*/
	AT91_REG	 Reserved40[1]; 	/* */
	AT91_REG	 SYS_PIOC_IFER; 	/* Input Filter Enable Register*/
	AT91_REG	 SYS_PIOC_IFDR; 	/* Input Filter Disable Register*/
	AT91_REG	 SYS_PIOC_IFSR; 	/* Input Filter Status Register*/
	AT91_REG	 Reserved41[1]; 	/* */
	AT91_REG	 SYS_PIOC_SODR; 	/* Set Output Data Register*/
	AT91_REG	 SYS_PIOC_CODR; 	/* Clear Output Data Register*/
	AT91_REG	 SYS_PIOC_ODSR; 	/* Output Data Status Register*/
	AT91_REG	 SYS_PIOC_PDSR; 	/* Pin Data Status Register*/
	AT91_REG	 SYS_PIOC_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 SYS_PIOC_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 SYS_PIOC_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 SYS_PIOC_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 SYS_PIOC_MDER; 	/* Multi-driver Enable Register*/
	AT91_REG	 SYS_PIOC_MDDR; 	/* Multi-driver Disable Register*/
	AT91_REG	 SYS_PIOC_MDSR; 	/* Multi-driver Status Register*/
	AT91_REG	 Reserved42[1]; 	/* */
	AT91_REG	 SYS_PIOC_PPUDR; 	/* Pull-up Disable Register*/
	AT91_REG	 SYS_PIOC_PPUER; 	/* Pull-up Enable Register*/
	AT91_REG	 SYS_PIOC_PPUSR; 	/* Pull-up Status Register*/
	AT91_REG	 Reserved43[1]; 	/* */
	AT91_REG	 SYS_PIOC_ASR; 	/* Select A Register*/
	AT91_REG	 SYS_PIOC_BSR; 	/* Select B Register*/
	AT91_REG	 SYS_PIOC_ABSR; 	/* AB Select Status Register*/
	AT91_REG	 Reserved44[9]; 	/* */
	AT91_REG	 SYS_PIOC_OWER; 	/* Output Write Enable Register*/
	AT91_REG	 SYS_PIOC_OWDR; 	/* Output Write Disable Register*/
	AT91_REG	 SYS_PIOC_OWSR; 	/* Output Write Status Register*/
	AT91_REG	 Reserved45[1]; 	/* */
	AT91_REG	 SYS_PIOC_SLEWRATE1; 	/* PIO Slewrate Control Register*/
	AT91_REG	 Reserved46[3]; 	/* */
	AT91_REG	 SYS_PIOC_DELAY1; 	/* PIO Delay Control Register*/
	AT91_REG	 SYS_PIOC_DELAY2; 	/* PIO Delay Control Register*/
	AT91_REG	 SYS_PIOC_DELAY3; 	/* PIO Delay Control Register*/
	AT91_REG	 SYS_PIOC_DELAY4; 	/* PIO Delay Control Register*/
	AT91_REG	 Reserved47[11]; 	/* */
	AT91_REG	 SYS_PIOC_VERSION; 	/* PIO Version Register*/
	AT91_REG	 Reserved48[64]; 	/* */
	AT91_REG	 SYS_PIOD_PER; 	/* PIO Enable Register*/
	AT91_REG	 SYS_PIOD_PDR; 	/* PIO Disable Register*/
	AT91_REG	 SYS_PIOD_PSR; 	/* PIO Status Register*/
	AT91_REG	 Reserved49[1]; 	/* */
	AT91_REG	 SYS_PIOD_OER; 	/* Output Enable Register*/
	AT91_REG	 SYS_PIOD_ODR; 	/* Output Disable Registerr*/
	AT91_REG	 SYS_PIOD_OSR; 	/* Output Status Register*/
	AT91_REG	 Reserved50[1]; 	/* */
	AT91_REG	 SYS_PIOD_IFER; 	/* Input Filter Enable Register*/
	AT91_REG	 SYS_PIOD_IFDR; 	/* Input Filter Disable Register*/
	AT91_REG	 SYS_PIOD_IFSR; 	/* Input Filter Status Register*/
	AT91_REG	 Reserved51[1]; 	/* */
	AT91_REG	 SYS_PIOD_SODR; 	/* Set Output Data Register*/
	AT91_REG	 SYS_PIOD_CODR; 	/* Clear Output Data Register*/
	AT91_REG	 SYS_PIOD_ODSR; 	/* Output Data Status Register*/
	AT91_REG	 SYS_PIOD_PDSR; 	/* Pin Data Status Register*/
	AT91_REG	 SYS_PIOD_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 SYS_PIOD_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 SYS_PIOD_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 SYS_PIOD_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 SYS_PIOD_MDER; 	/* Multi-driver Enable Register*/
	AT91_REG	 SYS_PIOD_MDDR; 	/* Multi-driver Disable Register*/
	AT91_REG	 SYS_PIOD_MDSR; 	/* Multi-driver Status Register*/
	AT91_REG	 Reserved52[1]; 	/* */
	AT91_REG	 SYS_PIOD_PPUDR; 	/* Pull-up Disable Register*/
	AT91_REG	 SYS_PIOD_PPUER; 	/* Pull-up Enable Register*/
	AT91_REG	 SYS_PIOD_PPUSR; 	/* Pull-up Status Register*/
	AT91_REG	 Reserved53[1]; 	/* */
	AT91_REG	 SYS_PIOD_ASR; 	/* Select A Register*/
	AT91_REG	 SYS_PIOD_BSR; 	/* Select B Register*/
	AT91_REG	 SYS_PIOD_ABSR; 	/* AB Select Status Register*/
	AT91_REG	 Reserved54[9]; 	/* */
	AT91_REG	 SYS_PIOD_OWER; 	/* Output Write Enable Register*/
	AT91_REG	 SYS_PIOD_OWDR; 	/* Output Write Disable Register*/
	AT91_REG	 SYS_PIOD_OWSR; 	/* Output Write Status Register*/
	AT91_REG	 Reserved55[1]; 	/* */
	AT91_REG	 SYS_PIOD_SLEWRATE1; 	/* PIO Slewrate Control Register*/
	AT91_REG	 Reserved56[3]; 	/* */
	AT91_REG	 SYS_PIOD_DELAY1; 	/* PIO Delay Control Register*/
	AT91_REG	 SYS_PIOD_DELAY2; 	/* PIO Delay Control Register*/
	AT91_REG	 SYS_PIOD_DELAY3; 	/* PIO Delay Control Register*/
	AT91_REG	 SYS_PIOD_DELAY4; 	/* PIO Delay Control Register*/
	AT91_REG	 Reserved57[11]; 	/* */
	AT91_REG	 SYS_PIOD_VERSION; 	/* PIO Version Register*/
	AT91_REG	 Reserved58[64]; 	/* */
	AT91_REG	 SYS_PIOE_PER; 	/* PIO Enable Register*/
	AT91_REG	 SYS_PIOE_PDR; 	/* PIO Disable Register*/
	AT91_REG	 SYS_PIOE_PSR; 	/* PIO Status Register*/
	AT91_REG	 Reserved59[1]; 	/* */
	AT91_REG	 SYS_PIOE_OER; 	/* Output Enable Register*/
	AT91_REG	 SYS_PIOE_ODR; 	/* Output Disable Registerr*/
	AT91_REG	 SYS_PIOE_OSR; 	/* Output Status Register*/
	AT91_REG	 Reserved60[1]; 	/* */
	AT91_REG	 SYS_PIOE_IFER; 	/* Input Filter Enable Register*/
	AT91_REG	 SYS_PIOE_IFDR; 	/* Input Filter Disable Register*/
	AT91_REG	 SYS_PIOE_IFSR; 	/* Input Filter Status Register*/
	AT91_REG	 Reserved61[1]; 	/* */
	AT91_REG	 SYS_PIOE_SODR; 	/* Set Output Data Register*/
	AT91_REG	 SYS_PIOE_CODR; 	/* Clear Output Data Register*/
	AT91_REG	 SYS_PIOE_ODSR; 	/* Output Data Status Register*/
	AT91_REG	 SYS_PIOE_PDSR; 	/* Pin Data Status Register*/
	AT91_REG	 SYS_PIOE_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 SYS_PIOE_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 SYS_PIOE_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 SYS_PIOE_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 SYS_PIOE_MDER; 	/* Multi-driver Enable Register*/
	AT91_REG	 SYS_PIOE_MDDR; 	/* Multi-driver Disable Register*/
	AT91_REG	 SYS_PIOE_MDSR; 	/* Multi-driver Status Register*/
	AT91_REG	 Reserved62[1]; 	/* */
	AT91_REG	 SYS_PIOE_PPUDR; 	/* Pull-up Disable Register*/
	AT91_REG	 SYS_PIOE_PPUER; 	/* Pull-up Enable Register*/
	AT91_REG	 SYS_PIOE_PPUSR; 	/* Pull-up Status Register*/
	AT91_REG	 Reserved63[1]; 	/* */
	AT91_REG	 SYS_PIOE_ASR; 	/* Select A Register*/
	AT91_REG	 SYS_PIOE_BSR; 	/* Select B Register*/
	AT91_REG	 SYS_PIOE_ABSR; 	/* AB Select Status Register*/
	AT91_REG	 Reserved64[9]; 	/* */
	AT91_REG	 SYS_PIOE_OWER; 	/* Output Write Enable Register*/
	AT91_REG	 SYS_PIOE_OWDR; 	/* Output Write Disable Register*/
	AT91_REG	 SYS_PIOE_OWSR; 	/* Output Write Status Register*/
	AT91_REG	 Reserved65[1]; 	/* */
	AT91_REG	 SYS_PIOE_SLEWRATE1; 	/* PIO Slewrate Control Register*/
	AT91_REG	 Reserved66[3]; 	/* */
	AT91_REG	 SYS_PIOE_DELAY1; 	/* PIO Delay Control Register*/
	AT91_REG	 SYS_PIOE_DELAY2; 	/* PIO Delay Control Register*/
	AT91_REG	 SYS_PIOE_DELAY3; 	/* PIO Delay Control Register*/
	AT91_REG	 SYS_PIOE_DELAY4; 	/* PIO Delay Control Register*/
	AT91_REG	 Reserved67[11]; 	/* */
	AT91_REG	 SYS_PIOE_VERSION; 	/* PIO Version Register*/
	AT91_REG	 Reserved68[64]; 	/* */
	AT91_REG	 SYS_PMC_SCER; 	/* System Clock Enable Register*/
	AT91_REG	 SYS_PMC_SCDR; 	/* System Clock Disable Register*/
	AT91_REG	 SYS_PMC_SCSR; 	/* System Clock Status Register*/
	AT91_REG	 Reserved69[1]; 	/* */
	AT91_REG	 SYS_PMC_PCER; 	/* Peripheral Clock Enable Register*/
	AT91_REG	 SYS_PMC_PCDR; 	/* Peripheral Clock Disable Register*/
	AT91_REG	 SYS_PMC_PCSR; 	/* Peripheral Clock Status Register*/
	AT91_REG	 SYS_PMC_UCKR; 	/* UTMI Clock Configuration Register*/
	AT91_REG	 SYS_PMC_MOR; 	/* Main Oscillator Register*/
	AT91_REG	 SYS_PMC_MCFR; 	/* Main Clock  Frequency Register*/
	AT91_REG	 SYS_PMC_PLLAR; 	/* PLL A Register*/
	AT91_REG	 SYS_PMC_PLLBR; 	/* PLL B Register*/
	AT91_REG	 SYS_PMC_MCKR; 	/* Master Clock Register*/
	AT91_REG	 Reserved70[3]; 	/* */
	AT91_REG	 SYS_PMC_PCKR[8]; 	/* Programmable Clock Register*/
	AT91_REG	 SYS_PMC_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 SYS_PMC_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 SYS_PMC_SR; 	/* Status Register*/
	AT91_REG	 SYS_PMC_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 Reserved71[36]; 	/* */
	AT91_REG	 SYS_RSTC_RCR; 	/* Reset Control Register*/
	AT91_REG	 SYS_RSTC_RSR; 	/* Reset Status Register*/
	AT91_REG	 SYS_RSTC_RMR; 	/* Reset Mode Register*/
	AT91_REG	 Reserved72[1]; 	/* */
	AT91_REG	 SYS_SHDWC_SHCR; 	/* Shut Down Control Register*/
	AT91_REG	 SYS_SHDWC_SHMR; 	/* Shut Down Mode Register*/
	AT91_REG	 SYS_SHDWC_SHSR; 	/* Shut Down Status Register*/
	AT91_REG	 Reserved73[1]; 	/* */
	AT91_REG	 SYS_RTTC_RTMR; 	/* Real-time Mode Register*/
	AT91_REG	 SYS_RTTC_RTAR; 	/* Real-time Alarm Register*/
	AT91_REG	 SYS_RTTC_RTVR; 	/* Real-time Value Register*/
	AT91_REG	 SYS_RTTC_RTSR; 	/* Real-time Status Register*/
	AT91_REG	 SYS_PITC_PIMR; 	/* Period Interval Mode Register*/
	AT91_REG	 SYS_PITC_PISR; 	/* Period Interval Status Register*/
	AT91_REG	 SYS_PITC_PIVR; 	/* Period Interval Value Register*/
	AT91_REG	 SYS_PITC_PIIR; 	/* Period Interval Image Register*/
	AT91_REG	 SYS_WDTC_WDCR; 	/* Watchdog Control Register*/
	AT91_REG	 SYS_WDTC_WDMR; 	/* Watchdog Mode Register*/
	AT91_REG	 SYS_WDTC_WDSR; 	/* Watchdog Status Register*/
	AT91_REG	 Reserved74[1]; 	/* */
	AT91_REG	 SYS_SLCKSEL; 	/* Slow Clock Selection Register*/
	AT91_REG	 Reserved75[3]; 	/* */
	AT91_REG	 SYS_GPBR[4]; 	/* General Purpose Register*/
} AT91S_SYS, *AT91PS_SYS;

/* -------- SLCKSEL : (SYS Offset: 0x1b50) Slow Clock Selection Register -------- */
#define AT91C_SLCKSEL_RCEN    ((unsigned int) 0x1 <<  0) /* (SYS) Enable Internal RC Oscillator*/
#define AT91C_SLCKSEL_OSC32EN ((unsigned int) 0x1 <<  1) /* (SYS) Enable External Oscillator*/
#define AT91C_SLCKSEL_OSC32BYP ((unsigned int) 0x1 <<  2) /* (SYS) Bypass External Oscillator*/
#define AT91C_SLCKSEL_OSCSEL  ((unsigned int) 0x1 <<  3) /* (SYS) OSC Selection*/
/* -------- GPBR : (SYS Offset: 0x1b60) GPBR General Purpose Register -------- */
#define AT91C_GPBR_GPRV       ((unsigned int) 0x0 <<  0) /* (SYS) General Purpose Register Value*/

