una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91cap9.h
/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR USB Host Interface*/
/* ******************************************************************************/
typedef struct _AT91S_UHP {
	AT91_REG	 UHP_HcRevision; 	/* Revision*/
	AT91_REG	 UHP_HcControl; 	/* Operating modes for the Host Controller*/
	AT91_REG	 UHP_HcCommandStatus; 	/* Command & status Register*/
	AT91_REG	 UHP_HcInterruptStatus; 	/* Interrupt Status Register*/
	AT91_REG	 UHP_HcInterruptEnable; 	/* Interrupt Enable Register*/
	AT91_REG	 UHP_HcInterruptDisable; 	/* Interrupt Disable Register*/
	AT91_REG	 UHP_HcHCCA; 	/* Pointer to the Host Controller Communication Area*/
	AT91_REG	 UHP_HcPeriodCurrentED; 	/* Current Isochronous or Interrupt Endpoint Descriptor*/
	AT91_REG	 UHP_HcControlHeadED; 	/* First Endpoint Descriptor of the Control list*/
	AT91_REG	 UHP_HcControlCurrentED; 	/* Endpoint Control and Status Register*/
	AT91_REG	 UHP_HcBulkHeadED; 	/* First endpoint register of the Bulk list*/
	AT91_REG	 UHP_HcBulkCurrentED; 	/* Current endpoint of the Bulk list*/
	AT91_REG	 UHP_HcBulkDoneHead; 	/* Last completed transfer descriptor*/
	AT91_REG	 UHP_HcFmInterval; 	/* Bit time between 2 consecutive SOFs*/
	AT91_REG	 UHP_HcFmRemaining; 	/* Bit time remaining in the current Frame*/
	AT91_REG	 UHP_HcFmNumber; 	/* Frame number*/
	AT91_REG	 UHP_HcPeriodicStart; 	/* Periodic Start*/
	AT91_REG	 UHP_HcLSThreshold; 	/* LS Threshold*/
	AT91_REG	 UHP_HcRhDescriptorA; 	/* Root Hub characteristics A*/
	AT91_REG	 UHP_HcRhDescriptorB; 	/* Root Hub characteristics B*/
	AT91_REG	 UHP_HcRhStatus; 	/* Root Hub Status register*/
	AT91_REG	 UHP_HcRhPortStatus[2]; 	/* Root Hub Port Status Register*/
} AT91S_UHP, *AT91PS_UHP;


/* ******************************************************************************/
/*               REGISTER ADDRESS DEFINITION FOR AT91CAP9_UMC*/
/* ******************************************************************************/
/* ========== Register definition for HECC peripheral ========== */
#define AT91C_HECC_VR   ((AT91_REG *) 	0xFFFFE2FC) /* (HECC)  ECC Version register*/
#define AT91C_HECC_SR   ((AT91_REG *) 	0xFFFFE208) /* (HECC)  ECC Status register*/
#define AT91C_HECC_CR   ((AT91_REG *) 	0xFFFFE200) /* (HECC)  ECC reset register*/
#define AT91C_HECC_NPR  ((AT91_REG *) 	0xFFFFE210) /* (HECC)  ECC Parity N register*/
#define AT91C_HECC_PR   ((AT91_REG *) 	0xFFFFE20C) /* (HECC)  ECC Parity register*/
#define AT91C_HECC_MR   ((AT91_REG *) 	0xFFFFE204) /* (HECC)  ECC Page size register*/
/* ========== Register definition for BCRAMC peripheral ========== */
#define AT91C_BCRAMC_IPNR1 ((AT91_REG *) 	0xFFFFE4F0) /* (BCRAMC) BCRAM IP Name Register 1*/
#define AT91C_BCRAMC_HSR ((AT91_REG *) 	0xFFFFE408) /* (BCRAMC) BCRAM Controller High Speed Register*/
#define AT91C_BCRAMC_CR ((AT91_REG *) 	0xFFFFE400) /* (BCRAMC) BCRAM Controller Configuration Register*/
#define AT91C_BCRAMC_TPR ((AT91_REG *) 	0xFFFFE404) /* (BCRAMC) BCRAM Controller Timing Parameter Register*/
#define AT91C_BCRAMC_LPR ((AT91_REG *) 	0xFFFFE40C) /* (BCRAMC) BCRAM Controller Low Power Register*/
#define AT91C_BCRAMC_IPNR2 ((AT91_REG *) 	0xFFFFE4F4) /* (BCRAMC) BCRAM IP Name Register 2*/
#define AT91C_BCRAMC_IPFR ((AT91_REG *) 	0xFFFFE4F8) /* (BCRAMC) BCRAM IP Features Register*/
#define AT91C_BCRAMC_VR ((AT91_REG *) 	0xFFFFE4FC) /* (BCRAMC) BCRAM Version Register*/
#define AT91C_BCRAMC_MDR ((AT91_REG *) 	0xFFFFE410) /* (BCRAMC) BCRAM Memory Device Register*/
#define AT91C_BCRAMC_PADDSR ((AT91_REG *) 	0xFFFFE4EC) /* (BCRAMC) BCRAM PADDR Size Register*/
/* ========== Register definition for SDDRC peripheral ========== */
#define AT91C_SDDRC_RTR ((AT91_REG *) 	0xFFFFE604) /* (SDDRC) */
#define AT91C_SDDRC_T0PR ((AT91_REG *) 	0xFFFFE60C) /* (SDDRC) */
#define AT91C_SDDRC_MDR ((AT91_REG *) 	0xFFFFE61C) /* (SDDRC) */
#define AT91C_SDDRC_HS  ((AT91_REG *) 	0xFFFFE614) /* (SDDRC) */
#define AT91C_SDDRC_VERSION ((AT91_REG *) 	0xFFFFE6FC) /* (SDDRC) */
#define AT91C_SDDRC_MR  ((AT91_REG *) 	0xFFFFE600) /* (SDDRC) */
#define AT91C_SDDRC_T1PR ((AT91_REG *) 	0xFFFFE610) /* (SDDRC) */
#define AT91C_SDDRC_CR  ((AT91_REG *) 	0xFFFFE608) /* (SDDRC) */
#define AT91C_SDDRC_LPR ((AT91_REG *) 	0xFFFFE618) /* (SDDRC) */
/* ========== Register definition for SMC peripheral ========== */
#define AT91C_SMC_PULSE7 ((AT91_REG *) 	0xFFFFE874) /* (SMC)  Pulse Register for CS 7*/
#define AT91C_SMC_DELAY1 ((AT91_REG *) 	0xFFFFE8C0) /* (SMC) SMC Delay Control Register*/
#define AT91C_SMC_CYCLE2 ((AT91_REG *) 	0xFFFFE828) /* (SMC)  Cycle Register for CS 2*/
#define AT91C_SMC_DELAY5 ((AT91_REG *) 	0xFFFFE8D0) /* (SMC) SMC Delay Control Register*/
#define AT91C_SMC_DELAY6 ((AT91_REG *) 	0xFFFFE8D4) /* (SMC) SMC Delay Control Register*/
#define AT91C_SMC_PULSE2 ((AT91_REG *) 	0xFFFFE824) /* (SMC)  Pulse Register for CS 2*/
#define AT91C_SMC_SETUP6 ((AT91_REG *) 	0xFFFFE860) /* (SMC)  Setup Register for CS 6*/
#define AT91C_SMC_SETUP5 ((AT91_REG *) 	0xFFFFE850) /* (SMC)  Setup Register for CS 5*/
#define AT91C_SMC_CYCLE6 ((AT91_REG *) 	0xFFFFE868) /* (SMC)  Cycle Register for CS 6*/
#define AT91C_SMC_PULSE6 ((AT91_REG *) 	0xFFFFE864) /* (SMC)  Pulse Register for CS 6*/
#define AT91C_SMC_CTRL5 ((AT91_REG *) 	0xFFFFE85C) /* (SMC)  Control Register for CS 5*/
#define AT91C_SMC_CTRL3 ((AT91_REG *) 	0xFFFFE83C) /* (SMC)  Control Register for CS 3*/
#define AT91C_SMC_DELAY7 ((AT91_REG *) 	0xFFFFE8D8) /* (SMC) SMC Delay Control Register*/
#define AT91C_SMC_DELAY3 ((AT91_REG *) 	0xFFFFE8C8) /* (SMC) SMC Delay Control Register*/
#define AT91C_SMC_CYCLE0 ((AT91_REG *) 	0xFFFFE808) /* (SMC)  Cycle Register for CS 0*/
#define AT91C_SMC_SETUP1 ((AT91_REG *) 	0xFFFFE810) /* (SMC)  Setup Register for CS 1*/
#define AT91C_SMC_PULSE5 ((AT91_REG *) 	0xFFFFE854) /* (SMC)  Pulse Register for CS 5*/
#define AT91C_SMC_SETUP7 ((AT91_REG *) 	0xFFFFE870) /* (SMC)  Setup Register for CS 7*/
#define AT91C_SMC_CTRL4 ((AT91_REG *) 	0xFFFFE84C) /* (SMC)  Control Register for CS 4*/
#define AT91C_SMC_DELAY2 ((AT91_REG *) 	0xFFFFE8C4) /* (SMC) SMC Delay Control Register*/
#define AT91C_SMC_PULSE3 ((AT91_REG *) 	0xFFFFE834) /* (SMC)  Pulse Register for CS 3*/
#define AT91C_SMC_CYCLE4 ((AT91_REG *) 	0xFFFFE848) /* (SMC)  Cycle Register for CS 4*/
#define AT91C_SMC_CTRL1 ((AT91_REG *) 	0xFFFFE81C) /* (SMC)  Control Register for CS 1*/
#define AT91C_SMC_SETUP3 ((AT91_REG *) 	0xFFFFE830) /* (SMC)  Setup Register for CS 3*/
#define AT91C_SMC_CTRL0 ((AT91_REG *) 	0xFFFFE80C) /* (SMC)  Control Register for CS 0*/
#define AT91C_SMC_CYCLE7 ((AT91_REG *) 	0xFFFFE878) /* (SMC)  Cycle Register for CS 7*/
#define AT91C_SMC_DELAY4 ((AT91_REG *) 	0xFFFFE8CC) /* (SMC) SMC Delay Control Register*/
#define AT91C_SMC_CYCLE1 ((AT91_REG *) 	0xFFFFE818) /* (SMC)  Cycle Register for CS 1*/
#define AT91C_SMC_SETUP2 ((AT91_REG *) 	0xFFFFE820) /* (SMC)  Setup Register for CS 2*/
#define AT91C_SMC_PULSE1 ((AT91_REG *) 	0xFFFFE814) /* (SMC)  Pulse Register for CS 1*/
#define AT91C_SMC_DELAY8 ((AT91_REG *) 	0xFFFFE8DC) /* (SMC) SMC Delay Control Register*/
#define AT91C_SMC_CTRL2 ((AT91_REG *) 	0xFFFFE82C) /* (SMC)  Control Register for CS 2*/
#define AT91C_SMC_PULSE4 ((AT91_REG *) 	0xFFFFE844) /* (SMC)  Pulse Register for CS 4*/
#define AT91C_SMC_SETUP4 ((AT91_REG *) 	0xFFFFE840) /* (SMC)  Setup Register for CS 4*/
#define AT91C_SMC_CYCLE3 ((AT91_REG *) 	0xFFFFE838) /* (SMC)  Cycle Register for CS 3*/
#define AT91C_SMC_SETUP0 ((AT91_REG *) 	0xFFFFE800) /* (SMC)  Setup Register for CS 0*/
#define AT91C_SMC_CYCLE5 ((AT91_REG *) 	0xFFFFE858) /* (SMC)  Cycle Register for CS 5*/
#define AT91C_SMC_PULSE0 ((AT91_REG *) 	0xFFFFE804) /* (SMC)  Pulse Register for CS 0*/
#define AT91C_SMC_CTRL6 ((AT91_REG *) 	0xFFFFE86C) /* (SMC)  Control Register for CS 6*/
#define AT91C_SMC_CTRL7 ((AT91_REG *) 	0xFFFFE87C) /* (SMC)  Control Register for CS 7*/
/* ========== Register definition for MATRIX_PRS peripheral ========== */
#define AT91C_MATRIX_PRS_PRAS ((AT91_REG *) 	0xFFFFEA80) /* (MATRIX_PRS)  Slave Priority Registers A for Slave*/
#define AT91C_MATRIX_PRS_PRBS ((AT91_REG *) 	0xFFFFEA84) /* (MATRIX_PRS)  Slave Priority Registers B for Slave*/
/* ========== Register definition for MATRIX peripheral ========== */
#define AT91C_MATRIX_MCFG ((AT91_REG *) 	0xFFFFEA00) /* (MATRIX)  Master Configuration Register */
#define AT91C_MATRIX_MRCR ((AT91_REG *) 	0xFFFFEB00) /* (MATRIX)  Master Remp Control Register */
#define AT91C_MATRIX_SCFG ((AT91_REG *) 	0xFFFFEA40) /* (MATRIX)  Slave Configuration Register */
/* ========== Register definition for CCFG peripheral ========== */
#define AT91C_CCFG_RAM  ((AT91_REG *) 	0xFFFFEB10) /* (CCFG)  Slave 0 (Ram) Special Function Register*/
#define AT91C_CCFG_MPBS1 ((AT91_REG *) 	0xFFFFEB1C) /* (CCFG)  Slave 3 (MP Block Slave 1) Special Function Register*/
#define AT91C_CCFG_BRIDGE ((AT91_REG *) 	0xFFFFEB34) /* (CCFG)  Slave 8 (APB Bridge) Special Function Register*/
#define AT91C_CCFG_HDDRC2 ((AT91_REG *) 	0xFFFFEB24) /* (CCFG)  Slave 5 (DDRC Port 2) Special Function Register*/
#define AT91C_CCFG_MPBS3 ((AT91_REG *) 	0xFFFFEB30) /* (CCFG)  Slave 7 (MP Block Slave 3) Special Function Register*/
#define AT91C_CCFG_MPBS2 ((AT91_REG *) 	0xFFFFEB2C) /* (CCFG)  Slave 7 (MP Block Slave 2) Special Function Register*/
#define AT91C_CCFG_UDPHS ((AT91_REG *) 	0xFFFFEB18) /* (CCFG)  Slave 2 (AHB Periphs) Special Function Register*/
#define AT91C_CCFG_HDDRC3 ((AT91_REG *) 	0xFFFFEB28) /* (CCFG)  Slave 6 (DDRC Port 3) Special Function Register*/
#define AT91C_CCFG_EBICSA ((AT91_REG *) 	0xFFFFEB20) /* (CCFG)  EBI Chip Select Assignement Register*/
#define AT91C_CCFG_MATRIXVERSION ((AT91_REG *) 	0xFFFFEBFC) /* (CCFG)  Version Register*/
#define AT91C_CCFG_MPBS0 ((AT91_REG *) 	0xFFFFEB14) /* (CCFG)  Slave 1 (MP Block Slave 0) Special Function Register*/
/* ========== Register definition for PDC_DBGU peripheral ========== */
#define AT91C_DBGU_PTCR ((AT91_REG *) 	0xFFFFEF20) /* (PDC_DBGU) PDC Transfer Control Register*/
#define AT91C_DBGU_RCR  ((AT91_REG *) 	0xFFFFEF04) /* (PDC_DBGU) Receive Counter Register*/
#define AT91C_DBGU_TCR  ((AT91_REG *) 	0xFFFFEF0C) /* (PDC_DBGU) Transmit Counter Register*/
#define AT91C_DBGU_RNCR ((AT91_REG *) 	0xFFFFEF14) /* (PDC_DBGU) Receive Next Counter Register*/
#define AT91C_DBGU_TNPR ((AT91_REG *) 	0xFFFFEF18) /* (PDC_DBGU) Transmit Next Pointer Register*/
#define AT91C_DBGU_RNPR ((AT91_REG *) 	0xFFFFEF10) /* (PDC_DBGU) Receive Next Pointer Register*/
#define AT91C_DBGU_PTSR ((AT91_REG *) 	0xFFFFEF24) /* (PDC_DBGU) PDC Transfer Status Register*/
#define AT91C_DBGU_RPR  ((AT91_REG *) 	0xFFFFEF00) /* (PDC_DBGU) Receive Pointer Register*/
#define AT91C_DBGU_TPR  ((AT91_REG *) 	0xFFFFEF08) /* (PDC_DBGU) Transmit Pointer Register*/
#define AT91C_DBGU_TNCR ((AT91_REG *) 	0xFFFFEF1C) /* (PDC_DBGU) Transmit Next Counter Register*/
/* ========== Register definition for DBGU peripheral ========== */
#define AT91C_DBGU_BRGR ((AT91_REG *) 	0xFFFFEE20) /* (DBGU) Baud Rate Generator Register*/
#define AT91C_DBGU_CR   ((AT91_REG *) 	0xFFFFEE00) /* (DBGU) Control Register*/
#define AT91C_DBGU_THR  ((AT91_REG *) 	0xFFFFEE1C) /* (DBGU) Transmitter Holding Register*/
#define AT91C_DBGU_IDR  ((AT91_REG *) 	0xFFFFEE0C) /* (DBGU) Interrupt Disable Register*/
#define AT91C_DBGU_EXID ((AT91_REG *) 	0xFFFFEE44) /* (DBGU) Chip ID Extension Register*/
#define AT91C_DBGU_IMR  ((AT91_REG *) 	0xFFFFEE10) /* (DBGU) Interrupt Mask Register*/
#define AT91C_DBGU_FNTR ((AT91_REG *) 	0xFFFFEE48) /* (DBGU) Force NTRST Register*/
#define AT91C_DBGU_IER  ((AT91_REG *) 	0xFFFFEE08) /* (DBGU) Interrupt Enable Register*/
#define AT91C_DBGU_CSR  ((AT91_REG *) 	0xFFFFEE14) /* (DBGU) Channel Status Register*/
#define AT91C_DBGU_MR   ((AT91_REG *) 	0xFFFFEE04) /* (DBGU) Mode Register*/
#define AT91C_DBGU_RHR  ((AT91_REG *) 	0xFFFFEE18) /* (DBGU) Receiver Holding Register*/
#define AT91C_DBGU_CIDR ((AT91_REG *) 	0xFFFFEE40) /* (DBGU) Chip ID Register*/
/* ========== Register definition for AIC peripheral ========== */
#define AT91C_AIC_IVR   ((AT91_REG *) 	0xFFFFF100) /* (AIC) IRQ Vector Register*/
#define AT91C_AIC_SMR   ((AT91_REG *) 	0xFFFFF000) /* (AIC) Source Mode Register*/
#define AT91C_AIC_FVR   ((AT91_REG *) 	0xFFFFF104) /* (AIC) FIQ Vector Register*/
#define AT91C_AIC_DCR   ((AT91_REG *) 	0xFFFFF138) /* (AIC) Debug Control Register (Protect)*/
#define AT91C_AIC_EOICR ((AT91_REG *) 	0xFFFFF130) /* (AIC) End of Interrupt Command Register*/
#define AT91C_AIC_SVR   ((AT91_REG *) 	0xFFFFF080) /* (AIC) Source Vector Register*/
#define AT91C_AIC_FFSR  ((AT91_REG *) 	0xFFFFF148) /* (AIC) Fast Forcing Status Register*/
#define AT91C_AIC_ICCR  ((AT91_REG *) 	0xFFFFF128) /* (AIC) Interrupt Clear Command Register*/
#define AT91C_AIC_ISR   ((AT91_REG *) 	0xFFFFF108) /* (AIC) Interrupt Status Register*/
#define AT91C_AIC_IMR   ((AT91_REG *) 	0xFFFFF110) /* (AIC) Interrupt Mask Register*/
#define AT91C_AIC_IPR   ((AT91_REG *) 	0xFFFFF10C) /* (AIC) Interrupt Pending Register*/
#define AT91C_AIC_FFER  ((AT91_REG *) 	0xFFFFF140) /* (AIC) Fast Forcing Enable Register*/
#define AT91C_AIC_IECR  ((AT91_REG *) 	0xFFFFF120) /* (AIC) Interrupt Enable Command Register*/
#define AT91C_AIC_ISCR  ((AT91_REG *) 	0xFFFFF12C) /* (AIC) Interrupt Set Command Register*/
#define AT91C_AIC_FFDR  ((AT91_REG *) 	0xFFFFF144) /* (AIC) Fast Forcing Disable Register*/
#define AT91C_AIC_CISR  ((AT91_REG *) 	0xFFFFF114) /* (AIC) Core Interrupt Status Register*/
#define AT91C_AIC_IDCR  ((AT91_REG *) 	0xFFFFF124) /* (AIC) Interrupt Disable Command Register*/
#define AT91C_AIC_SPU   ((AT91_REG *) 	0xFFFFF134) /* (AIC) Spurious Vector Register*/
/* ========== Register definition for PIOA peripheral ========== */
#define AT91C_PIOA_OWDR ((AT91_REG *) 	0xFFFFF2A4) /* (PIOA) Output Write Disable Register*/
#define AT91C_PIOA_DELAY3 ((AT91_REG *) 	0xFFFFF2C8) /* (PIOA) PIO Delay Control Register*/
#define AT91C_PIOA_ISR  ((AT91_REG *) 	0xFFFFF24C) /* (PIOA) Interrupt Status Register*/
#define AT91C_PIOA_PDR  ((AT91_REG *) 	0xFFFFF204) /* (PIOA) PIO Disable Register*/
#define AT91C_PIOA_OSR  ((AT91_REG *) 	0xFFFFF218) /* (PIOA) Output Status Register*/
#define AT91C_PIOA_ABSR ((AT91_REG *) 	0xFFFFF278) /* (PIOA) AB Select Status Register*/
#define AT91C_PIOA_DELAY2 ((AT91_REG *) 	0xFFFFF2C4) /* (PIOA) PIO Delay Control Register*/
#define AT91C_PIOA_PDSR ((AT91_REG *) 	0xFFFFF23C) /* (PIOA) Pin Data Status Register*/
#define AT91C_PIOA_BSR  ((AT91_REG *) 	0xFFFFF274) /* (PIOA) Select B Register*/
#define AT91C_PIOA_DELAY1 ((AT91_REG *) 	0xFFFFF2C0) /* (PIOA) PIO Delay Control Register*/
#define AT91C_PIOA_PPUER ((AT91_REG *) 	0xFFFFF264) /* (PIOA) Pull-up Enable Register*/
#define AT91C_PIOA_OER  ((AT91_REG *) 	0xFFFFF210) /* (PIOA) Output Enable Register*/
#define AT91C_PIOA_PER  ((AT91_REG *) 	0xFFFFF200) /* (PIOA) PIO Enable Register*/
#define AT91C_PIOA_VERSION ((AT91_REG *) 	0xFFFFF2FC) /* (PIOA) PIO Version Register*/
#define AT91C_PIOA_PPUDR ((AT91_REG *) 	0xFFFFF260) /* (PIOA) Pull-up Disable Register*/
#define AT91C_PIOA_ODSR ((AT91_REG *) 	0xFFFFF238) /* (PIOA) Output Data Status Register*/
#define AT91C_PIOA_SLEWRATE1 ((AT91_REG *) 	0xFFFFF2B0) /* (PIOA) PIO Slewrate Control Register*/
#define AT91C_PIOA_MDDR ((AT91_REG *) 	0xFFFFF254) /* (PIOA) Multi-driver Disable Register*/
#define AT91C_PIOA_IFSR ((AT91_REG *) 	0xFFFFF228) /* (PIOA) Input Filter Status Register*/
#define AT91C_PIOA_CODR ((AT91_REG *) 	0xFFFFF234) /* (PIOA) Clear Output Data Register*/
#define AT91C_PIOA_ASR  ((AT91_REG *) 	0xFFFFF270) /* (PIOA) Select A Register*/
#define AT91C_PIOA_OWSR ((AT91_REG *) 	0xFFFFF2A8) /* (PIOA) Output Write Status Register*/
#define AT91C_PIOA_IMR  ((AT91_REG *) 	0xFFFFF248) /* (PIOA) Interrupt Mask Register*/
#define AT91C_PIOA_PPUSR ((AT91_REG *) 	0xFFFFF268) /* (PIOA) Pull-up Status Register*/
#define AT91C_PIOA_MDER ((AT91_REG *) 	0xFFFFF250) /* (PIOA) Multi-driver Enable Register*/
#define AT91C_PIOA_IFDR ((AT91_REG *) 	0xFFFFF224) /* (PIOA) Input Filter Disable Register*/
#define AT91C_PIOA_SODR ((AT91_REG *) 	0xFFFFF230) /* (PIOA) Set Output Data Register*/
#define AT91C_PIOA_OWER ((AT91_REG *) 	0xFFFFF2A0) /* (PIOA) Output Write Enable Register*/
#define AT91C_PIOA_IDR  ((AT91_REG *) 	0xFFFFF244) /* (PIOA) Interrupt Disable Register*/
#define AT91C_PIOA_IFER ((AT91_REG *) 	0xFFFFF220) /* (PIOA) Input Filter Enable Register*/
#define AT91C_PIOA_IER  ((AT91_REG *) 	0xFFFFF240) /* (PIOA) Interrupt Enable Register*/
#define AT91C_PIOA_ODR  ((AT91_REG *) 	0xFFFFF214) /* (PIOA) Output Disable Registerr*/
#define AT91C_PIOA_MDSR ((AT91_REG *) 	0xFFFFF258) /* (PIOA) Multi-driver Status Register*/
#define AT91C_PIOA_DELAY4 ((AT91_REG *) 	0xFFFFF2CC) /* (PIOA) PIO Delay Control Register*/
#define AT91C_PIOA_PSR  ((AT91_REG *) 	0xFFFFF208) /* (PIOA) PIO Status Register*/
/* ========== Register definition for PIOB peripheral ========== */
#define AT91C_PIOB_ODR  ((AT91_REG *) 	0xFFFFF414) /* (PIOB) Output Disable Registerr*/
#define AT91C_PIOB_DELAY4 ((AT91_REG *) 	0xFFFFF4CC) /* (PIOB) PIO Delay Control Register*/
#define AT91C_PIOB_SODR ((AT91_REG *) 	0xFFFFF430) /* (PIOB) Set Output Data Register*/
#define AT91C_PIOB_ISR  ((AT91_REG *) 	0xFFFFF44C) /* (PIOB) Interrupt Status Register*/
#define AT91C_PIOB_ABSR ((AT91_REG *) 	0xFFFFF478) /* (PIOB) AB Select Status Register*/
#define AT91C_PIOB_IMR  ((AT91_REG *) 	0xFFFFF448) /* (PIOB) Interrupt Mask Register*/
#define AT91C_PIOB_MDSR ((AT91_REG *) 	0xFFFFF458) /* (PIOB) Multi-driver Status Register*/
#define AT91C_PIOB_PPUSR ((AT91_REG *) 	0xFFFFF468) /* (PIOB) Pull-up Status Register*/
#define AT91C_PIOB_PDSR ((AT91_REG *) 	0xFFFFF43C) /* (PIOB) Pin Data Status Register*/
#define AT91C_PIOB_DELAY3 ((AT91_REG *) 	0xFFFFF4C8) /* (PIOB) PIO Delay Control Register*/
#define AT91C_PIOB_MDDR ((AT91_REG *) 	0xFFFFF454) /* (PIOB) Multi-driver Disable Register*/
#define AT91C_PIOB_CODR ((AT91_REG *) 	0xFFFFF434) /* (PIOB) Clear Output Data Register*/
#define AT91C_PIOB_MDER ((AT91_REG *) 	0xFFFFF450) /* (PIOB) Multi-driver Enable Register*/
#define AT91C_PIOB_PDR  ((AT91_REG *) 	0xFFFFF404) /* (PIOB) PIO Disable Register*/
#define AT91C_PIOB_IFSR ((AT91_REG *) 	0xFFFFF428) /* (PIOB) Input Filter Status Register*/
#define AT91C_PIOB_PSR  ((AT91_REG *) 	0xFFFFF408) /* (PIOB) PIO Status Register*/
#define AT91C_PIOB_SLEWRATE1 ((AT91_REG *) 	0xFFFFF4B0) /* (PIOB) PIO Slewrate Control Register*/
#define AT91C_PIOB_IER  ((AT91_REG *) 	0xFFFFF440) /* (PIOB) Interrupt Enable Register*/
#define AT91C_PIOB_PPUDR ((AT91_REG *) 	0xFFFFF460) /* (PIOB) Pull-up Disable Register*/
#define AT91C_PIOB_PER  ((AT91_REG *) 	0xFFFFF400) /* (PIOB) PIO Enable Register*/
#define AT91C_PIOB_IFDR ((AT91_REG *) 	0xFFFFF424) /* (PIOB) Input Filter Disable Register*/
#define AT91C_PIOB_IDR  ((AT91_REG *) 	0xFFFFF444) /* (PIOB) Interrupt Disable Register*/
#define AT91C_PIOB_OWDR ((AT91_REG *) 	0xFFFFF4A4) /* (PIOB) Output Write Disable Register*/
#define AT91C_PIOB_ODSR ((AT91_REG *) 	0xFFFFF438) /* (PIOB) Output Data Status Register*/
#define AT91C_PIOB_DELAY2 ((AT91_REG *) 	0xFFFFF4C4) /* (PIOB) PIO Delay Control Register*/
#define AT91C_PIOB_OWSR ((AT91_REG *) 	0xFFFFF4A8) /* (PIOB) Output Write Status Register*/
#define AT91C_PIOB_BSR  ((AT91_REG *) 	0xFFFFF474) /* (PIOB) Select B Register*/
#define AT91C_PIOB_IFER ((AT91_REG *) 	0xFFFFF420) /* (PIOB) Input Filter Enable Register*/
#define AT91C_PIOB_OWER ((AT91_REG *) 	0xFFFFF4A0) /* (PIOB) Output Write Enable Register*/
#define AT91C_PIOB_PPUER ((AT91_REG *) 	0xFFFFF464) /* (PIOB) Pull-up Enable Register*/
#define AT91C_PIOB_OSR  ((AT91_REG *) 	0xFFFFF418) /* (PIOB) Output Status Register*/
#define AT91C_PIOB_ASR  ((AT91_REG *) 	0xFFFFF470) /* (PIOB) Select A Register*/
#define AT91C_PIOB_OER  ((AT91_REG *) 	0xFFFFF410) /* (PIOB) Output Enable Register*/
#define AT91C_PIOB_VERSION ((AT91_REG *) 	0xFFFFF4FC) /* (PIOB) PIO Version Register*/
#define AT91C_PIOB_DELAY1 ((AT91_REG *) 	0xFFFFF4C0) /* (PIOB) PIO Delay Control Register*/
/* ========== Register definition for PIOC peripheral ========== */
#define AT91C_PIOC_OWDR ((AT91_REG *) 	0xFFFFF6A4) /* (PIOC) Output Write Disable Register*/
#define AT91C_PIOC_IMR  ((AT91_REG *) 	0xFFFFF648) /* (PIOC) Interrupt Mask Register*/
#define AT91C_PIOC_ASR  ((AT91_REG *) 	0xFFFFF670) /* (PIOC) Select A Register*/
#define AT91C_PIOC_PPUDR ((AT91_REG *) 	0xFFFFF660) /* (PIOC) Pull-up Disable Register*/
#define AT91C_PIOC_CODR ((AT91_REG *) 	0xFFFFF634) /* (PIOC) Clear Output Data Register*/
#define AT91C_PIOC_OWER ((AT91_REG *) 	0xFFFFF6A0) /* (PIOC) Output Write Enable Register*/
#define AT91C_PIOC_ABSR ((AT91_REG *) 	0xFFFFF678) /* (PIOC) AB Select Status Register*/
#define AT91C_PIOC_IFDR ((AT91_REG *) 	0xFFFFF624) /* (PIOC) Input Filter Disable Register*/
#define AT91C_PIOC_VERSION ((AT91_REG *) 	0xFFFFF6FC) /* (PIOC) PIO Version Register*/
#define AT91C_PIOC_ODR  ((AT91_REG *) 	0xFFFFF614) /* (PIOC) Output Disable Registerr*/
#define AT91C_PIOC_PPUER ((AT91_REG *) 	0xFFFFF664) /* (PIOC) Pull-up Enable Register*/
#define AT91C_PIOC_SODR ((AT91_REG *) 	0xFFFFF630) /* (PIOC) Set Output Data Register*/
#define AT91C_PIOC_ISR  ((AT91_REG *) 	0xFFFFF64C) /* (PIOC) Interrupt Status Register*/
#define AT91C_PIOC_OSR  ((AT91_REG *) 	0xFFFFF618) /* (PIOC) Output Status Register*/
#define AT91C_PIOC_MDSR ((AT91_REG *) 	0xFFFFF658) /* (PIOC) Multi-driver Status Register*/
#define AT91C_PIOC_IFER ((AT91_REG *) 	0xFFFFF620) /* (PIOC) Input Filter Enable Register*/
#define AT91C_PIOC_DELAY2 ((AT91_REG *) 	0xFFFFF6C4) /* (PIOC) PIO Delay Control Register*/
#define AT91C_PIOC_MDER ((AT91_REG *) 	0xFFFFF650) /* (PIOC) Multi-driver Enable Register*/
#define AT91C_PIOC_PPUSR ((AT91_REG *) 	0xFFFFF668) /* (PIOC) Pull-up Status Register*/
#define AT91C_PIOC_PSR  ((AT91_REG *) 	0xFFFFF608) /* (PIOC) PIO Status Register*/
#define AT91C_PIOC_DELAY4 ((AT91_REG *) 	0xFFFFF6CC) /* (PIOC) PIO Delay Control Register*/
#define AT91C_PIOC_DELAY3 ((AT91_REG *) 	0xFFFFF6C8) /* (PIOC) PIO Delay Control Register*/
#define AT91C_PIOC_IER  ((AT91_REG *) 	0xFFFFF640) /* (PIOC) Interrupt Enable Register*/
#define AT91C_PIOC_SLEWRATE1 ((AT91_REG *) 	0xFFFFF6B0) /* (PIOC) PIO Slewrate Control Register*/
#define AT91C_PIOC_IDR  ((AT91_REG *) 	0xFFFFF644) /* (PIOC) Interrupt Disable Register*/
#define AT91C_PIOC_PDSR ((AT91_REG *) 	0xFFFFF63C) /* (PIOC) Pin Data Status Register*/
#define AT91C_PIOC_DELAY1 ((AT91_REG *) 	0xFFFFF6C0) /* (PIOC) PIO Delay Control Register*/
#define AT91C_PIOC_PDR  ((AT91_REG *) 	0xFFFFF604) /* (PIOC) PIO Disable Register*/
#define AT91C_PIOC_OWSR ((AT91_REG *) 	0xFFFFF6A8) /* (PIOC) Output Write Status Register*/
#define AT91C_PIOC_IFSR ((AT91_REG *) 	0xFFFFF628) /* (PIOC) Input Filter Status Register*/
#define AT91C_PIOC_ODSR ((AT91_REG *) 	0xFFFFF638) /* (PIOC) Output Data Status Register*/
#define AT91C_PIOC_OER  ((AT91_REG *) 	0xFFFFF610) /* (PIOC) Output Enable Register*/
#define AT91C_PIOC_MDDR ((AT91_REG *) 	0xFFFFF654) /* (PIOC) Multi-driver Disable Register*/
#define AT91C_PIOC_BSR  ((AT91_REG *) 	0xFFFFF674) /* (PIOC) Select B Register*/
#define AT91C_PIOC_PER  ((AT91_REG *) 	0xFFFFF600) /* (PIOC) PIO Enable Register*/
/* ========== Register definition for PIOD peripheral ========== */
#define AT91C_PIOD_DELAY1 ((AT91_REG *) 	0xFFFFF8C0) /* (PIOD) PIO Delay Control Register*/
#define AT91C_PIOD_OWDR ((AT91_REG *) 	0xFFFFF8A4) /* (PIOD) Output Write Disable Register*/
#define AT91C_PIOD_SODR ((AT91_REG *) 	0xFFFFF830) /* (PIOD) Set Output Data Register*/
#define AT91C_PIOD_PPUER ((AT91_REG *) 	0xFFFFF864) /* (PIOD) Pull-up Enable Register*/
