una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91cap9.h
#define AT91C_PIOD_CODR ((AT91_REG *) 	0xFFFFF834) /* (PIOD) Clear Output Data Register*/
#define AT91C_PIOD_DELAY4 ((AT91_REG *) 	0xFFFFF8CC) /* (PIOD) PIO Delay Control Register*/
#define AT91C_PIOD_PSR  ((AT91_REG *) 	0xFFFFF808) /* (PIOD) PIO Status Register*/
#define AT91C_PIOD_PDR  ((AT91_REG *) 	0xFFFFF804) /* (PIOD) PIO Disable Register*/
#define AT91C_PIOD_ODR  ((AT91_REG *) 	0xFFFFF814) /* (PIOD) Output Disable Registerr*/
#define AT91C_PIOD_PPUSR ((AT91_REG *) 	0xFFFFF868) /* (PIOD) Pull-up Status Register*/
#define AT91C_PIOD_IFSR ((AT91_REG *) 	0xFFFFF828) /* (PIOD) Input Filter Status Register*/
#define AT91C_PIOD_IMR  ((AT91_REG *) 	0xFFFFF848) /* (PIOD) Interrupt Mask Register*/
#define AT91C_PIOD_ASR  ((AT91_REG *) 	0xFFFFF870) /* (PIOD) Select A Register*/
#define AT91C_PIOD_DELAY2 ((AT91_REG *) 	0xFFFFF8C4) /* (PIOD) PIO Delay Control Register*/
#define AT91C_PIOD_OWSR ((AT91_REG *) 	0xFFFFF8A8) /* (PIOD) Output Write Status Register*/
#define AT91C_PIOD_PER  ((AT91_REG *) 	0xFFFFF800) /* (PIOD) PIO Enable Register*/
#define AT91C_PIOD_MDER ((AT91_REG *) 	0xFFFFF850) /* (PIOD) Multi-driver Enable Register*/
#define AT91C_PIOD_PDSR ((AT91_REG *) 	0xFFFFF83C) /* (PIOD) Pin Data Status Register*/
#define AT91C_PIOD_MDSR ((AT91_REG *) 	0xFFFFF858) /* (PIOD) Multi-driver Status Register*/
#define AT91C_PIOD_OWER ((AT91_REG *) 	0xFFFFF8A0) /* (PIOD) Output Write Enable Register*/
#define AT91C_PIOD_BSR  ((AT91_REG *) 	0xFFFFF874) /* (PIOD) Select B Register*/
#define AT91C_PIOD_IFDR ((AT91_REG *) 	0xFFFFF824) /* (PIOD) Input Filter Disable Register*/
#define AT91C_PIOD_DELAY3 ((AT91_REG *) 	0xFFFFF8C8) /* (PIOD) PIO Delay Control Register*/
#define AT91C_PIOD_ABSR ((AT91_REG *) 	0xFFFFF878) /* (PIOD) AB Select Status Register*/
#define AT91C_PIOD_OER  ((AT91_REG *) 	0xFFFFF810) /* (PIOD) Output Enable Register*/
#define AT91C_PIOD_MDDR ((AT91_REG *) 	0xFFFFF854) /* (PIOD) Multi-driver Disable Register*/
#define AT91C_PIOD_IDR  ((AT91_REG *) 	0xFFFFF844) /* (PIOD) Interrupt Disable Register*/
#define AT91C_PIOD_IER  ((AT91_REG *) 	0xFFFFF840) /* (PIOD) Interrupt Enable Register*/
#define AT91C_PIOD_PPUDR ((AT91_REG *) 	0xFFFFF860) /* (PIOD) Pull-up Disable Register*/
#define AT91C_PIOD_VERSION ((AT91_REG *) 	0xFFFFF8FC) /* (PIOD) PIO Version Register*/
#define AT91C_PIOD_ISR  ((AT91_REG *) 	0xFFFFF84C) /* (PIOD) Interrupt Status Register*/
#define AT91C_PIOD_ODSR ((AT91_REG *) 	0xFFFFF838) /* (PIOD) Output Data Status Register*/
#define AT91C_PIOD_OSR  ((AT91_REG *) 	0xFFFFF818) /* (PIOD) Output Status Register*/
#define AT91C_PIOD_IFER ((AT91_REG *) 	0xFFFFF820) /* (PIOD) Input Filter Enable Register*/
#define AT91C_PIOD_SLEWRATE1 ((AT91_REG *) 	0xFFFFF8B0) /* (PIOD) PIO Slewrate Control Register*/
/* ========== Register definition for CKGR peripheral ========== */
#define AT91C_CKGR_MOR  ((AT91_REG *) 	0xFFFFFC20) /* (CKGR) Main Oscillator Register*/
#define AT91C_CKGR_PLLBR ((AT91_REG *) 	0xFFFFFC2C) /* (CKGR) PLL B Register*/
#define AT91C_CKGR_MCFR ((AT91_REG *) 	0xFFFFFC24) /* (CKGR) Main Clock  Frequency Register*/
#define AT91C_CKGR_PLLAR ((AT91_REG *) 	0xFFFFFC28) /* (CKGR) PLL A Register*/
#define AT91C_CKGR_UCKR ((AT91_REG *) 	0xFFFFFC1C) /* (CKGR) UTMI Clock Configuration Register*/
/* ========== Register definition for PMC peripheral ========== */
#define AT91C_PMC_PCER  ((AT91_REG *) 	0xFFFFFC10) /* (PMC) Peripheral Clock Enable Register*/
#define AT91C_PMC_PCKR  ((AT91_REG *) 	0xFFFFFC40) /* (PMC) Programmable Clock Register*/
#define AT91C_PMC_MCKR  ((AT91_REG *) 	0xFFFFFC30) /* (PMC) Master Clock Register*/
#define AT91C_PMC_PLLAR ((AT91_REG *) 	0xFFFFFC28) /* (PMC) PLL A Register*/
#define AT91C_PMC_PCDR  ((AT91_REG *) 	0xFFFFFC14) /* (PMC) Peripheral Clock Disable Register*/
#define AT91C_PMC_SCSR  ((AT91_REG *) 	0xFFFFFC08) /* (PMC) System Clock Status Register*/
#define AT91C_PMC_MCFR  ((AT91_REG *) 	0xFFFFFC24) /* (PMC) Main Clock  Frequency Register*/
#define AT91C_PMC_IMR   ((AT91_REG *) 	0xFFFFFC6C) /* (PMC) Interrupt Mask Register*/
#define AT91C_PMC_IER   ((AT91_REG *) 	0xFFFFFC60) /* (PMC) Interrupt Enable Register*/
#define AT91C_PMC_UCKR  ((AT91_REG *) 	0xFFFFFC1C) /* (PMC) UTMI Clock Configuration Register*/
#define AT91C_PMC_MOR   ((AT91_REG *) 	0xFFFFFC20) /* (PMC) Main Oscillator Register*/
#define AT91C_PMC_IDR   ((AT91_REG *) 	0xFFFFFC64) /* (PMC) Interrupt Disable Register*/
#define AT91C_PMC_PLLBR ((AT91_REG *) 	0xFFFFFC2C) /* (PMC) PLL B Register*/
#define AT91C_PMC_SCDR  ((AT91_REG *) 	0xFFFFFC04) /* (PMC) System Clock Disable Register*/
#define AT91C_PMC_PCSR  ((AT91_REG *) 	0xFFFFFC18) /* (PMC) Peripheral Clock Status Register*/
#define AT91C_PMC_SCER  ((AT91_REG *) 	0xFFFFFC00) /* (PMC) System Clock Enable Register*/
#define AT91C_PMC_SR    ((AT91_REG *) 	0xFFFFFC68) /* (PMC) Status Register*/
/* ========== Register definition for RSTC peripheral ========== */
#define AT91C_RSTC_RCR  ((AT91_REG *) 	0xFFFFFD00) /* (RSTC) Reset Control Register*/
#define AT91C_RSTC_RMR  ((AT91_REG *) 	0xFFFFFD08) /* (RSTC) Reset Mode Register*/
#define AT91C_RSTC_RSR  ((AT91_REG *) 	0xFFFFFD04) /* (RSTC) Reset Status Register*/
/* ========== Register definition for SHDWC peripheral ========== */
#define AT91C_SHDWC_SHSR ((AT91_REG *) 	0xFFFFFD18) /* (SHDWC) Shut Down Status Register*/
#define AT91C_SHDWC_SHMR ((AT91_REG *) 	0xFFFFFD14) /* (SHDWC) Shut Down Mode Register*/
#define AT91C_SHDWC_SHCR ((AT91_REG *) 	0xFFFFFD10) /* (SHDWC) Shut Down Control Register*/
/* ========== Register definition for RTTC peripheral ========== */
#define AT91C_RTTC_RTSR ((AT91_REG *) 	0xFFFFFD2C) /* (RTTC) Real-time Status Register*/
#define AT91C_RTTC_RTMR ((AT91_REG *) 	0xFFFFFD20) /* (RTTC) Real-time Mode Register*/
#define AT91C_RTTC_RTVR ((AT91_REG *) 	0xFFFFFD28) /* (RTTC) Real-time Value Register*/
#define AT91C_RTTC_RTAR ((AT91_REG *) 	0xFFFFFD24) /* (RTTC) Real-time Alarm Register*/
/* ========== Register definition for PITC peripheral ========== */
#define AT91C_PITC_PIVR ((AT91_REG *) 	0xFFFFFD38) /* (PITC) Period Interval Value Register*/
#define AT91C_PITC_PISR ((AT91_REG *) 	0xFFFFFD34) /* (PITC) Period Interval Status Register*/
#define AT91C_PITC_PIIR ((AT91_REG *) 	0xFFFFFD3C) /* (PITC) Period Interval Image Register*/
#define AT91C_PITC_PIMR ((AT91_REG *) 	0xFFFFFD30) /* (PITC) Period Interval Mode Register*/
/* ========== Register definition for WDTC peripheral ========== */
#define AT91C_WDTC_WDCR ((AT91_REG *) 	0xFFFFFD40) /* (WDTC) Watchdog Control Register*/
#define AT91C_WDTC_WDSR ((AT91_REG *) 	0xFFFFFD48) /* (WDTC) Watchdog Status Register*/
#define AT91C_WDTC_WDMR ((AT91_REG *) 	0xFFFFFD44) /* (WDTC) Watchdog Mode Register*/
/* ========== Register definition for UDP peripheral ========== */
#define AT91C_UDP_FDR   ((AT91_REG *) 	0xFFF78050) /* (UDP) Endpoint FIFO Data Register*/
#define AT91C_UDP_IER   ((AT91_REG *) 	0xFFF78010) /* (UDP) Interrupt Enable Register*/
#define AT91C_UDP_CSR   ((AT91_REG *) 	0xFFF78030) /* (UDP) Endpoint Control and Status Register*/
#define AT91C_UDP_RSTEP ((AT91_REG *) 	0xFFF78028) /* (UDP) Reset Endpoint Register*/
#define AT91C_UDP_GLBSTATE ((AT91_REG *) 	0xFFF78004) /* (UDP) Global State Register*/
#define AT91C_UDP_TXVC  ((AT91_REG *) 	0xFFF78074) /* (UDP) Transceiver Control Register*/
#define AT91C_UDP_IDR   ((AT91_REG *) 	0xFFF78014) /* (UDP) Interrupt Disable Register*/
#define AT91C_UDP_ISR   ((AT91_REG *) 	0xFFF7801C) /* (UDP) Interrupt Status Register*/
#define AT91C_UDP_IMR   ((AT91_REG *) 	0xFFF78018) /* (UDP) Interrupt Mask Register*/
#define AT91C_UDP_FADDR ((AT91_REG *) 	0xFFF78008) /* (UDP) Function Address Register*/
#define AT91C_UDP_NUM   ((AT91_REG *) 	0xFFF78000) /* (UDP) Frame Number Register*/
#define AT91C_UDP_ICR   ((AT91_REG *) 	0xFFF78020) /* (UDP) Interrupt Clear Register*/
/* ========== Register definition for UDPHS_EPTFIFO peripheral ========== */
#define AT91C_UDPHS_EPTFIFO_READEPT3 ((AT91_REG *) 	0x00630000) /* (UDPHS_EPTFIFO) FIFO Endpoint Data Register 3*/
#define AT91C_UDPHS_EPTFIFO_READEPT5 ((AT91_REG *) 	0x00650000) /* (UDPHS_EPTFIFO) FIFO Endpoint Data Register 5*/
#define AT91C_UDPHS_EPTFIFO_READEPT1 ((AT91_REG *) 	0x00610000) /* (UDPHS_EPTFIFO) FIFO Endpoint Data Register 1*/
#define AT91C_UDPHS_EPTFIFO_READEPT0 ((AT91_REG *) 	0x00600000) /* (UDPHS_EPTFIFO) FIFO Endpoint Data Register 0*/
#define AT91C_UDPHS_EPTFIFO_READEPT6 ((AT91_REG *) 	0x00660000) /* (UDPHS_EPTFIFO) FIFO Endpoint Data Register 6*/
#define AT91C_UDPHS_EPTFIFO_READEPT2 ((AT91_REG *) 	0x00620000) /* (UDPHS_EPTFIFO) FIFO Endpoint Data Register 2*/
#define AT91C_UDPHS_EPTFIFO_READEPT4 ((AT91_REG *) 	0x00640000) /* (UDPHS_EPTFIFO) FIFO Endpoint Data Register 4*/
#define AT91C_UDPHS_EPTFIFO_READEPT7 ((AT91_REG *) 	0x00670000) /* (UDPHS_EPTFIFO) FIFO Endpoint Data Register 7*/
/* ========== Register definition for UDPHS_EPT_0 peripheral ========== */
#define AT91C_UDPHS_EPT_0_EPTSTA ((AT91_REG *) 	0xFFF7811C) /* (UDPHS_EPT_0) UDPHS Endpoint Status Register*/
#define AT91C_UDPHS_EPT_0_EPTCTL ((AT91_REG *) 	0xFFF7810C) /* (UDPHS_EPT_0) UDPHS Endpoint Control Register*/
#define AT91C_UDPHS_EPT_0_EPTCTLDIS ((AT91_REG *) 	0xFFF78108) /* (UDPHS_EPT_0) UDPHS Endpoint Control Disable Register*/
#define AT91C_UDPHS_EPT_0_EPTCFG ((AT91_REG *) 	0xFFF78100) /* (UDPHS_EPT_0) UDPHS Endpoint Config Register*/
#define AT91C_UDPHS_EPT_0_EPTCLRSTA ((AT91_REG *) 	0xFFF78118) /* (UDPHS_EPT_0) UDPHS Endpoint Clear Status Register*/
#define AT91C_UDPHS_EPT_0_EPTSETSTA ((AT91_REG *) 	0xFFF78114) /* (UDPHS_EPT_0) UDPHS Endpoint Set Status Register*/
#define AT91C_UDPHS_EPT_0_EPTCTLENB ((AT91_REG *) 	0xFFF78104) /* (UDPHS_EPT_0) UDPHS Endpoint Control Enable Register*/
/* ========== Register definition for UDPHS_EPT_1 peripheral ========== */
#define AT91C_UDPHS_EPT_1_EPTCTLENB ((AT91_REG *) 	0xFFF78124) /* (UDPHS_EPT_1) UDPHS Endpoint Control Enable Register*/
#define AT91C_UDPHS_EPT_1_EPTCFG ((AT91_REG *) 	0xFFF78120) /* (UDPHS_EPT_1) UDPHS Endpoint Config Register*/
#define AT91C_UDPHS_EPT_1_EPTCTL ((AT91_REG *) 	0xFFF7812C) /* (UDPHS_EPT_1) UDPHS Endpoint Control Register*/
#define AT91C_UDPHS_EPT_1_EPTSTA ((AT91_REG *) 	0xFFF7813C) /* (UDPHS_EPT_1) UDPHS Endpoint Status Register*/
#define AT91C_UDPHS_EPT_1_EPTCLRSTA ((AT91_REG *) 	0xFFF78138) /* (UDPHS_EPT_1) UDPHS Endpoint Clear Status Register*/
#define AT91C_UDPHS_EPT_1_EPTSETSTA ((AT91_REG *) 	0xFFF78134) /* (UDPHS_EPT_1) UDPHS Endpoint Set Status Register*/
#define AT91C_UDPHS_EPT_1_EPTCTLDIS ((AT91_REG *) 	0xFFF78128) /* (UDPHS_EPT_1) UDPHS Endpoint Control Disable Register*/
/* ========== Register definition for UDPHS_EPT_2 peripheral ========== */
#define AT91C_UDPHS_EPT_2_EPTCLRSTA ((AT91_REG *) 	0xFFF78158) /* (UDPHS_EPT_2) UDPHS Endpoint Clear Status Register*/
#define AT91C_UDPHS_EPT_2_EPTCTLDIS ((AT91_REG *) 	0xFFF78148) /* (UDPHS_EPT_2) UDPHS Endpoint Control Disable Register*/
#define AT91C_UDPHS_EPT_2_EPTSTA ((AT91_REG *) 	0xFFF7815C) /* (UDPHS_EPT_2) UDPHS Endpoint Status Register*/
#define AT91C_UDPHS_EPT_2_EPTSETSTA ((AT91_REG *) 	0xFFF78154) /* (UDPHS_EPT_2) UDPHS Endpoint Set Status Register*/
#define AT91C_UDPHS_EPT_2_EPTCTL ((AT91_REG *) 	0xFFF7814C) /* (UDPHS_EPT_2) UDPHS Endpoint Control Register*/
#define AT91C_UDPHS_EPT_2_EPTCFG ((AT91_REG *) 	0xFFF78140) /* (UDPHS_EPT_2) UDPHS Endpoint Config Register*/
#define AT91C_UDPHS_EPT_2_EPTCTLENB ((AT91_REG *) 	0xFFF78144) /* (UDPHS_EPT_2) UDPHS Endpoint Control Enable Register*/
/* ========== Register definition for UDPHS_EPT_3 peripheral ========== */
#define AT91C_UDPHS_EPT_3_EPTCTL ((AT91_REG *) 	0xFFF7816C) /* (UDPHS_EPT_3) UDPHS Endpoint Control Register*/
#define AT91C_UDPHS_EPT_3_EPTCLRSTA ((AT91_REG *) 	0xFFF78178) /* (UDPHS_EPT_3) UDPHS Endpoint Clear Status Register*/
#define AT91C_UDPHS_EPT_3_EPTCTLDIS ((AT91_REG *) 	0xFFF78168) /* (UDPHS_EPT_3) UDPHS Endpoint Control Disable Register*/
#define AT91C_UDPHS_EPT_3_EPTSTA ((AT91_REG *) 	0xFFF7817C) /* (UDPHS_EPT_3) UDPHS Endpoint Status Register*/
#define AT91C_UDPHS_EPT_3_EPTSETSTA ((AT91_REG *) 	0xFFF78174) /* (UDPHS_EPT_3) UDPHS Endpoint Set Status Register*/
#define AT91C_UDPHS_EPT_3_EPTCTLENB ((AT91_REG *) 	0xFFF78164) /* (UDPHS_EPT_3) UDPHS Endpoint Control Enable Register*/
#define AT91C_UDPHS_EPT_3_EPTCFG ((AT91_REG *) 	0xFFF78160) /* (UDPHS_EPT_3) UDPHS Endpoint Config Register*/
/* ========== Register definition for UDPHS_EPT_4 peripheral ========== */
#define AT91C_UDPHS_EPT_4_EPTCLRSTA ((AT91_REG *) 	0xFFF78198) /* (UDPHS_EPT_4) UDPHS Endpoint Clear Status Register*/
#define AT91C_UDPHS_EPT_4_EPTCTL ((AT91_REG *) 	0xFFF7818C) /* (UDPHS_EPT_4) UDPHS Endpoint Control Register*/
#define AT91C_UDPHS_EPT_4_EPTCTLENB ((AT91_REG *) 	0xFFF78184) /* (UDPHS_EPT_4) UDPHS Endpoint Control Enable Register*/
#define AT91C_UDPHS_EPT_4_EPTSTA ((AT91_REG *) 	0xFFF7819C) /* (UDPHS_EPT_4) UDPHS Endpoint Status Register*/
#define AT91C_UDPHS_EPT_4_EPTSETSTA ((AT91_REG *) 	0xFFF78194) /* (UDPHS_EPT_4) UDPHS Endpoint Set Status Register*/
#define AT91C_UDPHS_EPT_4_EPTCFG ((AT91_REG *) 	0xFFF78180) /* (UDPHS_EPT_4) UDPHS Endpoint Config Register*/
#define AT91C_UDPHS_EPT_4_EPTCTLDIS ((AT91_REG *) 	0xFFF78188) /* (UDPHS_EPT_4) UDPHS Endpoint Control Disable Register*/
/* ========== Register definition for UDPHS_EPT_5 peripheral ========== */
#define AT91C_UDPHS_EPT_5_EPTSTA ((AT91_REG *) 	0xFFF781BC) /* (UDPHS_EPT_5) UDPHS Endpoint Status Register*/
#define AT91C_UDPHS_EPT_5_EPTCLRSTA ((AT91_REG *) 	0xFFF781B8) /* (UDPHS_EPT_5) UDPHS Endpoint Clear Status Register*/
#define AT91C_UDPHS_EPT_5_EPTCTLENB ((AT91_REG *) 	0xFFF781A4) /* (UDPHS_EPT_5) UDPHS Endpoint Control Enable Register*/
#define AT91C_UDPHS_EPT_5_EPTSETSTA ((AT91_REG *) 	0xFFF781B4) /* (UDPHS_EPT_5) UDPHS Endpoint Set Status Register*/
#define AT91C_UDPHS_EPT_5_EPTCTLDIS ((AT91_REG *) 	0xFFF781A8) /* (UDPHS_EPT_5) UDPHS Endpoint Control Disable Register*/
#define AT91C_UDPHS_EPT_5_EPTCFG ((AT91_REG *) 	0xFFF781A0) /* (UDPHS_EPT_5) UDPHS Endpoint Config Register*/
#define AT91C_UDPHS_EPT_5_EPTCTL ((AT91_REG *) 	0xFFF781AC) /* (UDPHS_EPT_5) UDPHS Endpoint Control Register*/
/* ========== Register definition for UDPHS_EPT_6 peripheral ========== */
#define AT91C_UDPHS_EPT_6_EPTCLRSTA ((AT91_REG *) 	0xFFF781D8) /* (UDPHS_EPT_6) UDPHS Endpoint Clear Status Register*/
#define AT91C_UDPHS_EPT_6_EPTCTLENB ((AT91_REG *) 	0xFFF781C4) /* (UDPHS_EPT_6) UDPHS Endpoint Control Enable Register*/
#define AT91C_UDPHS_EPT_6_EPTCTL ((AT91_REG *) 	0xFFF781CC) /* (UDPHS_EPT_6) UDPHS Endpoint Control Register*/
#define AT91C_UDPHS_EPT_6_EPTSETSTA ((AT91_REG *) 	0xFFF781D4) /* (UDPHS_EPT_6) UDPHS Endpoint Set Status Register*/
#define AT91C_UDPHS_EPT_6_EPTCTLDIS ((AT91_REG *) 	0xFFF781C8) /* (UDPHS_EPT_6) UDPHS Endpoint Control Disable Register*/
#define AT91C_UDPHS_EPT_6_EPTSTA ((AT91_REG *) 	0xFFF781DC) /* (UDPHS_EPT_6) UDPHS Endpoint Status Register*/
#define AT91C_UDPHS_EPT_6_EPTCFG ((AT91_REG *) 	0xFFF781C0) /* (UDPHS_EPT_6) UDPHS Endpoint Config Register*/
/* ========== Register definition for UDPHS_EPT_7 peripheral ========== */
#define AT91C_UDPHS_EPT_7_EPTSETSTA ((AT91_REG *) 	0xFFF781F4) /* (UDPHS_EPT_7) UDPHS Endpoint Set Status Register*/
#define AT91C_UDPHS_EPT_7_EPTCFG ((AT91_REG *) 	0xFFF781E0) /* (UDPHS_EPT_7) UDPHS Endpoint Config Register*/
#define AT91C_UDPHS_EPT_7_EPTSTA ((AT91_REG *) 	0xFFF781FC) /* (UDPHS_EPT_7) UDPHS Endpoint Status Register*/
#define AT91C_UDPHS_EPT_7_EPTCLRSTA ((AT91_REG *) 	0xFFF781F8) /* (UDPHS_EPT_7) UDPHS Endpoint Clear Status Register*/
#define AT91C_UDPHS_EPT_7_EPTCTL ((AT91_REG *) 	0xFFF781EC) /* (UDPHS_EPT_7) UDPHS Endpoint Control Register*/
#define AT91C_UDPHS_EPT_7_EPTCTLDIS ((AT91_REG *) 	0xFFF781E8) /* (UDPHS_EPT_7) UDPHS Endpoint Control Disable Register*/
#define AT91C_UDPHS_EPT_7_EPTCTLENB ((AT91_REG *) 	0xFFF781E4) /* (UDPHS_EPT_7) UDPHS Endpoint Control Enable Register*/
/* ========== Register definition for UDPHS_DMA_1 peripheral ========== */
#define AT91C_UDPHS_DMA_1_DMASTATUS ((AT91_REG *) 	0xFFF7831C) /* (UDPHS_DMA_1) UDPHS DMA Channel Status Register*/
#define AT91C_UDPHS_DMA_1_DMANXTDSC ((AT91_REG *) 	0xFFF78310) /* (UDPHS_DMA_1) UDPHS DMA Channel Next Descriptor Address*/
#define AT91C_UDPHS_DMA_1_DMACONTROL ((AT91_REG *) 	0xFFF78318) /* (UDPHS_DMA_1) UDPHS DMA Channel Control Register*/
#define AT91C_UDPHS_DMA_1_DMAADDRESS ((AT91_REG *) 	0xFFF78314) /* (UDPHS_DMA_1) UDPHS DMA Channel Address Register*/
/* ========== Register definition for UDPHS_DMA_2 peripheral ========== */
#define AT91C_UDPHS_DMA_2_DMACONTROL ((AT91_REG *) 	0xFFF78328) /* (UDPHS_DMA_2) UDPHS DMA Channel Control Register*/
#define AT91C_UDPHS_DMA_2_DMASTATUS ((AT91_REG *) 	0xFFF7832C) /* (UDPHS_DMA_2) UDPHS DMA Channel Status Register*/
#define AT91C_UDPHS_DMA_2_DMAADDRESS ((AT91_REG *) 	0xFFF78324) /* (UDPHS_DMA_2) UDPHS DMA Channel Address Register*/
#define AT91C_UDPHS_DMA_2_DMANXTDSC ((AT91_REG *) 	0xFFF78320) /* (UDPHS_DMA_2) UDPHS DMA Channel Next Descriptor Address*/
/* ========== Register definition for UDPHS_DMA_3 peripheral ========== */
#define AT91C_UDPHS_DMA_3_DMAADDRESS ((AT91_REG *) 	0xFFF78334) /* (UDPHS_DMA_3) UDPHS DMA Channel Address Register*/
#define AT91C_UDPHS_DMA_3_DMANXTDSC ((AT91_REG *) 	0xFFF78330) /* (UDPHS_DMA_3) UDPHS DMA Channel Next Descriptor Address*/
#define AT91C_UDPHS_DMA_3_DMACONTROL ((AT91_REG *) 	0xFFF78338) /* (UDPHS_DMA_3) UDPHS DMA Channel Control Register*/
#define AT91C_UDPHS_DMA_3_DMASTATUS ((AT91_REG *) 	0xFFF7833C) /* (UDPHS_DMA_3) UDPHS DMA Channel Status Register*/
/* ========== Register definition for UDPHS_DMA_4 peripheral ========== */
#define AT91C_UDPHS_DMA_4_DMANXTDSC ((AT91_REG *) 	0xFFF78340) /* (UDPHS_DMA_4) UDPHS DMA Channel Next Descriptor Address*/
#define AT91C_UDPHS_DMA_4_DMAADDRESS ((AT91_REG *) 	0xFFF78344) /* (UDPHS_DMA_4) UDPHS DMA Channel Address Register*/
#define AT91C_UDPHS_DMA_4_DMACONTROL ((AT91_REG *) 	0xFFF78348) /* (UDPHS_DMA_4) UDPHS DMA Channel Control Register*/
#define AT91C_UDPHS_DMA_4_DMASTATUS ((AT91_REG *) 	0xFFF7834C) /* (UDPHS_DMA_4) UDPHS DMA Channel Status Register*/
/* ========== Register definition for UDPHS_DMA_5 peripheral ========== */
#define AT91C_UDPHS_DMA_5_DMASTATUS ((AT91_REG *) 	0xFFF7835C) /* (UDPHS_DMA_5) UDPHS DMA Channel Status Register*/
#define AT91C_UDPHS_DMA_5_DMACONTROL ((AT91_REG *) 	0xFFF78358) /* (UDPHS_DMA_5) UDPHS DMA Channel Control Register*/
#define AT91C_UDPHS_DMA_5_DMANXTDSC ((AT91_REG *) 	0xFFF78350) /* (UDPHS_DMA_5) UDPHS DMA Channel Next Descriptor Address*/
#define AT91C_UDPHS_DMA_5_DMAADDRESS ((AT91_REG *) 	0xFFF78354) /* (UDPHS_DMA_5) UDPHS DMA Channel Address Register*/
/* ========== Register definition for UDPHS_DMA_6 peripheral ========== */
#define AT91C_UDPHS_DMA_6_DMANXTDSC ((AT91_REG *) 	0xFFF78360) /* (UDPHS_DMA_6) UDPHS DMA Channel Next Descriptor Address*/
#define AT91C_UDPHS_DMA_6_DMACONTROL ((AT91_REG *) 	0xFFF78368) /* (UDPHS_DMA_6) UDPHS DMA Channel Control Register*/
#define AT91C_UDPHS_DMA_6_DMASTATUS ((AT91_REG *) 	0xFFF7836C) /* (UDPHS_DMA_6) UDPHS DMA Channel Status Register*/
#define AT91C_UDPHS_DMA_6_DMAADDRESS ((AT91_REG *) 	0xFFF78364) /* (UDPHS_DMA_6) UDPHS DMA Channel Address Register*/
/* ========== Register definition for UDPHS peripheral ========== */
#define AT91C_UDPHS_IEN ((AT91_REG *) 	0xFFF78010) /* (UDPHS) UDPHS Interrupt Enable Register*/
#define AT91C_UDPHS_TSTSOFCNT ((AT91_REG *) 	0xFFF780D0) /* (UDPHS) UDPHS Test SOF Counter Register*/
#define AT91C_UDPHS_IPFEATURES ((AT91_REG *) 	0xFFF780F8) /* (UDPHS) UDPHS Features Register*/
#define AT91C_UDPHS_TST ((AT91_REG *) 	0xFFF780E0) /* (UDPHS) UDPHS Test Register*/
#define AT91C_UDPHS_FNUM ((AT91_REG *) 	0xFFF78004) /* (UDPHS) UDPHS Frame Number Register*/
#define AT91C_UDPHS_TSTCNTB ((AT91_REG *) 	0xFFF780D8) /* (UDPHS) UDPHS Test B Counter Register*/
#define AT91C_UDPHS_RIPPADDRSIZE ((AT91_REG *) 	0xFFF780EC) /* (UDPHS) UDPHS PADDRSIZE Register*/
#define AT91C_UDPHS_INTSTA ((AT91_REG *) 	0xFFF78014) /* (UDPHS) UDPHS Interrupt Status Register*/
#define AT91C_UDPHS_EPTRST ((AT91_REG *) 	0xFFF7801C) /* (UDPHS) UDPHS Endpoints Reset Register*/
#define AT91C_UDPHS_TSTCNTA ((AT91_REG *) 	0xFFF780D4) /* (UDPHS) UDPHS Test A Counter Register*/
#define AT91C_UDPHS_RIPNAME2 ((AT91_REG *) 	0xFFF780F4) /* (UDPHS) UDPHS Name2 Register*/
#define AT91C_UDPHS_RIPNAME1 ((AT91_REG *) 	0xFFF780F0) /* (UDPHS) UDPHS Name1 Register*/
#define AT91C_UDPHS_TSTMODREG ((AT91_REG *) 	0xFFF780DC) /* (UDPHS) UDPHS Test Mode Register*/
#define AT91C_UDPHS_CLRINT ((AT91_REG *) 	0xFFF78018) /* (UDPHS) UDPHS Clear Interrupt Register*/
#define AT91C_UDPHS_IPVERSION ((AT91_REG *) 	0xFFF780FC) /* (UDPHS) UDPHS Version Register*/
#define AT91C_UDPHS_CTRL ((AT91_REG *) 	0xFFF78000) /* (UDPHS) UDPHS Control Register*/
/* ========== Register definition for TC0 peripheral ========== */
#define AT91C_TC0_IER   ((AT91_REG *) 	0xFFF7C024) /* (TC0) Interrupt Enable Register*/
#define AT91C_TC0_IMR   ((AT91_REG *) 	0xFFF7C02C) /* (TC0) Interrupt Mask Register*/
#define AT91C_TC0_CCR   ((AT91_REG *) 	0xFFF7C000) /* (TC0) Channel Control Register*/
#define AT91C_TC0_RB    ((AT91_REG *) 	0xFFF7C018) /* (TC0) Register B*/
#define AT91C_TC0_CV    ((AT91_REG *) 	0xFFF7C010) /* (TC0) Counter Value*/
#define AT91C_TC0_SR    ((AT91_REG *) 	0xFFF7C020) /* (TC0) Status Register*/
#define AT91C_TC0_CMR   ((AT91_REG *) 	0xFFF7C004) /* (TC0) Channel Mode Register (Capture Mode / Waveform Mode)*/
#define AT91C_TC0_RA    ((AT91_REG *) 	0xFFF7C014) /* (TC0) Register A*/
#define AT91C_TC0_RC    ((AT91_REG *) 	0xFFF7C01C) /* (TC0) Register C*/
#define AT91C_TC0_IDR   ((AT91_REG *) 	0xFFF7C028) /* (TC0) Interrupt Disable Register*/
/* ========== Register definition for TC1 peripheral ========== */
#define AT91C_TC1_IER   ((AT91_REG *) 	0xFFF7C064) /* (TC1) Interrupt Enable Register*/
#define AT91C_TC1_SR    ((AT91_REG *) 	0xFFF7C060) /* (TC1) Status Register*/
#define AT91C_TC1_RC    ((AT91_REG *) 	0xFFF7C05C) /* (TC1) Register C*/
#define AT91C_TC1_CV    ((AT91_REG *) 	0xFFF7C050) /* (TC1) Counter Value*/
#define AT91C_TC1_RA    ((AT91_REG *) 	0xFFF7C054) /* (TC1) Register A*/
#define AT91C_TC1_CMR   ((AT91_REG *) 	0xFFF7C044) /* (TC1) Channel Mode Register (Capture Mode / Waveform Mode)*/
#define AT91C_TC1_IDR   ((AT91_REG *) 	0xFFF7C068) /* (TC1) Interrupt Disable Register*/
#define AT91C_TC1_RB    ((AT91_REG *) 	0xFFF7C058) /* (TC1) Register B*/
#define AT91C_TC1_IMR   ((AT91_REG *) 	0xFFF7C06C) /* (TC1) Interrupt Mask Register*/
#define AT91C_TC1_CCR   ((AT91_REG *) 	0xFFF7C040) /* (TC1) Channel Control Register*/
/* ========== Register definition for TC2 peripheral ========== */
#define AT91C_TC2_SR    ((AT91_REG *) 	0xFFF7C0A0) /* (TC2) Status Register*/
#define AT91C_TC2_IMR   ((AT91_REG *) 	0xFFF7C0AC) /* (TC2) Interrupt Mask Register*/
#define AT91C_TC2_IER   ((AT91_REG *) 	0xFFF7C0A4) /* (TC2) Interrupt Enable Register*/
#define AT91C_TC2_CV    ((AT91_REG *) 	0xFFF7C090) /* (TC2) Counter Value*/
#define AT91C_TC2_RB    ((AT91_REG *) 	0xFFF7C098) /* (TC2) Register B*/
#define AT91C_TC2_CCR   ((AT91_REG *) 	0xFFF7C080) /* (TC2) Channel Control Register*/
#define AT91C_TC2_CMR   ((AT91_REG *) 	0xFFF7C084) /* (TC2) Channel Mode Register (Capture Mode / Waveform Mode)*/
#define AT91C_TC2_RA    ((AT91_REG *) 	0xFFF7C094) /* (TC2) Register A*/
#define AT91C_TC2_IDR   ((AT91_REG *) 	0xFFF7C0A8) /* (TC2) Interrupt Disable Register*/
#define AT91C_TC2_RC    ((AT91_REG *) 	0xFFF7C09C) /* (TC2) Register C*/
/* ========== Register definition for TCB0 peripheral ========== */
#define AT91C_TCB0_BCR  ((AT91_REG *) 	0xFFF7C0C0) /* (TCB0) TC Block Control Register*/
#define AT91C_TCB0_BMR  ((AT91_REG *) 	0xFFF7C0C4) /* (TCB0) TC Block Mode Register*/
