una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91cap9.h
/* ========== Register definition for TCB1 peripheral ========== */
#define AT91C_TCB1_BMR  ((AT91_REG *) 	0xFFF7C104) /* (TCB1) TC Block Mode Register*/
#define AT91C_TCB1_BCR  ((AT91_REG *) 	0xFFF7C100) /* (TCB1) TC Block Control Register*/
/* ========== Register definition for TCB2 peripheral ========== */
#define AT91C_TCB2_BCR  ((AT91_REG *) 	0xFFF7C140) /* (TCB2) TC Block Control Register*/
#define AT91C_TCB2_BMR  ((AT91_REG *) 	0xFFF7C144) /* (TCB2) TC Block Mode Register*/
/* ========== Register definition for PDC_MCI0 peripheral ========== */
#define AT91C_MCI0_TCR  ((AT91_REG *) 	0xFFF8010C) /* (PDC_MCI0) Transmit Counter Register*/
#define AT91C_MCI0_TNCR ((AT91_REG *) 	0xFFF8011C) /* (PDC_MCI0) Transmit Next Counter Register*/
#define AT91C_MCI0_RNPR ((AT91_REG *) 	0xFFF80110) /* (PDC_MCI0) Receive Next Pointer Register*/
#define AT91C_MCI0_TPR  ((AT91_REG *) 	0xFFF80108) /* (PDC_MCI0) Transmit Pointer Register*/
#define AT91C_MCI0_TNPR ((AT91_REG *) 	0xFFF80118) /* (PDC_MCI0) Transmit Next Pointer Register*/
#define AT91C_MCI0_PTSR ((AT91_REG *) 	0xFFF80124) /* (PDC_MCI0) PDC Transfer Status Register*/
#define AT91C_MCI0_RCR  ((AT91_REG *) 	0xFFF80104) /* (PDC_MCI0) Receive Counter Register*/
#define AT91C_MCI0_PTCR ((AT91_REG *) 	0xFFF80120) /* (PDC_MCI0) PDC Transfer Control Register*/
#define AT91C_MCI0_RPR  ((AT91_REG *) 	0xFFF80100) /* (PDC_MCI0) Receive Pointer Register*/
#define AT91C_MCI0_RNCR ((AT91_REG *) 	0xFFF80114) /* (PDC_MCI0) Receive Next Counter Register*/
/* ========== Register definition for MCI0 peripheral ========== */
#define AT91C_MCI0_IMR  ((AT91_REG *) 	0xFFF8004C) /* (MCI0) MCI Interrupt Mask Register*/
#define AT91C_MCI0_MR   ((AT91_REG *) 	0xFFF80004) /* (MCI0) MCI Mode Register*/
#define AT91C_MCI0_CR   ((AT91_REG *) 	0xFFF80000) /* (MCI0) MCI Control Register*/
#define AT91C_MCI0_IER  ((AT91_REG *) 	0xFFF80044) /* (MCI0) MCI Interrupt Enable Register*/
#define AT91C_MCI0_FIFO ((AT91_REG *) 	0xFFF80200) /* (MCI0) MCI FIFO Aperture Register*/
#define AT91C_MCI0_DTOR ((AT91_REG *) 	0xFFF80008) /* (MCI0) MCI Data Timeout Register*/
#define AT91C_MCI0_SDCR ((AT91_REG *) 	0xFFF8000C) /* (MCI0) MCI SD/SDIO Card Register*/
#define AT91C_MCI0_BLKR ((AT91_REG *) 	0xFFF80018) /* (MCI0) MCI Block Register*/
#define AT91C_MCI0_VR   ((AT91_REG *) 	0xFFF800FC) /* (MCI0) MCI Version Register*/
#define AT91C_MCI0_WPSR ((AT91_REG *) 	0xFFF800E8) /* (MCI0) MCI Write Protection Status Register*/
#define AT91C_MCI0_CMDR ((AT91_REG *) 	0xFFF80014) /* (MCI0) MCI Command Register*/
#define AT91C_MCI0_CSTOR ((AT91_REG *) 	0xFFF8001C) /* (MCI0) MCI Completion Signal Timeout Register*/
#define AT91C_MCI0_DMA  ((AT91_REG *) 	0xFFF80050) /* (MCI0) MCI DMA Configuration Register*/
#define AT91C_MCI0_RDR  ((AT91_REG *) 	0xFFF80030) /* (MCI0) MCI Receive Data Register*/
#define AT91C_MCI0_SR   ((AT91_REG *) 	0xFFF80040) /* (MCI0) MCI Status Register*/
#define AT91C_MCI0_TDR  ((AT91_REG *) 	0xFFF80034) /* (MCI0) MCI Transmit Data Register*/
#define AT91C_MCI0_CFG  ((AT91_REG *) 	0xFFF80054) /* (MCI0) MCI Configuration Register*/
#define AT91C_MCI0_ARGR ((AT91_REG *) 	0xFFF80010) /* (MCI0) MCI Argument Register*/
#define AT91C_MCI0_RSPR ((AT91_REG *) 	0xFFF80020) /* (MCI0) MCI Response Register*/
#define AT91C_MCI0_WPCR ((AT91_REG *) 	0xFFF800E4) /* (MCI0) MCI Write Protection Control Register*/
#define AT91C_MCI0_IDR  ((AT91_REG *) 	0xFFF80048) /* (MCI0) MCI Interrupt Disable Register*/
/* ========== Register definition for PDC_MCI1 peripheral ========== */
#define AT91C_MCI1_PTCR ((AT91_REG *) 	0xFFF84120) /* (PDC_MCI1) PDC Transfer Control Register*/
#define AT91C_MCI1_PTSR ((AT91_REG *) 	0xFFF84124) /* (PDC_MCI1) PDC Transfer Status Register*/
#define AT91C_MCI1_TPR  ((AT91_REG *) 	0xFFF84108) /* (PDC_MCI1) Transmit Pointer Register*/
#define AT91C_MCI1_RPR  ((AT91_REG *) 	0xFFF84100) /* (PDC_MCI1) Receive Pointer Register*/
#define AT91C_MCI1_TNCR ((AT91_REG *) 	0xFFF8411C) /* (PDC_MCI1) Transmit Next Counter Register*/
#define AT91C_MCI1_RCR  ((AT91_REG *) 	0xFFF84104) /* (PDC_MCI1) Receive Counter Register*/
#define AT91C_MCI1_TNPR ((AT91_REG *) 	0xFFF84118) /* (PDC_MCI1) Transmit Next Pointer Register*/
#define AT91C_MCI1_TCR  ((AT91_REG *) 	0xFFF8410C) /* (PDC_MCI1) Transmit Counter Register*/
#define AT91C_MCI1_RNPR ((AT91_REG *) 	0xFFF84110) /* (PDC_MCI1) Receive Next Pointer Register*/
#define AT91C_MCI1_RNCR ((AT91_REG *) 	0xFFF84114) /* (PDC_MCI1) Receive Next Counter Register*/
/* ========== Register definition for MCI1 peripheral ========== */
#define AT91C_MCI1_RDR  ((AT91_REG *) 	0xFFF84030) /* (MCI1) MCI Receive Data Register*/
#define AT91C_MCI1_DTOR ((AT91_REG *) 	0xFFF84008) /* (MCI1) MCI Data Timeout Register*/
#define AT91C_MCI1_FIFO ((AT91_REG *) 	0xFFF84200) /* (MCI1) MCI FIFO Aperture Register*/
#define AT91C_MCI1_WPCR ((AT91_REG *) 	0xFFF840E4) /* (MCI1) MCI Write Protection Control Register*/
#define AT91C_MCI1_DMA  ((AT91_REG *) 	0xFFF84050) /* (MCI1) MCI DMA Configuration Register*/
#define AT91C_MCI1_IDR  ((AT91_REG *) 	0xFFF84048) /* (MCI1) MCI Interrupt Disable Register*/
#define AT91C_MCI1_ARGR ((AT91_REG *) 	0xFFF84010) /* (MCI1) MCI Argument Register*/
#define AT91C_MCI1_TDR  ((AT91_REG *) 	0xFFF84034) /* (MCI1) MCI Transmit Data Register*/
#define AT91C_MCI1_CR   ((AT91_REG *) 	0xFFF84000) /* (MCI1) MCI Control Register*/
#define AT91C_MCI1_MR   ((AT91_REG *) 	0xFFF84004) /* (MCI1) MCI Mode Register*/
#define AT91C_MCI1_CSTOR ((AT91_REG *) 	0xFFF8401C) /* (MCI1) MCI Completion Signal Timeout Register*/
#define AT91C_MCI1_RSPR ((AT91_REG *) 	0xFFF84020) /* (MCI1) MCI Response Register*/
#define AT91C_MCI1_SR   ((AT91_REG *) 	0xFFF84040) /* (MCI1) MCI Status Register*/
#define AT91C_MCI1_CFG  ((AT91_REG *) 	0xFFF84054) /* (MCI1) MCI Configuration Register*/
#define AT91C_MCI1_CMDR ((AT91_REG *) 	0xFFF84014) /* (MCI1) MCI Command Register*/
#define AT91C_MCI1_IMR  ((AT91_REG *) 	0xFFF8404C) /* (MCI1) MCI Interrupt Mask Register*/
#define AT91C_MCI1_WPSR ((AT91_REG *) 	0xFFF840E8) /* (MCI1) MCI Write Protection Status Register*/
#define AT91C_MCI1_SDCR ((AT91_REG *) 	0xFFF8400C) /* (MCI1) MCI SD/SDIO Card Register*/
#define AT91C_MCI1_BLKR ((AT91_REG *) 	0xFFF84018) /* (MCI1) MCI Block Register*/
#define AT91C_MCI1_VR   ((AT91_REG *) 	0xFFF840FC) /* (MCI1) MCI Version Register*/
#define AT91C_MCI1_IER  ((AT91_REG *) 	0xFFF84044) /* (MCI1) MCI Interrupt Enable Register*/
/* ========== Register definition for PDC_TWI peripheral ========== */
#define AT91C_TWI_PTSR  ((AT91_REG *) 	0xFFF88124) /* (PDC_TWI) PDC Transfer Status Register*/
#define AT91C_TWI_RNCR  ((AT91_REG *) 	0xFFF88114) /* (PDC_TWI) Receive Next Counter Register*/
#define AT91C_TWI_RCR   ((AT91_REG *) 	0xFFF88104) /* (PDC_TWI) Receive Counter Register*/
#define AT91C_TWI_RNPR  ((AT91_REG *) 	0xFFF88110) /* (PDC_TWI) Receive Next Pointer Register*/
#define AT91C_TWI_TCR   ((AT91_REG *) 	0xFFF8810C) /* (PDC_TWI) Transmit Counter Register*/
#define AT91C_TWI_RPR   ((AT91_REG *) 	0xFFF88100) /* (PDC_TWI) Receive Pointer Register*/
#define AT91C_TWI_PTCR  ((AT91_REG *) 	0xFFF88120) /* (PDC_TWI) PDC Transfer Control Register*/
#define AT91C_TWI_TPR   ((AT91_REG *) 	0xFFF88108) /* (PDC_TWI) Transmit Pointer Register*/
#define AT91C_TWI_TNPR  ((AT91_REG *) 	0xFFF88118) /* (PDC_TWI) Transmit Next Pointer Register*/
#define AT91C_TWI_TNCR  ((AT91_REG *) 	0xFFF8811C) /* (PDC_TWI) Transmit Next Counter Register*/
/* ========== Register definition for TWI peripheral ========== */
#define AT91C_TWI_IDR   ((AT91_REG *) 	0xFFF88028) /* (TWI) Interrupt Disable Register*/
#define AT91C_TWI_RHR   ((AT91_REG *) 	0xFFF88030) /* (TWI) Receive Holding Register*/
#define AT91C_TWI_IMR   ((AT91_REG *) 	0xFFF8802C) /* (TWI) Interrupt Mask Register*/
#define AT91C_TWI_THR   ((AT91_REG *) 	0xFFF88034) /* (TWI) Transmit Holding Register*/
#define AT91C_TWI_IER   ((AT91_REG *) 	0xFFF88024) /* (TWI) Interrupt Enable Register*/
#define AT91C_TWI_IADR  ((AT91_REG *) 	0xFFF8800C) /* (TWI) Internal Address Register*/
#define AT91C_TWI_MMR   ((AT91_REG *) 	0xFFF88004) /* (TWI) Master Mode Register*/
#define AT91C_TWI_CR    ((AT91_REG *) 	0xFFF88000) /* (TWI) Control Register*/
#define AT91C_TWI_SR    ((AT91_REG *) 	0xFFF88020) /* (TWI) Status Register*/
#define AT91C_TWI_CWGR  ((AT91_REG *) 	0xFFF88010) /* (TWI) Clock Waveform Generator Register*/
/* ========== Register definition for PDC_US0 peripheral ========== */
#define AT91C_US0_TNPR  ((AT91_REG *) 	0xFFF8C118) /* (PDC_US0) Transmit Next Pointer Register*/
#define AT91C_US0_PTSR  ((AT91_REG *) 	0xFFF8C124) /* (PDC_US0) PDC Transfer Status Register*/
#define AT91C_US0_PTCR  ((AT91_REG *) 	0xFFF8C120) /* (PDC_US0) PDC Transfer Control Register*/
#define AT91C_US0_RNCR  ((AT91_REG *) 	0xFFF8C114) /* (PDC_US0) Receive Next Counter Register*/
#define AT91C_US0_RCR   ((AT91_REG *) 	0xFFF8C104) /* (PDC_US0) Receive Counter Register*/
#define AT91C_US0_TNCR  ((AT91_REG *) 	0xFFF8C11C) /* (PDC_US0) Transmit Next Counter Register*/
#define AT91C_US0_TCR   ((AT91_REG *) 	0xFFF8C10C) /* (PDC_US0) Transmit Counter Register*/
#define AT91C_US0_RNPR  ((AT91_REG *) 	0xFFF8C110) /* (PDC_US0) Receive Next Pointer Register*/
#define AT91C_US0_RPR   ((AT91_REG *) 	0xFFF8C100) /* (PDC_US0) Receive Pointer Register*/
#define AT91C_US0_TPR   ((AT91_REG *) 	0xFFF8C108) /* (PDC_US0) Transmit Pointer Register*/
/* ========== Register definition for US0 peripheral ========== */
#define AT91C_US0_RTOR  ((AT91_REG *) 	0xFFF8C024) /* (US0) Receiver Time-out Register*/
#define AT91C_US0_MAN   ((AT91_REG *) 	0xFFF8C050) /* (US0) Manchester Encoder Decoder Register*/
#define AT91C_US0_NER   ((AT91_REG *) 	0xFFF8C044) /* (US0) Nb Errors Register*/
#define AT91C_US0_THR   ((AT91_REG *) 	0xFFF8C01C) /* (US0) Transmitter Holding Register*/
#define AT91C_US0_MR    ((AT91_REG *) 	0xFFF8C004) /* (US0) Mode Register*/
#define AT91C_US0_RHR   ((AT91_REG *) 	0xFFF8C018) /* (US0) Receiver Holding Register*/
#define AT91C_US0_CSR   ((AT91_REG *) 	0xFFF8C014) /* (US0) Channel Status Register*/
#define AT91C_US0_IMR   ((AT91_REG *) 	0xFFF8C010) /* (US0) Interrupt Mask Register*/
#define AT91C_US0_IDR   ((AT91_REG *) 	0xFFF8C00C) /* (US0) Interrupt Disable Register*/
#define AT91C_US0_FIDI  ((AT91_REG *) 	0xFFF8C040) /* (US0) FI_DI_Ratio Register*/
#define AT91C_US0_CR    ((AT91_REG *) 	0xFFF8C000) /* (US0) Control Register*/
#define AT91C_US0_IER   ((AT91_REG *) 	0xFFF8C008) /* (US0) Interrupt Enable Register*/
#define AT91C_US0_TTGR  ((AT91_REG *) 	0xFFF8C028) /* (US0) Transmitter Time-guard Register*/
#define AT91C_US0_BRGR  ((AT91_REG *) 	0xFFF8C020) /* (US0) Baud Rate Generator Register*/
#define AT91C_US0_IF    ((AT91_REG *) 	0xFFF8C04C) /* (US0) IRDA_FILTER Register*/
/* ========== Register definition for PDC_US1 peripheral ========== */
#define AT91C_US1_PTCR  ((AT91_REG *) 	0xFFF90120) /* (PDC_US1) PDC Transfer Control Register*/
#define AT91C_US1_TNCR  ((AT91_REG *) 	0xFFF9011C) /* (PDC_US1) Transmit Next Counter Register*/
#define AT91C_US1_RCR   ((AT91_REG *) 	0xFFF90104) /* (PDC_US1) Receive Counter Register*/
#define AT91C_US1_RPR   ((AT91_REG *) 	0xFFF90100) /* (PDC_US1) Receive Pointer Register*/
#define AT91C_US1_TPR   ((AT91_REG *) 	0xFFF90108) /* (PDC_US1) Transmit Pointer Register*/
#define AT91C_US1_TCR   ((AT91_REG *) 	0xFFF9010C) /* (PDC_US1) Transmit Counter Register*/
#define AT91C_US1_RNPR  ((AT91_REG *) 	0xFFF90110) /* (PDC_US1) Receive Next Pointer Register*/
#define AT91C_US1_TNPR  ((AT91_REG *) 	0xFFF90118) /* (PDC_US1) Transmit Next Pointer Register*/
#define AT91C_US1_RNCR  ((AT91_REG *) 	0xFFF90114) /* (PDC_US1) Receive Next Counter Register*/
#define AT91C_US1_PTSR  ((AT91_REG *) 	0xFFF90124) /* (PDC_US1) PDC Transfer Status Register*/
/* ========== Register definition for US1 peripheral ========== */
#define AT91C_US1_NER   ((AT91_REG *) 	0xFFF90044) /* (US1) Nb Errors Register*/
#define AT91C_US1_RHR   ((AT91_REG *) 	0xFFF90018) /* (US1) Receiver Holding Register*/
#define AT91C_US1_RTOR  ((AT91_REG *) 	0xFFF90024) /* (US1) Receiver Time-out Register*/
#define AT91C_US1_IER   ((AT91_REG *) 	0xFFF90008) /* (US1) Interrupt Enable Register*/
#define AT91C_US1_IF    ((AT91_REG *) 	0xFFF9004C) /* (US1) IRDA_FILTER Register*/
#define AT91C_US1_MAN   ((AT91_REG *) 	0xFFF90050) /* (US1) Manchester Encoder Decoder Register*/
#define AT91C_US1_CR    ((AT91_REG *) 	0xFFF90000) /* (US1) Control Register*/
#define AT91C_US1_IMR   ((AT91_REG *) 	0xFFF90010) /* (US1) Interrupt Mask Register*/
#define AT91C_US1_TTGR  ((AT91_REG *) 	0xFFF90028) /* (US1) Transmitter Time-guard Register*/
#define AT91C_US1_MR    ((AT91_REG *) 	0xFFF90004) /* (US1) Mode Register*/
#define AT91C_US1_IDR   ((AT91_REG *) 	0xFFF9000C) /* (US1) Interrupt Disable Register*/
#define AT91C_US1_FIDI  ((AT91_REG *) 	0xFFF90040) /* (US1) FI_DI_Ratio Register*/
#define AT91C_US1_CSR   ((AT91_REG *) 	0xFFF90014) /* (US1) Channel Status Register*/
#define AT91C_US1_THR   ((AT91_REG *) 	0xFFF9001C) /* (US1) Transmitter Holding Register*/
#define AT91C_US1_BRGR  ((AT91_REG *) 	0xFFF90020) /* (US1) Baud Rate Generator Register*/
/* ========== Register definition for PDC_US2 peripheral ========== */
#define AT91C_US2_RNCR  ((AT91_REG *) 	0xFFF94114) /* (PDC_US2) Receive Next Counter Register*/
#define AT91C_US2_PTCR  ((AT91_REG *) 	0xFFF94120) /* (PDC_US2) PDC Transfer Control Register*/
#define AT91C_US2_TNPR  ((AT91_REG *) 	0xFFF94118) /* (PDC_US2) Transmit Next Pointer Register*/
#define AT91C_US2_TNCR  ((AT91_REG *) 	0xFFF9411C) /* (PDC_US2) Transmit Next Counter Register*/
#define AT91C_US2_TPR   ((AT91_REG *) 	0xFFF94108) /* (PDC_US2) Transmit Pointer Register*/
#define AT91C_US2_RCR   ((AT91_REG *) 	0xFFF94104) /* (PDC_US2) Receive Counter Register*/
#define AT91C_US2_PTSR  ((AT91_REG *) 	0xFFF94124) /* (PDC_US2) PDC Transfer Status Register*/
#define AT91C_US2_TCR   ((AT91_REG *) 	0xFFF9410C) /* (PDC_US2) Transmit Counter Register*/
#define AT91C_US2_RPR   ((AT91_REG *) 	0xFFF94100) /* (PDC_US2) Receive Pointer Register*/
#define AT91C_US2_RNPR  ((AT91_REG *) 	0xFFF94110) /* (PDC_US2) Receive Next Pointer Register*/
/* ========== Register definition for US2 peripheral ========== */
#define AT91C_US2_TTGR  ((AT91_REG *) 	0xFFF94028) /* (US2) Transmitter Time-guard Register*/
#define AT91C_US2_RHR   ((AT91_REG *) 	0xFFF94018) /* (US2) Receiver Holding Register*/
#define AT91C_US2_IMR   ((AT91_REG *) 	0xFFF94010) /* (US2) Interrupt Mask Register*/
#define AT91C_US2_IER   ((AT91_REG *) 	0xFFF94008) /* (US2) Interrupt Enable Register*/
#define AT91C_US2_NER   ((AT91_REG *) 	0xFFF94044) /* (US2) Nb Errors Register*/
#define AT91C_US2_CR    ((AT91_REG *) 	0xFFF94000) /* (US2) Control Register*/
#define AT91C_US2_FIDI  ((AT91_REG *) 	0xFFF94040) /* (US2) FI_DI_Ratio Register*/
#define AT91C_US2_MR    ((AT91_REG *) 	0xFFF94004) /* (US2) Mode Register*/
#define AT91C_US2_MAN   ((AT91_REG *) 	0xFFF94050) /* (US2) Manchester Encoder Decoder Register*/
#define AT91C_US2_IDR   ((AT91_REG *) 	0xFFF9400C) /* (US2) Interrupt Disable Register*/
#define AT91C_US2_THR   ((AT91_REG *) 	0xFFF9401C) /* (US2) Transmitter Holding Register*/
#define AT91C_US2_IF    ((AT91_REG *) 	0xFFF9404C) /* (US2) IRDA_FILTER Register*/
#define AT91C_US2_BRGR  ((AT91_REG *) 	0xFFF94020) /* (US2) Baud Rate Generator Register*/
#define AT91C_US2_CSR   ((AT91_REG *) 	0xFFF94014) /* (US2) Channel Status Register*/
#define AT91C_US2_RTOR  ((AT91_REG *) 	0xFFF94024) /* (US2) Receiver Time-out Register*/
/* ========== Register definition for PDC_SSC0 peripheral ========== */
#define AT91C_SSC0_PTSR ((AT91_REG *) 	0xFFF98124) /* (PDC_SSC0) PDC Transfer Status Register*/
#define AT91C_SSC0_TCR  ((AT91_REG *) 	0xFFF9810C) /* (PDC_SSC0) Transmit Counter Register*/
#define AT91C_SSC0_RNPR ((AT91_REG *) 	0xFFF98110) /* (PDC_SSC0) Receive Next Pointer Register*/
#define AT91C_SSC0_RNCR ((AT91_REG *) 	0xFFF98114) /* (PDC_SSC0) Receive Next Counter Register*/
#define AT91C_SSC0_TNPR ((AT91_REG *) 	0xFFF98118) /* (PDC_SSC0) Transmit Next Pointer Register*/
#define AT91C_SSC0_RPR  ((AT91_REG *) 	0xFFF98100) /* (PDC_SSC0) Receive Pointer Register*/
#define AT91C_SSC0_TPR  ((AT91_REG *) 	0xFFF98108) /* (PDC_SSC0) Transmit Pointer Register*/
#define AT91C_SSC0_RCR  ((AT91_REG *) 	0xFFF98104) /* (PDC_SSC0) Receive Counter Register*/
#define AT91C_SSC0_TNCR ((AT91_REG *) 	0xFFF9811C) /* (PDC_SSC0) Transmit Next Counter Register*/
#define AT91C_SSC0_PTCR ((AT91_REG *) 	0xFFF98120) /* (PDC_SSC0) PDC Transfer Control Register*/
/* ========== Register definition for SSC0 peripheral ========== */
#define AT91C_SSC0_RFMR ((AT91_REG *) 	0xFFF98014) /* (SSC0) Receive Frame Mode Register*/
#define AT91C_SSC0_RHR  ((AT91_REG *) 	0xFFF98020) /* (SSC0) Receive Holding Register*/
#define AT91C_SSC0_THR  ((AT91_REG *) 	0xFFF98024) /* (SSC0) Transmit Holding Register*/
#define AT91C_SSC0_CMR  ((AT91_REG *) 	0xFFF98004) /* (SSC0) Clock Mode Register*/
#define AT91C_SSC0_IMR  ((AT91_REG *) 	0xFFF9804C) /* (SSC0) Interrupt Mask Register*/
#define AT91C_SSC0_IDR  ((AT91_REG *) 	0xFFF98048) /* (SSC0) Interrupt Disable Register*/
#define AT91C_SSC0_IER  ((AT91_REG *) 	0xFFF98044) /* (SSC0) Interrupt Enable Register*/
#define AT91C_SSC0_TSHR ((AT91_REG *) 	0xFFF98034) /* (SSC0) Transmit Sync Holding Register*/
#define AT91C_SSC0_SR   ((AT91_REG *) 	0xFFF98040) /* (SSC0) Status Register*/
#define AT91C_SSC0_CR   ((AT91_REG *) 	0xFFF98000) /* (SSC0) Control Register*/
#define AT91C_SSC0_RCMR ((AT91_REG *) 	0xFFF98010) /* (SSC0) Receive Clock ModeRegister*/
#define AT91C_SSC0_TFMR ((AT91_REG *) 	0xFFF9801C) /* (SSC0) Transmit Frame Mode Register*/
#define AT91C_SSC0_RSHR ((AT91_REG *) 	0xFFF98030) /* (SSC0) Receive Sync Holding Register*/
#define AT91C_SSC0_TCMR ((AT91_REG *) 	0xFFF98018) /* (SSC0) Transmit Clock Mode Register*/
/* ========== Register definition for PDC_SSC1 peripheral ========== */
#define AT91C_SSC1_TNPR ((AT91_REG *) 	0xFFF9C118) /* (PDC_SSC1) Transmit Next Pointer Register*/
#define AT91C_SSC1_PTSR ((AT91_REG *) 	0xFFF9C124) /* (PDC_SSC1) PDC Transfer Status Register*/
#define AT91C_SSC1_TNCR ((AT91_REG *) 	0xFFF9C11C) /* (PDC_SSC1) Transmit Next Counter Register*/
#define AT91C_SSC1_RNCR ((AT91_REG *) 	0xFFF9C114) /* (PDC_SSC1) Receive Next Counter Register*/
#define AT91C_SSC1_TPR  ((AT91_REG *) 	0xFFF9C108) /* (PDC_SSC1) Transmit Pointer Register*/
#define AT91C_SSC1_RCR  ((AT91_REG *) 	0xFFF9C104) /* (PDC_SSC1) Receive Counter Register*/
#define AT91C_SSC1_PTCR ((AT91_REG *) 	0xFFF9C120) /* (PDC_SSC1) PDC Transfer Control Register*/
#define AT91C_SSC1_RNPR ((AT91_REG *) 	0xFFF9C110) /* (PDC_SSC1) Receive Next Pointer Register*/
#define AT91C_SSC1_TCR  ((AT91_REG *) 	0xFFF9C10C) /* (PDC_SSC1) Transmit Counter Register*/
#define AT91C_SSC1_RPR  ((AT91_REG *) 	0xFFF9C100) /* (PDC_SSC1) Receive Pointer Register*/
/* ========== Register definition for SSC1 peripheral ========== */
#define AT91C_SSC1_CMR  ((AT91_REG *) 	0xFFF9C004) /* (SSC1) Clock Mode Register*/
#define AT91C_SSC1_SR   ((AT91_REG *) 	0xFFF9C040) /* (SSC1) Status Register*/
#define AT91C_SSC1_TSHR ((AT91_REG *) 	0xFFF9C034) /* (SSC1) Transmit Sync Holding Register*/
#define AT91C_SSC1_TCMR ((AT91_REG *) 	0xFFF9C018) /* (SSC1) Transmit Clock Mode Register*/
#define AT91C_SSC1_IMR  ((AT91_REG *) 	0xFFF9C04C) /* (SSC1) Interrupt Mask Register*/
#define AT91C_SSC1_IDR  ((AT91_REG *) 	0xFFF9C048) /* (SSC1) Interrupt Disable Register*/
#define AT91C_SSC1_RCMR ((AT91_REG *) 	0xFFF9C010) /* (SSC1) Receive Clock ModeRegister*/
#define AT91C_SSC1_IER  ((AT91_REG *) 	0xFFF9C044) /* (SSC1) Interrupt Enable Register*/
#define AT91C_SSC1_RSHR ((AT91_REG *) 	0xFFF9C030) /* (SSC1) Receive Sync Holding Register*/
#define AT91C_SSC1_CR   ((AT91_REG *) 	0xFFF9C000) /* (SSC1) Control Register*/
#define AT91C_SSC1_RHR  ((AT91_REG *) 	0xFFF9C020) /* (SSC1) Receive Holding Register*/
#define AT91C_SSC1_THR  ((AT91_REG *) 	0xFFF9C024) /* (SSC1) Transmit Holding Register*/
#define AT91C_SSC1_RFMR ((AT91_REG *) 	0xFFF9C014) /* (SSC1) Receive Frame Mode Register*/
#define AT91C_SSC1_TFMR ((AT91_REG *) 	0xFFF9C01C) /* (SSC1) Transmit Frame Mode Register*/
/* ========== Register definition for PDC_AC97C peripheral ========== */
#define AT91C_AC97C_RNPR ((AT91_REG *) 	0xFFFA0110) /* (PDC_AC97C) Receive Next Pointer Register*/
#define AT91C_AC97C_TCR ((AT91_REG *) 	0xFFFA010C) /* (PDC_AC97C) Transmit Counter Register*/
#define AT91C_AC97C_TNCR ((AT91_REG *) 	0xFFFA011C) /* (PDC_AC97C) Transmit Next Counter Register*/
#define AT91C_AC97C_RCR ((AT91_REG *) 	0xFFFA0104) /* (PDC_AC97C) Receive Counter Register*/
#define AT91C_AC97C_RNCR ((AT91_REG *) 	0xFFFA0114) /* (PDC_AC97C) Receive Next Counter Register*/
#define AT91C_AC97C_PTCR ((AT91_REG *) 	0xFFFA0120) /* (PDC_AC97C) PDC Transfer Control Register*/
#define AT91C_AC97C_TPR ((AT91_REG *) 	0xFFFA0108) /* (PDC_AC97C) Transmit Pointer Register*/
#define AT91C_AC97C_RPR ((AT91_REG *) 	0xFFFA0100) /* (PDC_AC97C) Receive Pointer Register*/
#define AT91C_AC97C_PTSR ((AT91_REG *) 	0xFFFA0124) /* (PDC_AC97C) PDC Transfer Status Register*/
#define AT91C_AC97C_TNPR ((AT91_REG *) 	0xFFFA0118) /* (PDC_AC97C) Transmit Next Pointer Register*/
/* ========== Register definition for AC97C peripheral ========== */
#define AT91C_AC97C_CORHR ((AT91_REG *) 	0xFFFA0040) /* (AC97C) COdec Transmit Holding Register*/
#define AT91C_AC97C_MR  ((AT91_REG *) 	0xFFFA0008) /* (AC97C) Mode Register*/
#define AT91C_AC97C_CATHR ((AT91_REG *) 	0xFFFA0024) /* (AC97C) Channel A Transmit Holding Register*/
#define AT91C_AC97C_IER ((AT91_REG *) 	0xFFFA0054) /* (AC97C) Interrupt Enable Register*/
#define AT91C_AC97C_CASR ((AT91_REG *) 	0xFFFA0028) /* (AC97C) Channel A Status Register*/
#define AT91C_AC97C_CBTHR ((AT91_REG *) 	0xFFFA0034) /* (AC97C) Channel B Transmit Holding Register (optional)*/
#define AT91C_AC97C_ICA ((AT91_REG *) 	0xFFFA0010) /* (AC97C) Input Channel AssignementRegister*/
#define AT91C_AC97C_IMR ((AT91_REG *) 	0xFFFA005C) /* (AC97C) Interrupt Mask Register*/
#define AT91C_AC97C_IDR ((AT91_REG *) 	0xFFFA0058) /* (AC97C) Interrupt Disable Register*/
#define AT91C_AC97C_CARHR ((AT91_REG *) 	0xFFFA0020) /* (AC97C) Channel A Receive Holding Register*/
#define AT91C_AC97C_VERSION ((AT91_REG *) 	0xFFFA00FC) /* (AC97C) Version Register*/
#define AT91C_AC97C_CBRHR ((AT91_REG *) 	0xFFFA0030) /* (AC97C) Channel B Receive Holding Register (optional)*/
#define AT91C_AC97C_COTHR ((AT91_REG *) 	0xFFFA0044) /* (AC97C) COdec Transmit Holding Register*/
#define AT91C_AC97C_OCA ((AT91_REG *) 	0xFFFA0014) /* (AC97C) Output Channel Assignement Register*/
#define AT91C_AC97C_CBMR ((AT91_REG *) 	0xFFFA003C) /* (AC97C) Channel B Mode Register*/
#define AT91C_AC97C_COMR ((AT91_REG *) 	0xFFFA004C) /* (AC97C) CODEC Mask Status Register*/
#define AT91C_AC97C_CBSR ((AT91_REG *) 	0xFFFA0038) /* (AC97C) Channel B Status Register*/
#define AT91C_AC97C_COSR ((AT91_REG *) 	0xFFFA0048) /* (AC97C) CODEC Status Register*/
#define AT91C_AC97C_CAMR ((AT91_REG *) 	0xFFFA002C) /* (AC97C) Channel A Mode Register*/
#define AT91C_AC97C_SR  ((AT91_REG *) 	0xFFFA0050) /* (AC97C) Status Register*/
/* ========== Register definition for PDC_SPI0 peripheral ========== */
#define AT91C_SPI0_TPR  ((AT91_REG *) 	0xFFFA4108) /* (PDC_SPI0) Transmit Pointer Register*/
#define AT91C_SPI0_PTCR ((AT91_REG *) 	0xFFFA4120) /* (PDC_SPI0) PDC Transfer Control Register*/
#define AT91C_SPI0_RNPR ((AT91_REG *) 	0xFFFA4110) /* (PDC_SPI0) Receive Next Pointer Register*/
#define AT91C_SPI0_TNCR ((AT91_REG *) 	0xFFFA411C) /* (PDC_SPI0) Transmit Next Counter Register*/
#define AT91C_SPI0_TCR  ((AT91_REG *) 	0xFFFA410C) /* (PDC_SPI0) Transmit Counter Register*/
