una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91cap9.h
#define AT91C_SPI0_RCR  ((AT91_REG *) 	0xFFFA4104) /* (PDC_SPI0) Receive Counter Register*/
#define AT91C_SPI0_RNCR ((AT91_REG *) 	0xFFFA4114) /* (PDC_SPI0) Receive Next Counter Register*/
#define AT91C_SPI0_TNPR ((AT91_REG *) 	0xFFFA4118) /* (PDC_SPI0) Transmit Next Pointer Register*/
#define AT91C_SPI0_RPR  ((AT91_REG *) 	0xFFFA4100) /* (PDC_SPI0) Receive Pointer Register*/
#define AT91C_SPI0_PTSR ((AT91_REG *) 	0xFFFA4124) /* (PDC_SPI0) PDC Transfer Status Register*/
/* ========== Register definition for SPI0 peripheral ========== */
#define AT91C_SPI0_MR   ((AT91_REG *) 	0xFFFA4004) /* (SPI0) Mode Register*/
#define AT91C_SPI0_RDR  ((AT91_REG *) 	0xFFFA4008) /* (SPI0) Receive Data Register*/
#define AT91C_SPI0_CR   ((AT91_REG *) 	0xFFFA4000) /* (SPI0) Control Register*/
#define AT91C_SPI0_IER  ((AT91_REG *) 	0xFFFA4014) /* (SPI0) Interrupt Enable Register*/
#define AT91C_SPI0_TDR  ((AT91_REG *) 	0xFFFA400C) /* (SPI0) Transmit Data Register*/
#define AT91C_SPI0_IDR  ((AT91_REG *) 	0xFFFA4018) /* (SPI0) Interrupt Disable Register*/
#define AT91C_SPI0_CSR  ((AT91_REG *) 	0xFFFA4030) /* (SPI0) Chip Select Register*/
#define AT91C_SPI0_SR   ((AT91_REG *) 	0xFFFA4010) /* (SPI0) Status Register*/
#define AT91C_SPI0_IMR  ((AT91_REG *) 	0xFFFA401C) /* (SPI0) Interrupt Mask Register*/
/* ========== Register definition for PDC_SPI1 peripheral ========== */
#define AT91C_SPI1_RNCR ((AT91_REG *) 	0xFFFA8114) /* (PDC_SPI1) Receive Next Counter Register*/
#define AT91C_SPI1_TCR  ((AT91_REG *) 	0xFFFA810C) /* (PDC_SPI1) Transmit Counter Register*/
#define AT91C_SPI1_RCR  ((AT91_REG *) 	0xFFFA8104) /* (PDC_SPI1) Receive Counter Register*/
#define AT91C_SPI1_TNPR ((AT91_REG *) 	0xFFFA8118) /* (PDC_SPI1) Transmit Next Pointer Register*/
#define AT91C_SPI1_RNPR ((AT91_REG *) 	0xFFFA8110) /* (PDC_SPI1) Receive Next Pointer Register*/
#define AT91C_SPI1_RPR  ((AT91_REG *) 	0xFFFA8100) /* (PDC_SPI1) Receive Pointer Register*/
#define AT91C_SPI1_TNCR ((AT91_REG *) 	0xFFFA811C) /* (PDC_SPI1) Transmit Next Counter Register*/
#define AT91C_SPI1_TPR  ((AT91_REG *) 	0xFFFA8108) /* (PDC_SPI1) Transmit Pointer Register*/
#define AT91C_SPI1_PTSR ((AT91_REG *) 	0xFFFA8124) /* (PDC_SPI1) PDC Transfer Status Register*/
#define AT91C_SPI1_PTCR ((AT91_REG *) 	0xFFFA8120) /* (PDC_SPI1) PDC Transfer Control Register*/
/* ========== Register definition for SPI1 peripheral ========== */
#define AT91C_SPI1_CSR  ((AT91_REG *) 	0xFFFA8030) /* (SPI1) Chip Select Register*/
#define AT91C_SPI1_IER  ((AT91_REG *) 	0xFFFA8014) /* (SPI1) Interrupt Enable Register*/
#define AT91C_SPI1_RDR  ((AT91_REG *) 	0xFFFA8008) /* (SPI1) Receive Data Register*/
#define AT91C_SPI1_IDR  ((AT91_REG *) 	0xFFFA8018) /* (SPI1) Interrupt Disable Register*/
#define AT91C_SPI1_MR   ((AT91_REG *) 	0xFFFA8004) /* (SPI1) Mode Register*/
#define AT91C_SPI1_CR   ((AT91_REG *) 	0xFFFA8000) /* (SPI1) Control Register*/
#define AT91C_SPI1_SR   ((AT91_REG *) 	0xFFFA8010) /* (SPI1) Status Register*/
#define AT91C_SPI1_TDR  ((AT91_REG *) 	0xFFFA800C) /* (SPI1) Transmit Data Register*/
#define AT91C_SPI1_IMR  ((AT91_REG *) 	0xFFFA801C) /* (SPI1) Interrupt Mask Register*/
/* ========== Register definition for CAN_MB0 peripheral ========== */
#define AT91C_CAN_MB0_MID ((AT91_REG *) 	0xFFFAC208) /* (CAN_MB0) MailBox ID Register*/
#define AT91C_CAN_MB0_MFID ((AT91_REG *) 	0xFFFAC20C) /* (CAN_MB0) MailBox Family ID Register*/
#define AT91C_CAN_MB0_MAM ((AT91_REG *) 	0xFFFAC204) /* (CAN_MB0) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB0_MCR ((AT91_REG *) 	0xFFFAC21C) /* (CAN_MB0) MailBox Control Register*/
#define AT91C_CAN_MB0_MMR ((AT91_REG *) 	0xFFFAC200) /* (CAN_MB0) MailBox Mode Register*/
#define AT91C_CAN_MB0_MDL ((AT91_REG *) 	0xFFFAC214) /* (CAN_MB0) MailBox Data Low Register*/
#define AT91C_CAN_MB0_MDH ((AT91_REG *) 	0xFFFAC218) /* (CAN_MB0) MailBox Data High Register*/
#define AT91C_CAN_MB0_MSR ((AT91_REG *) 	0xFFFAC210) /* (CAN_MB0) MailBox Status Register*/
/* ========== Register definition for CAN_MB1 peripheral ========== */
#define AT91C_CAN_MB1_MDL ((AT91_REG *) 	0xFFFAC234) /* (CAN_MB1) MailBox Data Low Register*/
#define AT91C_CAN_MB1_MAM ((AT91_REG *) 	0xFFFAC224) /* (CAN_MB1) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB1_MID ((AT91_REG *) 	0xFFFAC228) /* (CAN_MB1) MailBox ID Register*/
#define AT91C_CAN_MB1_MMR ((AT91_REG *) 	0xFFFAC220) /* (CAN_MB1) MailBox Mode Register*/
#define AT91C_CAN_MB1_MCR ((AT91_REG *) 	0xFFFAC23C) /* (CAN_MB1) MailBox Control Register*/
#define AT91C_CAN_MB1_MFID ((AT91_REG *) 	0xFFFAC22C) /* (CAN_MB1) MailBox Family ID Register*/
#define AT91C_CAN_MB1_MSR ((AT91_REG *) 	0xFFFAC230) /* (CAN_MB1) MailBox Status Register*/
#define AT91C_CAN_MB1_MDH ((AT91_REG *) 	0xFFFAC238) /* (CAN_MB1) MailBox Data High Register*/
/* ========== Register definition for CAN_MB2 peripheral ========== */
#define AT91C_CAN_MB2_MID ((AT91_REG *) 	0xFFFAC248) /* (CAN_MB2) MailBox ID Register*/
#define AT91C_CAN_MB2_MSR ((AT91_REG *) 	0xFFFAC250) /* (CAN_MB2) MailBox Status Register*/
#define AT91C_CAN_MB2_MDL ((AT91_REG *) 	0xFFFAC254) /* (CAN_MB2) MailBox Data Low Register*/
#define AT91C_CAN_MB2_MCR ((AT91_REG *) 	0xFFFAC25C) /* (CAN_MB2) MailBox Control Register*/
#define AT91C_CAN_MB2_MDH ((AT91_REG *) 	0xFFFAC258) /* (CAN_MB2) MailBox Data High Register*/
#define AT91C_CAN_MB2_MAM ((AT91_REG *) 	0xFFFAC244) /* (CAN_MB2) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB2_MMR ((AT91_REG *) 	0xFFFAC240) /* (CAN_MB2) MailBox Mode Register*/
#define AT91C_CAN_MB2_MFID ((AT91_REG *) 	0xFFFAC24C) /* (CAN_MB2) MailBox Family ID Register*/
/* ========== Register definition for CAN_MB3 peripheral ========== */
#define AT91C_CAN_MB3_MDL ((AT91_REG *) 	0xFFFAC274) /* (CAN_MB3) MailBox Data Low Register*/
#define AT91C_CAN_MB3_MFID ((AT91_REG *) 	0xFFFAC26C) /* (CAN_MB3) MailBox Family ID Register*/
#define AT91C_CAN_MB3_MID ((AT91_REG *) 	0xFFFAC268) /* (CAN_MB3) MailBox ID Register*/
#define AT91C_CAN_MB3_MDH ((AT91_REG *) 	0xFFFAC278) /* (CAN_MB3) MailBox Data High Register*/
#define AT91C_CAN_MB3_MAM ((AT91_REG *) 	0xFFFAC264) /* (CAN_MB3) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB3_MMR ((AT91_REG *) 	0xFFFAC260) /* (CAN_MB3) MailBox Mode Register*/
#define AT91C_CAN_MB3_MCR ((AT91_REG *) 	0xFFFAC27C) /* (CAN_MB3) MailBox Control Register*/
#define AT91C_CAN_MB3_MSR ((AT91_REG *) 	0xFFFAC270) /* (CAN_MB3) MailBox Status Register*/
/* ========== Register definition for CAN_MB4 peripheral ========== */
#define AT91C_CAN_MB4_MCR ((AT91_REG *) 	0xFFFAC29C) /* (CAN_MB4) MailBox Control Register*/
#define AT91C_CAN_MB4_MDH ((AT91_REG *) 	0xFFFAC298) /* (CAN_MB4) MailBox Data High Register*/
#define AT91C_CAN_MB4_MID ((AT91_REG *) 	0xFFFAC288) /* (CAN_MB4) MailBox ID Register*/
#define AT91C_CAN_MB4_MMR ((AT91_REG *) 	0xFFFAC280) /* (CAN_MB4) MailBox Mode Register*/
#define AT91C_CAN_MB4_MSR ((AT91_REG *) 	0xFFFAC290) /* (CAN_MB4) MailBox Status Register*/
#define AT91C_CAN_MB4_MFID ((AT91_REG *) 	0xFFFAC28C) /* (CAN_MB4) MailBox Family ID Register*/
#define AT91C_CAN_MB4_MAM ((AT91_REG *) 	0xFFFAC284) /* (CAN_MB4) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB4_MDL ((AT91_REG *) 	0xFFFAC294) /* (CAN_MB4) MailBox Data Low Register*/
/* ========== Register definition for CAN_MB5 peripheral ========== */
#define AT91C_CAN_MB5_MDH ((AT91_REG *) 	0xFFFAC2B8) /* (CAN_MB5) MailBox Data High Register*/
#define AT91C_CAN_MB5_MID ((AT91_REG *) 	0xFFFAC2A8) /* (CAN_MB5) MailBox ID Register*/
#define AT91C_CAN_MB5_MCR ((AT91_REG *) 	0xFFFAC2BC) /* (CAN_MB5) MailBox Control Register*/
#define AT91C_CAN_MB5_MSR ((AT91_REG *) 	0xFFFAC2B0) /* (CAN_MB5) MailBox Status Register*/
#define AT91C_CAN_MB5_MDL ((AT91_REG *) 	0xFFFAC2B4) /* (CAN_MB5) MailBox Data Low Register*/
#define AT91C_CAN_MB5_MMR ((AT91_REG *) 	0xFFFAC2A0) /* (CAN_MB5) MailBox Mode Register*/
#define AT91C_CAN_MB5_MAM ((AT91_REG *) 	0xFFFAC2A4) /* (CAN_MB5) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB5_MFID ((AT91_REG *) 	0xFFFAC2AC) /* (CAN_MB5) MailBox Family ID Register*/
/* ========== Register definition for CAN_MB6 peripheral ========== */
#define AT91C_CAN_MB6_MSR ((AT91_REG *) 	0xFFFAC2D0) /* (CAN_MB6) MailBox Status Register*/
#define AT91C_CAN_MB6_MMR ((AT91_REG *) 	0xFFFAC2C0) /* (CAN_MB6) MailBox Mode Register*/
#define AT91C_CAN_MB6_MFID ((AT91_REG *) 	0xFFFAC2CC) /* (CAN_MB6) MailBox Family ID Register*/
#define AT91C_CAN_MB6_MDL ((AT91_REG *) 	0xFFFAC2D4) /* (CAN_MB6) MailBox Data Low Register*/
#define AT91C_CAN_MB6_MID ((AT91_REG *) 	0xFFFAC2C8) /* (CAN_MB6) MailBox ID Register*/
#define AT91C_CAN_MB6_MCR ((AT91_REG *) 	0xFFFAC2DC) /* (CAN_MB6) MailBox Control Register*/
#define AT91C_CAN_MB6_MAM ((AT91_REG *) 	0xFFFAC2C4) /* (CAN_MB6) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB6_MDH ((AT91_REG *) 	0xFFFAC2D8) /* (CAN_MB6) MailBox Data High Register*/
/* ========== Register definition for CAN_MB7 peripheral ========== */
#define AT91C_CAN_MB7_MAM ((AT91_REG *) 	0xFFFAC2E4) /* (CAN_MB7) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB7_MDH ((AT91_REG *) 	0xFFFAC2F8) /* (CAN_MB7) MailBox Data High Register*/
#define AT91C_CAN_MB7_MID ((AT91_REG *) 	0xFFFAC2E8) /* (CAN_MB7) MailBox ID Register*/
#define AT91C_CAN_MB7_MSR ((AT91_REG *) 	0xFFFAC2F0) /* (CAN_MB7) MailBox Status Register*/
#define AT91C_CAN_MB7_MMR ((AT91_REG *) 	0xFFFAC2E0) /* (CAN_MB7) MailBox Mode Register*/
#define AT91C_CAN_MB7_MCR ((AT91_REG *) 	0xFFFAC2FC) /* (CAN_MB7) MailBox Control Register*/
#define AT91C_CAN_MB7_MFID ((AT91_REG *) 	0xFFFAC2EC) /* (CAN_MB7) MailBox Family ID Register*/
#define AT91C_CAN_MB7_MDL ((AT91_REG *) 	0xFFFAC2F4) /* (CAN_MB7) MailBox Data Low Register*/
/* ========== Register definition for CAN_MB8 peripheral ========== */
#define AT91C_CAN_MB8_MDH ((AT91_REG *) 	0xFFFAC318) /* (CAN_MB8) MailBox Data High Register*/
#define AT91C_CAN_MB8_MMR ((AT91_REG *) 	0xFFFAC300) /* (CAN_MB8) MailBox Mode Register*/
#define AT91C_CAN_MB8_MCR ((AT91_REG *) 	0xFFFAC31C) /* (CAN_MB8) MailBox Control Register*/
#define AT91C_CAN_MB8_MSR ((AT91_REG *) 	0xFFFAC310) /* (CAN_MB8) MailBox Status Register*/
#define AT91C_CAN_MB8_MAM ((AT91_REG *) 	0xFFFAC304) /* (CAN_MB8) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB8_MFID ((AT91_REG *) 	0xFFFAC30C) /* (CAN_MB8) MailBox Family ID Register*/
#define AT91C_CAN_MB8_MID ((AT91_REG *) 	0xFFFAC308) /* (CAN_MB8) MailBox ID Register*/
#define AT91C_CAN_MB8_MDL ((AT91_REG *) 	0xFFFAC314) /* (CAN_MB8) MailBox Data Low Register*/
/* ========== Register definition for CAN_MB9 peripheral ========== */
#define AT91C_CAN_MB9_MID ((AT91_REG *) 	0xFFFAC328) /* (CAN_MB9) MailBox ID Register*/
#define AT91C_CAN_MB9_MMR ((AT91_REG *) 	0xFFFAC320) /* (CAN_MB9) MailBox Mode Register*/
#define AT91C_CAN_MB9_MDH ((AT91_REG *) 	0xFFFAC338) /* (CAN_MB9) MailBox Data High Register*/
#define AT91C_CAN_MB9_MSR ((AT91_REG *) 	0xFFFAC330) /* (CAN_MB9) MailBox Status Register*/
#define AT91C_CAN_MB9_MAM ((AT91_REG *) 	0xFFFAC324) /* (CAN_MB9) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB9_MDL ((AT91_REG *) 	0xFFFAC334) /* (CAN_MB9) MailBox Data Low Register*/
#define AT91C_CAN_MB9_MFID ((AT91_REG *) 	0xFFFAC32C) /* (CAN_MB9) MailBox Family ID Register*/
#define AT91C_CAN_MB9_MCR ((AT91_REG *) 	0xFFFAC33C) /* (CAN_MB9) MailBox Control Register*/
/* ========== Register definition for CAN_MB10 peripheral ========== */
#define AT91C_CAN_MB10_MCR ((AT91_REG *) 	0xFFFAC35C) /* (CAN_MB10) MailBox Control Register*/
#define AT91C_CAN_MB10_MDH ((AT91_REG *) 	0xFFFAC358) /* (CAN_MB10) MailBox Data High Register*/
#define AT91C_CAN_MB10_MAM ((AT91_REG *) 	0xFFFAC344) /* (CAN_MB10) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB10_MID ((AT91_REG *) 	0xFFFAC348) /* (CAN_MB10) MailBox ID Register*/
#define AT91C_CAN_MB10_MDL ((AT91_REG *) 	0xFFFAC354) /* (CAN_MB10) MailBox Data Low Register*/
#define AT91C_CAN_MB10_MSR ((AT91_REG *) 	0xFFFAC350) /* (CAN_MB10) MailBox Status Register*/
#define AT91C_CAN_MB10_MMR ((AT91_REG *) 	0xFFFAC340) /* (CAN_MB10) MailBox Mode Register*/
#define AT91C_CAN_MB10_MFID ((AT91_REG *) 	0xFFFAC34C) /* (CAN_MB10) MailBox Family ID Register*/
/* ========== Register definition for CAN_MB11 peripheral ========== */
#define AT91C_CAN_MB11_MSR ((AT91_REG *) 	0xFFFAC370) /* (CAN_MB11) MailBox Status Register*/
#define AT91C_CAN_MB11_MFID ((AT91_REG *) 	0xFFFAC36C) /* (CAN_MB11) MailBox Family ID Register*/
#define AT91C_CAN_MB11_MDL ((AT91_REG *) 	0xFFFAC374) /* (CAN_MB11) MailBox Data Low Register*/
#define AT91C_CAN_MB11_MDH ((AT91_REG *) 	0xFFFAC378) /* (CAN_MB11) MailBox Data High Register*/
#define AT91C_CAN_MB11_MID ((AT91_REG *) 	0xFFFAC368) /* (CAN_MB11) MailBox ID Register*/
#define AT91C_CAN_MB11_MCR ((AT91_REG *) 	0xFFFAC37C) /* (CAN_MB11) MailBox Control Register*/
#define AT91C_CAN_MB11_MMR ((AT91_REG *) 	0xFFFAC360) /* (CAN_MB11) MailBox Mode Register*/
#define AT91C_CAN_MB11_MAM ((AT91_REG *) 	0xFFFAC364) /* (CAN_MB11) MailBox Acceptance Mask Register*/
/* ========== Register definition for CAN_MB12 peripheral ========== */
#define AT91C_CAN_MB12_MAM ((AT91_REG *) 	0xFFFAC384) /* (CAN_MB12) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB12_MDH ((AT91_REG *) 	0xFFFAC398) /* (CAN_MB12) MailBox Data High Register*/
#define AT91C_CAN_MB12_MMR ((AT91_REG *) 	0xFFFAC380) /* (CAN_MB12) MailBox Mode Register*/
#define AT91C_CAN_MB12_MSR ((AT91_REG *) 	0xFFFAC390) /* (CAN_MB12) MailBox Status Register*/
#define AT91C_CAN_MB12_MFID ((AT91_REG *) 	0xFFFAC38C) /* (CAN_MB12) MailBox Family ID Register*/
#define AT91C_CAN_MB12_MID ((AT91_REG *) 	0xFFFAC388) /* (CAN_MB12) MailBox ID Register*/
#define AT91C_CAN_MB12_MCR ((AT91_REG *) 	0xFFFAC39C) /* (CAN_MB12) MailBox Control Register*/
#define AT91C_CAN_MB12_MDL ((AT91_REG *) 	0xFFFAC394) /* (CAN_MB12) MailBox Data Low Register*/
/* ========== Register definition for CAN_MB13 peripheral ========== */
#define AT91C_CAN_MB13_MDH ((AT91_REG *) 	0xFFFAC3B8) /* (CAN_MB13) MailBox Data High Register*/
#define AT91C_CAN_MB13_MFID ((AT91_REG *) 	0xFFFAC3AC) /* (CAN_MB13) MailBox Family ID Register*/
#define AT91C_CAN_MB13_MSR ((AT91_REG *) 	0xFFFAC3B0) /* (CAN_MB13) MailBox Status Register*/
#define AT91C_CAN_MB13_MID ((AT91_REG *) 	0xFFFAC3A8) /* (CAN_MB13) MailBox ID Register*/
#define AT91C_CAN_MB13_MAM ((AT91_REG *) 	0xFFFAC3A4) /* (CAN_MB13) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB13_MMR ((AT91_REG *) 	0xFFFAC3A0) /* (CAN_MB13) MailBox Mode Register*/
#define AT91C_CAN_MB13_MCR ((AT91_REG *) 	0xFFFAC3BC) /* (CAN_MB13) MailBox Control Register*/
#define AT91C_CAN_MB13_MDL ((AT91_REG *) 	0xFFFAC3B4) /* (CAN_MB13) MailBox Data Low Register*/
/* ========== Register definition for CAN_MB14 peripheral ========== */
#define AT91C_CAN_MB14_MDL ((AT91_REG *) 	0xFFFAC3D4) /* (CAN_MB14) MailBox Data Low Register*/
#define AT91C_CAN_MB14_MMR ((AT91_REG *) 	0xFFFAC3C0) /* (CAN_MB14) MailBox Mode Register*/
#define AT91C_CAN_MB14_MFID ((AT91_REG *) 	0xFFFAC3CC) /* (CAN_MB14) MailBox Family ID Register*/
#define AT91C_CAN_MB14_MCR ((AT91_REG *) 	0xFFFAC3DC) /* (CAN_MB14) MailBox Control Register*/
#define AT91C_CAN_MB14_MID ((AT91_REG *) 	0xFFFAC3C8) /* (CAN_MB14) MailBox ID Register*/
#define AT91C_CAN_MB14_MDH ((AT91_REG *) 	0xFFFAC3D8) /* (CAN_MB14) MailBox Data High Register*/
#define AT91C_CAN_MB14_MSR ((AT91_REG *) 	0xFFFAC3D0) /* (CAN_MB14) MailBox Status Register*/
#define AT91C_CAN_MB14_MAM ((AT91_REG *) 	0xFFFAC3C4) /* (CAN_MB14) MailBox Acceptance Mask Register*/
/* ========== Register definition for CAN_MB15 peripheral ========== */
#define AT91C_CAN_MB15_MDL ((AT91_REG *) 	0xFFFAC3F4) /* (CAN_MB15) MailBox Data Low Register*/
#define AT91C_CAN_MB15_MSR ((AT91_REG *) 	0xFFFAC3F0) /* (CAN_MB15) MailBox Status Register*/
#define AT91C_CAN_MB15_MID ((AT91_REG *) 	0xFFFAC3E8) /* (CAN_MB15) MailBox ID Register*/
#define AT91C_CAN_MB15_MAM ((AT91_REG *) 	0xFFFAC3E4) /* (CAN_MB15) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB15_MCR ((AT91_REG *) 	0xFFFAC3FC) /* (CAN_MB15) MailBox Control Register*/
#define AT91C_CAN_MB15_MFID ((AT91_REG *) 	0xFFFAC3EC) /* (CAN_MB15) MailBox Family ID Register*/
#define AT91C_CAN_MB15_MMR ((AT91_REG *) 	0xFFFAC3E0) /* (CAN_MB15) MailBox Mode Register*/
#define AT91C_CAN_MB15_MDH ((AT91_REG *) 	0xFFFAC3F8) /* (CAN_MB15) MailBox Data High Register*/
/* ========== Register definition for CAN peripheral ========== */
#define AT91C_CAN_ACR   ((AT91_REG *) 	0xFFFAC028) /* (CAN) Abort Command Register*/
#define AT91C_CAN_BR    ((AT91_REG *) 	0xFFFAC014) /* (CAN) Baudrate Register*/
#define AT91C_CAN_IDR   ((AT91_REG *) 	0xFFFAC008) /* (CAN) Interrupt Disable Register*/
#define AT91C_CAN_TIMESTP ((AT91_REG *) 	0xFFFAC01C) /* (CAN) Time Stamp Register*/
#define AT91C_CAN_SR    ((AT91_REG *) 	0xFFFAC010) /* (CAN) Status Register*/
#define AT91C_CAN_IMR   ((AT91_REG *) 	0xFFFAC00C) /* (CAN) Interrupt Mask Register*/
#define AT91C_CAN_TCR   ((AT91_REG *) 	0xFFFAC024) /* (CAN) Transfer Command Register*/
#define AT91C_CAN_TIM   ((AT91_REG *) 	0xFFFAC018) /* (CAN) Timer Register*/
#define AT91C_CAN_IER   ((AT91_REG *) 	0xFFFAC004) /* (CAN) Interrupt Enable Register*/
#define AT91C_CAN_ECR   ((AT91_REG *) 	0xFFFAC020) /* (CAN) Error Counter Register*/
#define AT91C_CAN_VR    ((AT91_REG *) 	0xFFFAC0FC) /* (CAN) Version Register*/
#define AT91C_CAN_MR    ((AT91_REG *) 	0xFFFAC000) /* (CAN) Mode Register*/
/* ========== Register definition for PDC_AES peripheral ========== */
#define AT91C_AES_TCR   ((AT91_REG *) 	0xFFFB010C) /* (PDC_AES) Transmit Counter Register*/
#define AT91C_AES_PTCR  ((AT91_REG *) 	0xFFFB0120) /* (PDC_AES) PDC Transfer Control Register*/
#define AT91C_AES_RNCR  ((AT91_REG *) 	0xFFFB0114) /* (PDC_AES) Receive Next Counter Register*/
#define AT91C_AES_PTSR  ((AT91_REG *) 	0xFFFB0124) /* (PDC_AES) PDC Transfer Status Register*/
#define AT91C_AES_TNCR  ((AT91_REG *) 	0xFFFB011C) /* (PDC_AES) Transmit Next Counter Register*/
#define AT91C_AES_RNPR  ((AT91_REG *) 	0xFFFB0110) /* (PDC_AES) Receive Next Pointer Register*/
#define AT91C_AES_RCR   ((AT91_REG *) 	0xFFFB0104) /* (PDC_AES) Receive Counter Register*/
#define AT91C_AES_TPR   ((AT91_REG *) 	0xFFFB0108) /* (PDC_AES) Transmit Pointer Register*/
#define AT91C_AES_TNPR  ((AT91_REG *) 	0xFFFB0118) /* (PDC_AES) Transmit Next Pointer Register*/
#define AT91C_AES_RPR   ((AT91_REG *) 	0xFFFB0100) /* (PDC_AES) Receive Pointer Register*/
/* ========== Register definition for AES peripheral ========== */
#define AT91C_AES_VR    ((AT91_REG *) 	0xFFFB00FC) /* (AES) AES Version Register*/
#define AT91C_AES_IMR   ((AT91_REG *) 	0xFFFB0018) /* (AES) Interrupt Mask Register*/
#define AT91C_AES_CR    ((AT91_REG *) 	0xFFFB0000) /* (AES) Control Register*/
#define AT91C_AES_ODATAxR ((AT91_REG *) 	0xFFFB0050) /* (AES) Output Data x Register*/
#define AT91C_AES_ISR   ((AT91_REG *) 	0xFFFB001C) /* (AES) Interrupt Status Register*/
#define AT91C_AES_IDR   ((AT91_REG *) 	0xFFFB0014) /* (AES) Interrupt Disable Register*/
#define AT91C_AES_KEYWxR ((AT91_REG *) 	0xFFFB0020) /* (AES) Key Word x Register*/
#define AT91C_AES_IVxR  ((AT91_REG *) 	0xFFFB0060) /* (AES) Initialization Vector x Register*/
#define AT91C_AES_MR    ((AT91_REG *) 	0xFFFB0004) /* (AES) Mode Register*/
#define AT91C_AES_IDATAxR ((AT91_REG *) 	0xFFFB0040) /* (AES) Input Data x Register*/
#define AT91C_AES_IER   ((AT91_REG *) 	0xFFFB0010) /* (AES) Interrupt Enable Register*/
/* ========== Register definition for PDC_TDES peripheral ========== */
#define AT91C_TDES_TCR  ((AT91_REG *) 	0xFFFB010C) /* (PDC_TDES) Transmit Counter Register*/
#define AT91C_TDES_PTCR ((AT91_REG *) 	0xFFFB0120) /* (PDC_TDES) PDC Transfer Control Register*/
#define AT91C_TDES_RNCR ((AT91_REG *) 	0xFFFB0114) /* (PDC_TDES) Receive Next Counter Register*/
#define AT91C_TDES_PTSR ((AT91_REG *) 	0xFFFB0124) /* (PDC_TDES) PDC Transfer Status Register*/
#define AT91C_TDES_TNCR ((AT91_REG *) 	0xFFFB011C) /* (PDC_TDES) Transmit Next Counter Register*/
#define AT91C_TDES_RNPR ((AT91_REG *) 	0xFFFB0110) /* (PDC_TDES) Receive Next Pointer Register*/
#define AT91C_TDES_RCR  ((AT91_REG *) 	0xFFFB0104) /* (PDC_TDES) Receive Counter Register*/
#define AT91C_TDES_TPR  ((AT91_REG *) 	0xFFFB0108) /* (PDC_TDES) Transmit Pointer Register*/
#define AT91C_TDES_TNPR ((AT91_REG *) 	0xFFFB0118) /* (PDC_TDES) Transmit Next Pointer Register*/
#define AT91C_TDES_RPR  ((AT91_REG *) 	0xFFFB0100) /* (PDC_TDES) Receive Pointer Register*/
/* ========== Register definition for TDES peripheral ========== */
#define AT91C_TDES_VR   ((AT91_REG *) 	0xFFFB00FC) /* (TDES) TDES Version Register*/
#define AT91C_TDES_IMR  ((AT91_REG *) 	0xFFFB0018) /* (TDES) Interrupt Mask Register*/
#define AT91C_TDES_CR   ((AT91_REG *) 	0xFFFB0000) /* (TDES) Control Register*/
#define AT91C_TDES_ODATAxR ((AT91_REG *) 	0xFFFB0050) /* (TDES) Output Data x Register*/
#define AT91C_TDES_ISR  ((AT91_REG *) 	0xFFFB001C) /* (TDES) Interrupt Status Register*/
#define AT91C_TDES_KEY3WxR ((AT91_REG *) 	0xFFFB0030) /* (TDES) Key 3 Word x Register*/
#define AT91C_TDES_IDR  ((AT91_REG *) 	0xFFFB0014) /* (TDES) Interrupt Disable Register*/
#define AT91C_TDES_KEY1WxR ((AT91_REG *) 	0xFFFB0020) /* (TDES) Key 1 Word x Register*/
#define AT91C_TDES_KEY2WxR ((AT91_REG *) 	0xFFFB0028) /* (TDES) Key 2 Word x Register*/
#define AT91C_TDES_IVxR ((AT91_REG *) 	0xFFFB0060) /* (TDES) Initialization Vector x Register*/
#define AT91C_TDES_MR   ((AT91_REG *) 	0xFFFB0004) /* (TDES) Mode Register*/
#define AT91C_TDES_IDATAxR ((AT91_REG *) 	0xFFFB0040) /* (TDES) Input Data x Register*/
#define AT91C_TDES_IER  ((AT91_REG *) 	0xFFFB0010) /* (TDES) Interrupt Enable Register*/
/* ========== Register definition for PWMC_CH0 peripheral ========== */
#define AT91C_PWMC_CH0_CCNTR ((AT91_REG *) 	0xFFFB820C) /* (PWMC_CH0) Channel Counter Register*/
#define AT91C_PWMC_CH0_CPRDR ((AT91_REG *) 	0xFFFB8208) /* (PWMC_CH0) Channel Period Register*/
#define AT91C_PWMC_CH0_CUPDR ((AT91_REG *) 	0xFFFB8210) /* (PWMC_CH0) Channel Update Register*/
#define AT91C_PWMC_CH0_CDTYR ((AT91_REG *) 	0xFFFB8204) /* (PWMC_CH0) Channel Duty Cycle Register*/
#define AT91C_PWMC_CH0_CMR ((AT91_REG *) 	0xFFFB8200) /* (PWMC_CH0) Channel Mode Register*/
#define AT91C_PWMC_CH0_Reserved ((AT91_REG *) 	0xFFFB8214) /* (PWMC_CH0) Reserved*/
/* ========== Register definition for PWMC_CH1 peripheral ========== */
#define AT91C_PWMC_CH1_CCNTR ((AT91_REG *) 	0xFFFB822C) /* (PWMC_CH1) Channel Counter Register*/
#define AT91C_PWMC_CH1_CDTYR ((AT91_REG *) 	0xFFFB8224) /* (PWMC_CH1) Channel Duty Cycle Register*/
#define AT91C_PWMC_CH1_CMR ((AT91_REG *) 	0xFFFB8220) /* (PWMC_CH1) Channel Mode Register*/
#define AT91C_PWMC_CH1_CPRDR ((AT91_REG *) 	0xFFFB8228) /* (PWMC_CH1) Channel Period Register*/
#define AT91C_PWMC_CH1_Reserved ((AT91_REG *) 	0xFFFB8234) /* (PWMC_CH1) Reserved*/
#define AT91C_PWMC_CH1_CUPDR ((AT91_REG *) 	0xFFFB8230) /* (PWMC_CH1) Channel Update Register*/
/* ========== Register definition for PWMC_CH2 peripheral ========== */
#define AT91C_PWMC_CH2_CUPDR ((AT91_REG *) 	0xFFFB8250) /* (PWMC_CH2) Channel Update Register*/
#define AT91C_PWMC_CH2_CMR ((AT91_REG *) 	0xFFFB8240) /* (PWMC_CH2) Channel Mode Register*/
#define AT91C_PWMC_CH2_Reserved ((AT91_REG *) 	0xFFFB8254) /* (PWMC_CH2) Reserved*/
#define AT91C_PWMC_CH2_CPRDR ((AT91_REG *) 	0xFFFB8248) /* (PWMC_CH2) Channel Period Register*/
#define AT91C_PWMC_CH2_CDTYR ((AT91_REG *) 	0xFFFB8244) /* (PWMC_CH2) Channel Duty Cycle Register*/
#define AT91C_PWMC_CH2_CCNTR ((AT91_REG *) 	0xFFFB824C) /* (PWMC_CH2) Channel Counter Register*/
/* ========== Register definition for PWMC_CH3 peripheral ========== */
