una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91cap9.h
#define AT91C_PWMC_CH3_CPRDR ((AT91_REG *) 	0xFFFB8268) /* (PWMC_CH3) Channel Period Register*/
#define AT91C_PWMC_CH3_Reserved ((AT91_REG *) 	0xFFFB8274) /* (PWMC_CH3) Reserved*/
#define AT91C_PWMC_CH3_CUPDR ((AT91_REG *) 	0xFFFB8270) /* (PWMC_CH3) Channel Update Register*/
#define AT91C_PWMC_CH3_CDTYR ((AT91_REG *) 	0xFFFB8264) /* (PWMC_CH3) Channel Duty Cycle Register*/
#define AT91C_PWMC_CH3_CCNTR ((AT91_REG *) 	0xFFFB826C) /* (PWMC_CH3) Channel Counter Register*/
#define AT91C_PWMC_CH3_CMR ((AT91_REG *) 	0xFFFB8260) /* (PWMC_CH3) Channel Mode Register*/
/* ========== Register definition for PWMC peripheral ========== */
#define AT91C_PWMC_IDR  ((AT91_REG *) 	0xFFFB8014) /* (PWMC) PWMC Interrupt Disable Register*/
#define AT91C_PWMC_MR   ((AT91_REG *) 	0xFFFB8000) /* (PWMC) PWMC Mode Register*/
#define AT91C_PWMC_VR   ((AT91_REG *) 	0xFFFB80FC) /* (PWMC) PWMC Version Register*/
#define AT91C_PWMC_IMR  ((AT91_REG *) 	0xFFFB8018) /* (PWMC) PWMC Interrupt Mask Register*/
#define AT91C_PWMC_SR   ((AT91_REG *) 	0xFFFB800C) /* (PWMC) PWMC Status Register*/
#define AT91C_PWMC_ISR  ((AT91_REG *) 	0xFFFB801C) /* (PWMC) PWMC Interrupt Status Register*/
#define AT91C_PWMC_ENA  ((AT91_REG *) 	0xFFFB8004) /* (PWMC) PWMC Enable Register*/
#define AT91C_PWMC_IER  ((AT91_REG *) 	0xFFFB8010) /* (PWMC) PWMC Interrupt Enable Register*/
#define AT91C_PWMC_DIS  ((AT91_REG *) 	0xFFFB8008) /* (PWMC) PWMC Disable Register*/
/* ========== Register definition for MACB peripheral ========== */
#define AT91C_MACB_ALE  ((AT91_REG *) 	0xFFFBC054) /* (MACB) Alignment Error Register*/
#define AT91C_MACB_RRE  ((AT91_REG *) 	0xFFFBC06C) /* (MACB) Receive Ressource Error Register*/
#define AT91C_MACB_SA4H ((AT91_REG *) 	0xFFFBC0B4) /* (MACB) Specific Address 4 Top, Last 2 bytes*/
#define AT91C_MACB_TPQ  ((AT91_REG *) 	0xFFFBC0BC) /* (MACB) Transmit Pause Quantum Register*/
#define AT91C_MACB_RJA  ((AT91_REG *) 	0xFFFBC07C) /* (MACB) Receive Jabbers Register*/
#define AT91C_MACB_SA2H ((AT91_REG *) 	0xFFFBC0A4) /* (MACB) Specific Address 2 Top, Last 2 bytes*/
#define AT91C_MACB_TPF  ((AT91_REG *) 	0xFFFBC08C) /* (MACB) Transmitted Pause Frames Register*/
#define AT91C_MACB_ROV  ((AT91_REG *) 	0xFFFBC070) /* (MACB) Receive Overrun Errors Register*/
#define AT91C_MACB_SA4L ((AT91_REG *) 	0xFFFBC0B0) /* (MACB) Specific Address 4 Bottom, First 4 bytes*/
#define AT91C_MACB_MAN  ((AT91_REG *) 	0xFFFBC034) /* (MACB) PHY Maintenance Register*/
#define AT91C_MACB_TID  ((AT91_REG *) 	0xFFFBC0B8) /* (MACB) Type ID Checking Register*/
#define AT91C_MACB_TBQP ((AT91_REG *) 	0xFFFBC01C) /* (MACB) Transmit Buffer Queue Pointer*/
#define AT91C_MACB_SA3L ((AT91_REG *) 	0xFFFBC0A8) /* (MACB) Specific Address 3 Bottom, First 4 bytes*/
#define AT91C_MACB_DTF  ((AT91_REG *) 	0xFFFBC058) /* (MACB) Deferred Transmission Frame Register*/
#define AT91C_MACB_PTR  ((AT91_REG *) 	0xFFFBC038) /* (MACB) Pause Time Register*/
#define AT91C_MACB_CSE  ((AT91_REG *) 	0xFFFBC068) /* (MACB) Carrier Sense Error Register*/
#define AT91C_MACB_ECOL ((AT91_REG *) 	0xFFFBC060) /* (MACB) Excessive Collision Register*/
#define AT91C_MACB_STE  ((AT91_REG *) 	0xFFFBC084) /* (MACB) SQE Test Error Register*/
#define AT91C_MACB_MCF  ((AT91_REG *) 	0xFFFBC048) /* (MACB) Multiple Collision Frame Register*/
#define AT91C_MACB_IER  ((AT91_REG *) 	0xFFFBC028) /* (MACB) Interrupt Enable Register*/
#define AT91C_MACB_ELE  ((AT91_REG *) 	0xFFFBC078) /* (MACB) Excessive Length Errors Register*/
#define AT91C_MACB_USRIO ((AT91_REG *) 	0xFFFBC0C0) /* (MACB) USER Input/Output Register*/
#define AT91C_MACB_PFR  ((AT91_REG *) 	0xFFFBC03C) /* (MACB) Pause Frames received Register*/
#define AT91C_MACB_FCSE ((AT91_REG *) 	0xFFFBC050) /* (MACB) Frame Check Sequence Error Register*/
#define AT91C_MACB_SA1L ((AT91_REG *) 	0xFFFBC098) /* (MACB) Specific Address 1 Bottom, First 4 bytes*/
#define AT91C_MACB_NCR  ((AT91_REG *) 	0xFFFBC000) /* (MACB) Network Control Register*/
#define AT91C_MACB_HRT  ((AT91_REG *) 	0xFFFBC094) /* (MACB) Hash Address Top[63:32]*/
#define AT91C_MACB_NCFGR ((AT91_REG *) 	0xFFFBC004) /* (MACB) Network Configuration Register*/
#define AT91C_MACB_SCF  ((AT91_REG *) 	0xFFFBC044) /* (MACB) Single Collision Frame Register*/
#define AT91C_MACB_LCOL ((AT91_REG *) 	0xFFFBC05C) /* (MACB) Late Collision Register*/
#define AT91C_MACB_SA3H ((AT91_REG *) 	0xFFFBC0AC) /* (MACB) Specific Address 3 Top, Last 2 bytes*/
#define AT91C_MACB_HRB  ((AT91_REG *) 	0xFFFBC090) /* (MACB) Hash Address Bottom[31:0]*/
#define AT91C_MACB_ISR  ((AT91_REG *) 	0xFFFBC024) /* (MACB) Interrupt Status Register*/
#define AT91C_MACB_IMR  ((AT91_REG *) 	0xFFFBC030) /* (MACB) Interrupt Mask Register*/
#define AT91C_MACB_WOL  ((AT91_REG *) 	0xFFFBC0C4) /* (MACB) Wake On LAN Register*/
#define AT91C_MACB_USF  ((AT91_REG *) 	0xFFFBC080) /* (MACB) Undersize Frames Register*/
#define AT91C_MACB_TSR  ((AT91_REG *) 	0xFFFBC014) /* (MACB) Transmit Status Register*/
#define AT91C_MACB_FRO  ((AT91_REG *) 	0xFFFBC04C) /* (MACB) Frames Received OK Register*/
#define AT91C_MACB_IDR  ((AT91_REG *) 	0xFFFBC02C) /* (MACB) Interrupt Disable Register*/
#define AT91C_MACB_SA1H ((AT91_REG *) 	0xFFFBC09C) /* (MACB) Specific Address 1 Top, Last 2 bytes*/
#define AT91C_MACB_RLE  ((AT91_REG *) 	0xFFFBC088) /* (MACB) Receive Length Field Mismatch Register*/
#define AT91C_MACB_TUND ((AT91_REG *) 	0xFFFBC064) /* (MACB) Transmit Underrun Error Register*/
#define AT91C_MACB_RSR  ((AT91_REG *) 	0xFFFBC020) /* (MACB) Receive Status Register*/
#define AT91C_MACB_SA2L ((AT91_REG *) 	0xFFFBC0A0) /* (MACB) Specific Address 2 Bottom, First 4 bytes*/
#define AT91C_MACB_FTO  ((AT91_REG *) 	0xFFFBC040) /* (MACB) Frames Transmitted OK Register*/
#define AT91C_MACB_RSE  ((AT91_REG *) 	0xFFFBC074) /* (MACB) Receive Symbol Errors Register*/
#define AT91C_MACB_NSR  ((AT91_REG *) 	0xFFFBC008) /* (MACB) Network Status Register*/
#define AT91C_MACB_RBQP ((AT91_REG *) 	0xFFFBC018) /* (MACB) Receive Buffer Queue Pointer*/
#define AT91C_MACB_REV  ((AT91_REG *) 	0xFFFBC0FC) /* (MACB) Revision Register*/
/* ========== Register definition for PDC_ADC peripheral ========== */
#define AT91C_ADC_TNPR  ((AT91_REG *) 	0xFFFC0118) /* (PDC_ADC) Transmit Next Pointer Register*/
#define AT91C_ADC_RNPR  ((AT91_REG *) 	0xFFFC0110) /* (PDC_ADC) Receive Next Pointer Register*/
#define AT91C_ADC_TCR   ((AT91_REG *) 	0xFFFC010C) /* (PDC_ADC) Transmit Counter Register*/
#define AT91C_ADC_PTCR  ((AT91_REG *) 	0xFFFC0120) /* (PDC_ADC) PDC Transfer Control Register*/
#define AT91C_ADC_PTSR  ((AT91_REG *) 	0xFFFC0124) /* (PDC_ADC) PDC Transfer Status Register*/
#define AT91C_ADC_TNCR  ((AT91_REG *) 	0xFFFC011C) /* (PDC_ADC) Transmit Next Counter Register*/
#define AT91C_ADC_TPR   ((AT91_REG *) 	0xFFFC0108) /* (PDC_ADC) Transmit Pointer Register*/
#define AT91C_ADC_RCR   ((AT91_REG *) 	0xFFFC0104) /* (PDC_ADC) Receive Counter Register*/
#define AT91C_ADC_RPR   ((AT91_REG *) 	0xFFFC0100) /* (PDC_ADC) Receive Pointer Register*/
#define AT91C_ADC_RNCR  ((AT91_REG *) 	0xFFFC0114) /* (PDC_ADC) Receive Next Counter Register*/
/* ========== Register definition for ADC peripheral ========== */
#define AT91C_ADC_CDR6  ((AT91_REG *) 	0xFFFC0048) /* (ADC) ADC Channel Data Register 6*/
#define AT91C_ADC_IMR   ((AT91_REG *) 	0xFFFC002C) /* (ADC) ADC Interrupt Mask Register*/
#define AT91C_ADC_CHER  ((AT91_REG *) 	0xFFFC0010) /* (ADC) ADC Channel Enable Register*/
#define AT91C_ADC_CDR4  ((AT91_REG *) 	0xFFFC0040) /* (ADC) ADC Channel Data Register 4*/
#define AT91C_ADC_CDR1  ((AT91_REG *) 	0xFFFC0034) /* (ADC) ADC Channel Data Register 1*/
#define AT91C_ADC_IER   ((AT91_REG *) 	0xFFFC0024) /* (ADC) ADC Interrupt Enable Register*/
#define AT91C_ADC_CHDR  ((AT91_REG *) 	0xFFFC0014) /* (ADC) ADC Channel Disable Register*/
#define AT91C_ADC_CDR2  ((AT91_REG *) 	0xFFFC0038) /* (ADC) ADC Channel Data Register 2*/
#define AT91C_ADC_LCDR  ((AT91_REG *) 	0xFFFC0020) /* (ADC) ADC Last Converted Data Register*/
#define AT91C_ADC_CR    ((AT91_REG *) 	0xFFFC0000) /* (ADC) ADC Control Register*/
#define AT91C_ADC_CDR5  ((AT91_REG *) 	0xFFFC0044) /* (ADC) ADC Channel Data Register 5*/
#define AT91C_ADC_CDR3  ((AT91_REG *) 	0xFFFC003C) /* (ADC) ADC Channel Data Register 3*/
#define AT91C_ADC_MR    ((AT91_REG *) 	0xFFFC0004) /* (ADC) ADC Mode Register*/
#define AT91C_ADC_IDR   ((AT91_REG *) 	0xFFFC0028) /* (ADC) ADC Interrupt Disable Register*/
#define AT91C_ADC_CDR0  ((AT91_REG *) 	0xFFFC0030) /* (ADC) ADC Channel Data Register 0*/
#define AT91C_ADC_CHSR  ((AT91_REG *) 	0xFFFC0018) /* (ADC) ADC Channel Status Register*/
#define AT91C_ADC_SR    ((AT91_REG *) 	0xFFFC001C) /* (ADC) ADC Status Register*/
#define AT91C_ADC_CDR7  ((AT91_REG *) 	0xFFFC004C) /* (ADC) ADC Channel Data Register 7*/
/* ========== Register definition for HISI peripheral ========== */
#define AT91C_HISI_DMAPADDR ((AT91_REG *) 	0xFFFC4044) /* (HISI) DMA Preview Base Address Register*/
#define AT91C_HISI_WPCR ((AT91_REG *) 	0xFFFC40E4) /* (HISI) Write Protection Control Register*/
#define AT91C_HISI_R2YSET1 ((AT91_REG *) 	0xFFFC401C) /* (HISI) Color Space Conversion RGB to YCrCb Register*/
#define AT91C_HISI_IDR  ((AT91_REG *) 	0xFFFC4030) /* (HISI) Interrupt Disable Register*/
#define AT91C_HISI_SR   ((AT91_REG *) 	0xFFFC4028) /* (HISI) Status Register*/
#define AT91C_HISI_WPSR ((AT91_REG *) 	0xFFFC40E8) /* (HISI) Write Protection Status Register*/
#define AT91C_HISI_VER  ((AT91_REG *) 	0xFFFC40FC) /* (HISI) Version Register*/
#define AT91C_HISI_DMACCTRL ((AT91_REG *) 	0xFFFC4054) /* (HISI) DMA Codec Control Register*/
#define AT91C_HISI_DMACHSR ((AT91_REG *) 	0xFFFC4040) /* (HISI) DMA Channel Status Register*/
#define AT91C_HISI_CFG1 ((AT91_REG *) 	0xFFFC4000) /* (HISI) Configuration Register 1*/
#define AT91C_HISI_DMACDSCR ((AT91_REG *) 	0xFFFC4058) /* (HISI) DMA Codec Descriptor Address Register*/
#define AT91C_HISI_DMACADDR ((AT91_REG *) 	0xFFFC4050) /* (HISI) DMA Codec Base Address Register*/
#define AT91C_HISI_DMACHDR ((AT91_REG *) 	0xFFFC403C) /* (HISI) DMA Channel Disable Register*/
#define AT91C_HISI_DMAPDSCR ((AT91_REG *) 	0xFFFC404C) /* (HISI) DMA Preview Descriptor Address Register*/
#define AT91C_HISI_CTRL ((AT91_REG *) 	0xFFFC4024) /* (HISI) Control Register*/
#define AT91C_HISI_IER  ((AT91_REG *) 	0xFFFC402C) /* (HISI) Interrupt Enable Register*/
#define AT91C_HISI_Y2RSET1 ((AT91_REG *) 	0xFFFC4014) /* (HISI) Color Space Conversion YCrCb to RGB Register*/
#define AT91C_HISI_PDECF ((AT91_REG *) 	0xFFFC400C) /* (HISI) Preview Decimation Factor Register*/
#define AT91C_HISI_PSIZE ((AT91_REG *) 	0xFFFC4008) /* (HISI) Preview Size Register*/
#define AT91C_HISI_DMAPCTRL ((AT91_REG *) 	0xFFFC4048) /* (HISI) DMA Preview Control Register*/
#define AT91C_HISI_R2YSET2 ((AT91_REG *) 	0xFFFC4020) /* (HISI) Color Space Conversion RGB to YCrCb Register*/
#define AT91C_HISI_R2YSET0 ((AT91_REG *) 	0xFFFC4018) /* (HISI) Color Space Conversion RGB to YCrCb Register*/
#define AT91C_HISI_Y2RSET0 ((AT91_REG *) 	0xFFFC4010) /* (HISI) Color Space Conversion YCrCb to RGB Register*/
#define AT91C_HISI_DMACHER ((AT91_REG *) 	0xFFFC4038) /* (HISI) DMA Channel Enable Register*/
#define AT91C_HISI_CFG2 ((AT91_REG *) 	0xFFFC4004) /* (HISI) Configuration Register 2*/
#define AT91C_HISI_IMR  ((AT91_REG *) 	0xFFFC4034) /* (HISI) Interrupt Mask Register*/
/* ========== Register definition for LCDC peripheral ========== */
#define AT91C_LCDC_MVAL ((AT91_REG *) 	0x00500818) /* (LCDC) LCD Mode Toggle Rate Value Register*/
#define AT91C_LCDC_PWRCON ((AT91_REG *) 	0x0050083C) /* (LCDC) Power Control Register*/
#define AT91C_LCDC_ISR  ((AT91_REG *) 	0x00500854) /* (LCDC) Interrupt Enable Register*/
#define AT91C_LCDC_FRMP1 ((AT91_REG *) 	0x00500008) /* (LCDC) DMA Frame Pointer Register 1*/
#define AT91C_LCDC_CTRSTVAL ((AT91_REG *) 	0x00500844) /* (LCDC) Contrast Value Register*/
#define AT91C_LCDC_ICR  ((AT91_REG *) 	0x00500858) /* (LCDC) Interrupt Clear Register*/
#define AT91C_LCDC_TIM1 ((AT91_REG *) 	0x00500808) /* (LCDC) LCD Timing Config 1 Register*/
#define AT91C_LCDC_DMACON ((AT91_REG *) 	0x0050001C) /* (LCDC) DMA Control Register*/
#define AT91C_LCDC_ITR  ((AT91_REG *) 	0x00500860) /* (LCDC) Interrupts Test Register*/
#define AT91C_LCDC_IDR  ((AT91_REG *) 	0x0050084C) /* (LCDC) Interrupt Disable Register*/
#define AT91C_LCDC_DP4_7 ((AT91_REG *) 	0x00500820) /* (LCDC) Dithering Pattern DP4_7 Register*/
#define AT91C_LCDC_DP5_7 ((AT91_REG *) 	0x0050082C) /* (LCDC) Dithering Pattern DP5_7 Register*/
#define AT91C_LCDC_IRR  ((AT91_REG *) 	0x00500864) /* (LCDC) Interrupts Raw Status Register*/
#define AT91C_LCDC_DP3_4 ((AT91_REG *) 	0x00500830) /* (LCDC) Dithering Pattern DP3_4 Register*/
#define AT91C_LCDC_IMR  ((AT91_REG *) 	0x00500850) /* (LCDC) Interrupt Mask Register*/
#define AT91C_LCDC_LCDFRCFG ((AT91_REG *) 	0x00500810) /* (LCDC) LCD Frame Config Register*/
#define AT91C_LCDC_CTRSTCON ((AT91_REG *) 	0x00500840) /* (LCDC) Contrast Control Register*/
#define AT91C_LCDC_DP1_2 ((AT91_REG *) 	0x0050081C) /* (LCDC) Dithering Pattern DP1_2 Register*/
#define AT91C_LCDC_FRMP2 ((AT91_REG *) 	0x0050000C) /* (LCDC) DMA Frame Pointer Register 2*/
#define AT91C_LCDC_LCDCON1 ((AT91_REG *) 	0x00500800) /* (LCDC) LCD Control 1 Register*/
#define AT91C_LCDC_DP4_5 ((AT91_REG *) 	0x00500834) /* (LCDC) Dithering Pattern DP4_5 Register*/
#define AT91C_LCDC_FRMA2 ((AT91_REG *) 	0x00500014) /* (LCDC) DMA Frame Address Register 2*/
#define AT91C_LCDC_BA1  ((AT91_REG *) 	0x00500000) /* (LCDC) DMA Base Address Register 1*/
#define AT91C_LCDC_DMA2DCFG ((AT91_REG *) 	0x00500020) /* (LCDC) DMA 2D addressing configuration*/
#define AT91C_LCDC_LUT_ENTRY ((AT91_REG *) 	0x00500C00) /* (LCDC) LUT Entries Register*/
#define AT91C_LCDC_DP6_7 ((AT91_REG *) 	0x00500838) /* (LCDC) Dithering Pattern DP6_7 Register*/
#define AT91C_LCDC_FRMCFG ((AT91_REG *) 	0x00500018) /* (LCDC) DMA Frame Configuration Register*/
#define AT91C_LCDC_TIM2 ((AT91_REG *) 	0x0050080C) /* (LCDC) LCD Timing Config 2 Register*/
#define AT91C_LCDC_DP3_5 ((AT91_REG *) 	0x00500824) /* (LCDC) Dithering Pattern DP3_5 Register*/
#define AT91C_LCDC_FRMA1 ((AT91_REG *) 	0x00500010) /* (LCDC) DMA Frame Address Register 1*/
#define AT91C_LCDC_IER  ((AT91_REG *) 	0x00500848) /* (LCDC) Interrupt Enable Register*/
#define AT91C_LCDC_DP2_3 ((AT91_REG *) 	0x00500828) /* (LCDC) Dithering Pattern DP2_3 Register*/
#define AT91C_LCDC_FIFO ((AT91_REG *) 	0x00500814) /* (LCDC) LCD FIFO Register*/
#define AT91C_LCDC_BA2  ((AT91_REG *) 	0x00500004) /* (LCDC) DMA Base Address Register 2*/
#define AT91C_LCDC_LCDCON2 ((AT91_REG *) 	0x00500804) /* (LCDC) LCD Control 2 Register*/
#define AT91C_LCDC_GPR  ((AT91_REG *) 	0x0050085C) /* (LCDC) General Purpose Register*/
/* ========== Register definition for HDMA_CH_0 peripheral ========== */
#define AT91C_HDMA_CH_0_DADDR ((AT91_REG *) 	0xFFFFEC40) /* (HDMA_CH_0) HDMA Channel Destination Address Register*/
#define AT91C_HDMA_CH_0_DPIP ((AT91_REG *) 	0xFFFFEC58) /* (HDMA_CH_0) HDMA Channel Destination Picture in Picture Configuration Register*/
#define AT91C_HDMA_CH_0_DSCR ((AT91_REG *) 	0xFFFFEC44) /* (HDMA_CH_0) HDMA Channel Descriptor Address Register*/
#define AT91C_HDMA_CH_0_CFG ((AT91_REG *) 	0xFFFFEC50) /* (HDMA_CH_0) HDMA Channel Configuration Register*/
#define AT91C_HDMA_CH_0_SPIP ((AT91_REG *) 	0xFFFFEC54) /* (HDMA_CH_0) HDMA Channel Source Picture in Picture Configuration Register*/
#define AT91C_HDMA_CH_0_CTRLA ((AT91_REG *) 	0xFFFFEC48) /* (HDMA_CH_0) HDMA Channel Control A Register*/
#define AT91C_HDMA_CH_0_CTRLB ((AT91_REG *) 	0xFFFFEC4C) /* (HDMA_CH_0) HDMA Channel Control B Register*/
#define AT91C_HDMA_CH_0_SADDR ((AT91_REG *) 	0xFFFFEC3C) /* (HDMA_CH_0) HDMA Channel Source Address Register*/
/* ========== Register definition for HDMA_CH_1 peripheral ========== */
#define AT91C_HDMA_CH_1_DPIP ((AT91_REG *) 	0xFFFFEC80) /* (HDMA_CH_1) HDMA Channel Destination Picture in Picture Configuration Register*/
#define AT91C_HDMA_CH_1_CTRLB ((AT91_REG *) 	0xFFFFEC74) /* (HDMA_CH_1) HDMA Channel Control B Register*/
#define AT91C_HDMA_CH_1_SADDR ((AT91_REG *) 	0xFFFFEC64) /* (HDMA_CH_1) HDMA Channel Source Address Register*/
#define AT91C_HDMA_CH_1_CFG ((AT91_REG *) 	0xFFFFEC78) /* (HDMA_CH_1) HDMA Channel Configuration Register*/
#define AT91C_HDMA_CH_1_DSCR ((AT91_REG *) 	0xFFFFEC6C) /* (HDMA_CH_1) HDMA Channel Descriptor Address Register*/
#define AT91C_HDMA_CH_1_DADDR ((AT91_REG *) 	0xFFFFEC68) /* (HDMA_CH_1) HDMA Channel Destination Address Register*/
#define AT91C_HDMA_CH_1_CTRLA ((AT91_REG *) 	0xFFFFEC70) /* (HDMA_CH_1) HDMA Channel Control A Register*/
#define AT91C_HDMA_CH_1_SPIP ((AT91_REG *) 	0xFFFFEC7C) /* (HDMA_CH_1) HDMA Channel Source Picture in Picture Configuration Register*/
/* ========== Register definition for HDMA_CH_2 peripheral ========== */
#define AT91C_HDMA_CH_2_DSCR ((AT91_REG *) 	0xFFFFEC94) /* (HDMA_CH_2) HDMA Channel Descriptor Address Register*/
#define AT91C_HDMA_CH_2_CTRLA ((AT91_REG *) 	0xFFFFEC98) /* (HDMA_CH_2) HDMA Channel Control A Register*/
#define AT91C_HDMA_CH_2_SADDR ((AT91_REG *) 	0xFFFFEC8C) /* (HDMA_CH_2) HDMA Channel Source Address Register*/
#define AT91C_HDMA_CH_2_CFG ((AT91_REG *) 	0xFFFFECA0) /* (HDMA_CH_2) HDMA Channel Configuration Register*/
#define AT91C_HDMA_CH_2_DPIP ((AT91_REG *) 	0xFFFFECA8) /* (HDMA_CH_2) HDMA Channel Destination Picture in Picture Configuration Register*/
#define AT91C_HDMA_CH_2_SPIP ((AT91_REG *) 	0xFFFFECA4) /* (HDMA_CH_2) HDMA Channel Source Picture in Picture Configuration Register*/
#define AT91C_HDMA_CH_2_CTRLB ((AT91_REG *) 	0xFFFFEC9C) /* (HDMA_CH_2) HDMA Channel Control B Register*/
#define AT91C_HDMA_CH_2_DADDR ((AT91_REG *) 	0xFFFFEC90) /* (HDMA_CH_2) HDMA Channel Destination Address Register*/
/* ========== Register definition for HDMA_CH_3 peripheral ========== */
#define AT91C_HDMA_CH_3_SPIP ((AT91_REG *) 	0xFFFFECCC) /* (HDMA_CH_3) HDMA Channel Source Picture in Picture Configuration Register*/
#define AT91C_HDMA_CH_3_CTRLA ((AT91_REG *) 	0xFFFFECC0) /* (HDMA_CH_3) HDMA Channel Control A Register*/
#define AT91C_HDMA_CH_3_DPIP ((AT91_REG *) 	0xFFFFECD0) /* (HDMA_CH_3) HDMA Channel Destination Picture in Picture Configuration Register*/
#define AT91C_HDMA_CH_3_CTRLB ((AT91_REG *) 	0xFFFFECC4) /* (HDMA_CH_3) HDMA Channel Control B Register*/
#define AT91C_HDMA_CH_3_DSCR ((AT91_REG *) 	0xFFFFECBC) /* (HDMA_CH_3) HDMA Channel Descriptor Address Register*/
#define AT91C_HDMA_CH_3_CFG ((AT91_REG *) 	0xFFFFECC8) /* (HDMA_CH_3) HDMA Channel Configuration Register*/
#define AT91C_HDMA_CH_3_DADDR ((AT91_REG *) 	0xFFFFECB8) /* (HDMA_CH_3) HDMA Channel Destination Address Register*/
#define AT91C_HDMA_CH_3_SADDR ((AT91_REG *) 	0xFFFFECB4) /* (HDMA_CH_3) HDMA Channel Source Address Register*/
/* ========== Register definition for HDMA peripheral ========== */
#define AT91C_HDMA_EBCIDR ((AT91_REG *) 	0xFFFFEC1C) /* (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Interrupt Disable register*/
#define AT91C_HDMA_LAST ((AT91_REG *) 	0xFFFFEC10) /* (HDMA) HDMA Software Last Transfer Flag Register*/
#define AT91C_HDMA_SREQ ((AT91_REG *) 	0xFFFFEC08) /* (HDMA) HDMA Software Single Request Register*/
#define AT91C_HDMA_EBCIER ((AT91_REG *) 	0xFFFFEC18) /* (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Interrupt Enable register*/
#define AT91C_HDMA_GCFG ((AT91_REG *) 	0xFFFFEC00) /* (HDMA) HDMA Global Configuration Register*/
#define AT91C_HDMA_CHER ((AT91_REG *) 	0xFFFFEC28) /* (HDMA) HDMA Channel Handler Enable Register*/
#define AT91C_HDMA_CHDR ((AT91_REG *) 	0xFFFFEC2C) /* (HDMA) HDMA Channel Handler Disable Register*/
#define AT91C_HDMA_EBCIMR ((AT91_REG *) 	0xFFFFEC20) /* (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Mask Register*/
#define AT91C_HDMA_BREQ ((AT91_REG *) 	0xFFFFEC0C) /* (HDMA) HDMA Software Chunk Transfer Request Register*/
#define AT91C_HDMA_SYNC ((AT91_REG *) 	0xFFFFEC14) /* (HDMA) HDMA Request Synchronization Register*/
#define AT91C_HDMA_EN   ((AT91_REG *) 	0xFFFFEC04) /* (HDMA) HDMA Controller Enable Register*/
#define AT91C_HDMA_EBCISR ((AT91_REG *) 	0xFFFFEC24) /* (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Status Register*/
#define AT91C_HDMA_CHSR ((AT91_REG *) 	0xFFFFEC30) /* (HDMA) HDMA Channel Handler Status Register*/
/* ========== Register definition for SYS peripheral ========== */
#define AT91C_SYS_SLCKSEL ((AT91_REG *) 	0xFFFFFD50) /* (SYS) Slow Clock Selection Register*/
#define AT91C_SYS_GPBR  ((AT91_REG *) 	0xFFFFFD60) /* (SYS) General Purpose Register*/
/* ========== Register definition for UHP peripheral ========== */
#define AT91C_UHP_HcRhPortStatus ((AT91_REG *) 	0x00700054) /* (UHP) Root Hub Port Status Register*/
#define AT91C_UHP_HcFmRemaining ((AT91_REG *) 	0x00700038) /* (UHP) Bit time remaining in the current Frame*/
#define AT91C_UHP_HcInterruptEnable ((AT91_REG *) 	0x00700010) /* (UHP) Interrupt Enable Register*/
#define AT91C_UHP_HcControl ((AT91_REG *) 	0x00700004) /* (UHP) Operating modes for the Host Controller*/
#define AT91C_UHP_HcPeriodicStart ((AT91_REG *) 	0x00700040) /* (UHP) Periodic Start*/
#define AT91C_UHP_HcInterruptStatus ((AT91_REG *) 	0x0070000C) /* (UHP) Interrupt Status Register*/
#define AT91C_UHP_HcRhDescriptorB ((AT91_REG *) 	0x0070004C) /* (UHP) Root Hub characteristics B*/
#define AT91C_UHP_HcInterruptDisable ((AT91_REG *) 	0x00700014) /* (UHP) Interrupt Disable Register*/
#define AT91C_UHP_HcPeriodCurrentED ((AT91_REG *) 	0x0070001C) /* (UHP) Current Isochronous or Interrupt Endpoint Descriptor*/
#define AT91C_UHP_HcRhDescriptorA ((AT91_REG *) 	0x00700048) /* (UHP) Root Hub characteristics A*/
#define AT91C_UHP_HcRhStatus ((AT91_REG *) 	0x00700050) /* (UHP) Root Hub Status register*/
#define AT91C_UHP_HcBulkCurrentED ((AT91_REG *) 	0x0070002C) /* (UHP) Current endpoint of the Bulk list*/
#define AT91C_UHP_HcControlHeadED ((AT91_REG *) 	0x00700020) /* (UHP) First Endpoint Descriptor of the Control list*/
#define AT91C_UHP_HcLSThreshold ((AT91_REG *) 	0x00700044) /* (UHP) LS Threshold*/
#define AT91C_UHP_HcRevision ((AT91_REG *) 	0x00700000) /* (UHP) Revision*/
#define AT91C_UHP_HcBulkDoneHead ((AT91_REG *) 	0x00700030) /* (UHP) Last completed transfer descriptor*/
#define AT91C_UHP_HcFmNumber ((AT91_REG *) 	0x0070003C) /* (UHP) Frame number*/
#define AT91C_UHP_HcFmInterval ((AT91_REG *) 	0x00700034) /* (UHP) Bit time between 2 consecutive SOFs*/
#define AT91C_UHP_HcBulkHeadED ((AT91_REG *) 	0x00700028) /* (UHP) First endpoint register of the Bulk list*/
#define AT91C_UHP_HcHCCA ((AT91_REG *) 	0x00700018) /* (UHP) Pointer to the Host Controller Communication Area*/
#define AT91C_UHP_HcCommandStatus ((AT91_REG *) 	0x00700008) /* (UHP) Command & status Register*/
#define AT91C_UHP_HcControlCurrentED ((AT91_REG *) 	0x00700024) /* (UHP) Endpoint Control and Status Register*/

