una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91cap9.h
/* ******************************************************************************/
/*               PIO DEFINITIONS FOR AT91CAP9_UMC*/
/* ******************************************************************************/
#define AT91C_PIO_PA0        ((unsigned int) 1 <<  0) /* Pin Controlled by PA0*/
#define AT91C_PA0_MCI0_DA0 ((unsigned int) AT91C_PIO_PA0) /*  */
#define AT91C_PA0_SPI0_MISO ((unsigned int) AT91C_PIO_PA0) /*  */
#define AT91C_PIO_PA1        ((unsigned int) 1 <<  1) /* Pin Controlled by PA1*/
#define AT91C_PA1_MCI0_CDA ((unsigned int) AT91C_PIO_PA1) /*  */
#define AT91C_PA1_SPI0_MOSI ((unsigned int) AT91C_PIO_PA1) /*  */
#define AT91C_PIO_PA10       ((unsigned int) 1 << 10) /* Pin Controlled by PA10*/
#define AT91C_PA10_IRQ0     ((unsigned int) AT91C_PIO_PA10) /*  */
#define AT91C_PA10_PWM1     ((unsigned int) AT91C_PIO_PA10) /*  */
#define AT91C_PIO_PA11       ((unsigned int) 1 << 11) /* Pin Controlled by PA11*/
#define AT91C_PA11_DMARQ0   ((unsigned int) AT91C_PIO_PA11) /*  */
#define AT91C_PA11_PWM3     ((unsigned int) AT91C_PIO_PA11) /*  */
#define AT91C_PIO_PA12       ((unsigned int) 1 << 12) /* Pin Controlled by PA12*/
#define AT91C_PA12_CANTX    ((unsigned int) AT91C_PIO_PA12) /*  */
#define AT91C_PA12_PCK0     ((unsigned int) AT91C_PIO_PA12) /*  */
#define AT91C_PIO_PA13       ((unsigned int) 1 << 13) /* Pin Controlled by PA13*/
#define AT91C_PA13_CANRX    ((unsigned int) AT91C_PIO_PA13) /*  */
#define AT91C_PIO_PA14       ((unsigned int) 1 << 14) /* Pin Controlled by PA14*/
#define AT91C_PA14_TCLK2    ((unsigned int) AT91C_PIO_PA14) /*  */
#define AT91C_PA14_IRQ1     ((unsigned int) AT91C_PIO_PA14) /*  */
#define AT91C_PIO_PA15       ((unsigned int) 1 << 15) /* Pin Controlled by PA15*/
#define AT91C_PA15_DMARQ3   ((unsigned int) AT91C_PIO_PA15) /*  */
#define AT91C_PA15_PCK2     ((unsigned int) AT91C_PIO_PA15) /*  */
#define AT91C_PIO_PA16       ((unsigned int) 1 << 16) /* Pin Controlled by PA16*/
#define AT91C_PA16_MCI1_CK  ((unsigned int) AT91C_PIO_PA16) /*  */
#define AT91C_PA16_ISI_D0   ((unsigned int) AT91C_PIO_PA16) /*  */
#define AT91C_PIO_PA17       ((unsigned int) 1 << 17) /* Pin Controlled by PA17*/
#define AT91C_PA17_MCI1_CDA ((unsigned int) AT91C_PIO_PA17) /*  */
#define AT91C_PA17_ISI_D1   ((unsigned int) AT91C_PIO_PA17) /*  */
#define AT91C_PIO_PA18       ((unsigned int) 1 << 18) /* Pin Controlled by PA18*/
#define AT91C_PA18_MCI1_DA0 ((unsigned int) AT91C_PIO_PA18) /*  */
#define AT91C_PA18_ISI_D2   ((unsigned int) AT91C_PIO_PA18) /*  */
#define AT91C_PIO_PA19       ((unsigned int) 1 << 19) /* Pin Controlled by PA19*/
#define AT91C_PA19_MCI1_DA1 ((unsigned int) AT91C_PIO_PA19) /*  */
#define AT91C_PA19_ISI_D3   ((unsigned int) AT91C_PIO_PA19) /*  */
#define AT91C_PIO_PA2        ((unsigned int) 1 <<  2) /* Pin Controlled by PA2*/
#define AT91C_PA2_MCI0_CK  ((unsigned int) AT91C_PIO_PA2) /*  */
#define AT91C_PA2_SPI0_SPCK ((unsigned int) AT91C_PIO_PA2) /*  */
#define AT91C_PIO_PA20       ((unsigned int) 1 << 20) /* Pin Controlled by PA20*/
#define AT91C_PA20_MCI1_DA2 ((unsigned int) AT91C_PIO_PA20) /*  */
#define AT91C_PA20_ISI_D4   ((unsigned int) AT91C_PIO_PA20) /*  */
#define AT91C_PIO_PA21       ((unsigned int) 1 << 21) /* Pin Controlled by PA21*/
#define AT91C_PA21_MCI1_DA3 ((unsigned int) AT91C_PIO_PA21) /*  */
#define AT91C_PA21_ISI_D5   ((unsigned int) AT91C_PIO_PA21) /*  */
#define AT91C_PIO_PA22       ((unsigned int) 1 << 22) /* Pin Controlled by PA22*/
#define AT91C_PA22_TXD0     ((unsigned int) AT91C_PIO_PA22) /*  */
#define AT91C_PA22_ISI_D6   ((unsigned int) AT91C_PIO_PA22) /*  */
#define AT91C_PIO_PA23       ((unsigned int) 1 << 23) /* Pin Controlled by PA23*/
#define AT91C_PA23_RXD0     ((unsigned int) AT91C_PIO_PA23) /*  */
#define AT91C_PA23_ISI_D7   ((unsigned int) AT91C_PIO_PA23) /*  */
#define AT91C_PIO_PA24       ((unsigned int) 1 << 24) /* Pin Controlled by PA24*/
#define AT91C_PA24_RTS0     ((unsigned int) AT91C_PIO_PA24) /*  */
#define AT91C_PA24_ISI_PCK  ((unsigned int) AT91C_PIO_PA24) /*  */
#define AT91C_PIO_PA25       ((unsigned int) 1 << 25) /* Pin Controlled by PA25*/
#define AT91C_PA25_CTS0     ((unsigned int) AT91C_PIO_PA25) /*  */
#define AT91C_PA25_ISI_HSYNC ((unsigned int) AT91C_PIO_PA25) /*  */
#define AT91C_PIO_PA26       ((unsigned int) 1 << 26) /* Pin Controlled by PA26*/
#define AT91C_PA26_SCK0     ((unsigned int) AT91C_PIO_PA26) /*  */
#define AT91C_PA26_ISI_VSYNC ((unsigned int) AT91C_PIO_PA26) /*  */
#define AT91C_PIO_PA27       ((unsigned int) 1 << 27) /* Pin Controlled by PA27*/
#define AT91C_PA27_PCK1     ((unsigned int) AT91C_PIO_PA27) /*  */
#define AT91C_PA27_ISI_MCK  ((unsigned int) AT91C_PIO_PA27) /*  */
#define AT91C_PIO_PA28       ((unsigned int) 1 << 28) /* Pin Controlled by PA28*/
#define AT91C_PA28_SPI0_NPCS3A ((unsigned int) AT91C_PIO_PA28) /*  */
#define AT91C_PA28_ISI_D8   ((unsigned int) AT91C_PIO_PA28) /*  */
#define AT91C_PIO_PA29       ((unsigned int) 1 << 29) /* Pin Controlled by PA29*/
#define AT91C_PA29_TIOA0    ((unsigned int) AT91C_PIO_PA29) /*  */
#define AT91C_PA29_ISI_D9   ((unsigned int) AT91C_PIO_PA29) /*  */
#define AT91C_PIO_PA3        ((unsigned int) 1 <<  3) /* Pin Controlled by PA3*/
#define AT91C_PA3_MCI0_DA1 ((unsigned int) AT91C_PIO_PA3) /*  */
#define AT91C_PA3_SPI0_NPCS1 ((unsigned int) AT91C_PIO_PA3) /*  */
#define AT91C_PIO_PA30       ((unsigned int) 1 << 30) /* Pin Controlled by PA30*/
#define AT91C_PA30_TIOB0    ((unsigned int) AT91C_PIO_PA30) /*  */
#define AT91C_PA30_ISI_D10  ((unsigned int) AT91C_PIO_PA30) /*  */
#define AT91C_PIO_PA31       ((unsigned int) 1 << 31) /* Pin Controlled by PA31*/
#define AT91C_PA31_DMARQ1   ((unsigned int) AT91C_PIO_PA31) /*  */
#define AT91C_PA31_ISI_D11  ((unsigned int) AT91C_PIO_PA31) /*  */
#define AT91C_PIO_PA4        ((unsigned int) 1 <<  4) /* Pin Controlled by PA4*/
#define AT91C_PA4_MCI0_DA2 ((unsigned int) AT91C_PIO_PA4) /*  */
#define AT91C_PA4_SPI0_NPCS2A ((unsigned int) AT91C_PIO_PA4) /*  */
#define AT91C_PIO_PA5        ((unsigned int) 1 <<  5) /* Pin Controlled by PA5*/
#define AT91C_PA5_MCI0_DA3 ((unsigned int) AT91C_PIO_PA5) /*  */
#define AT91C_PA5_SPI0_NPCS0 ((unsigned int) AT91C_PIO_PA5) /*  */
#define AT91C_PIO_PA6        ((unsigned int) 1 <<  6) /* Pin Controlled by PA6*/
#define AT91C_PA6_AC97FS   ((unsigned int) AT91C_PIO_PA6) /*  */
#define AT91C_PIO_PA7        ((unsigned int) 1 <<  7) /* Pin Controlled by PA7*/
#define AT91C_PA7_AC97CK   ((unsigned int) AT91C_PIO_PA7) /*  */
#define AT91C_PIO_PA8        ((unsigned int) 1 <<  8) /* Pin Controlled by PA8*/
#define AT91C_PA8_AC97TX   ((unsigned int) AT91C_PIO_PA8) /*  */
#define AT91C_PIO_PA9        ((unsigned int) 1 <<  9) /* Pin Controlled by PA9*/
#define AT91C_PA9_AC97RX   ((unsigned int) AT91C_PIO_PA9) /*  */
#define AT91C_PIO_PB0        ((unsigned int) 1 <<  0) /* Pin Controlled by PB0*/
#define AT91C_PB0_TF0      ((unsigned int) AT91C_PIO_PB0) /*  */
#define AT91C_PIO_PB1        ((unsigned int) 1 <<  1) /* Pin Controlled by PB1*/
#define AT91C_PB1_TK0      ((unsigned int) AT91C_PIO_PB1) /*  */
#define AT91C_PIO_PB10       ((unsigned int) 1 << 10) /* Pin Controlled by PB10*/
#define AT91C_PB10_RK1      ((unsigned int) AT91C_PIO_PB10) /*  */
#define AT91C_PB10_PCK1     ((unsigned int) AT91C_PIO_PB10) /*  */
#define AT91C_PIO_PB11       ((unsigned int) 1 << 11) /* Pin Controlled by PB11*/
#define AT91C_PB11_RF1      ((unsigned int) AT91C_PIO_PB11) /*  */
#define AT91C_PIO_PB12       ((unsigned int) 1 << 12) /* Pin Controlled by PB12*/
#define AT91C_PB12_SPI1_MISO ((unsigned int) AT91C_PIO_PB12) /*  */
#define AT91C_PIO_PB13       ((unsigned int) 1 << 13) /* Pin Controlled by PB13*/
#define AT91C_PB13_SPI1_MOSI ((unsigned int) AT91C_PIO_PB13) /*  */
#define AT91C_PB13_AD0      ((unsigned int) AT91C_PIO_PB13) /*  */
#define AT91C_PIO_PB14       ((unsigned int) 1 << 14) /* Pin Controlled by PB14*/
#define AT91C_PB14_SPI1_SPCK ((unsigned int) AT91C_PIO_PB14) /*  */
#define AT91C_PB14_AD1      ((unsigned int) AT91C_PIO_PB14) /*  */
#define AT91C_PIO_PB15       ((unsigned int) 1 << 15) /* Pin Controlled by PB15*/
#define AT91C_PB15_SPI1_NPCS0 ((unsigned int) AT91C_PIO_PB15) /*  */
#define AT91C_PB15_AD2      ((unsigned int) AT91C_PIO_PB15) /*  */
#define AT91C_PIO_PB16       ((unsigned int) 1 << 16) /* Pin Controlled by PB16*/
#define AT91C_PB16_SPI1_NPCS1 ((unsigned int) AT91C_PIO_PB16) /*  */
#define AT91C_PB16_AD3      ((unsigned int) AT91C_PIO_PB16) /*  */
#define AT91C_PIO_PB17       ((unsigned int) 1 << 17) /* Pin Controlled by PB17*/
#define AT91C_PB17_SPI1_NPCS2B ((unsigned int) AT91C_PIO_PB17) /*  */
#define AT91C_PB17_AD4      ((unsigned int) AT91C_PIO_PB17) /*  */
#define AT91C_PIO_PB18       ((unsigned int) 1 << 18) /* Pin Controlled by PB18*/
#define AT91C_PB18_SPI1_NPCS3B ((unsigned int) AT91C_PIO_PB18) /*  */
#define AT91C_PB18_AD5      ((unsigned int) AT91C_PIO_PB18) /*  */
#define AT91C_PIO_PB19       ((unsigned int) 1 << 19) /* Pin Controlled by PB19*/
#define AT91C_PB19_PWM0     ((unsigned int) AT91C_PIO_PB19) /*  */
#define AT91C_PB19_AD6      ((unsigned int) AT91C_PIO_PB19) /*  */
#define AT91C_PIO_PB2        ((unsigned int) 1 <<  2) /* Pin Controlled by PB2*/
#define AT91C_PB2_TD0      ((unsigned int) AT91C_PIO_PB2) /*  */
#define AT91C_PIO_PB20       ((unsigned int) 1 << 20) /* Pin Controlled by PB20*/
#define AT91C_PB20_PWM1     ((unsigned int) AT91C_PIO_PB20) /*  */
#define AT91C_PB20_AD7      ((unsigned int) AT91C_PIO_PB20) /*  */
#define AT91C_PIO_PB21       ((unsigned int) 1 << 21) /* Pin Controlled by PB21*/
#define AT91C_PB21_E_TXCK   ((unsigned int) AT91C_PIO_PB21) /*  */
#define AT91C_PB21_TIOA2    ((unsigned int) AT91C_PIO_PB21) /*  */
#define AT91C_PIO_PB22       ((unsigned int) 1 << 22) /* Pin Controlled by PB22*/
#define AT91C_PB22_E_RXDV   ((unsigned int) AT91C_PIO_PB22) /*  */
#define AT91C_PB22_TIOB2    ((unsigned int) AT91C_PIO_PB22) /*  */
#define AT91C_PIO_PB23       ((unsigned int) 1 << 23) /* Pin Controlled by PB23*/
#define AT91C_PB23_E_TX0    ((unsigned int) AT91C_PIO_PB23) /*  */
#define AT91C_PB23_PCK3     ((unsigned int) AT91C_PIO_PB23) /*  */
#define AT91C_PIO_PB24       ((unsigned int) 1 << 24) /* Pin Controlled by PB24*/
#define AT91C_PB24_E_TX1    ((unsigned int) AT91C_PIO_PB24) /*  */
#define AT91C_PIO_PB25       ((unsigned int) 1 << 25) /* Pin Controlled by PB25*/
#define AT91C_PB25_E_RX0    ((unsigned int) AT91C_PIO_PB25) /*  */
#define AT91C_PIO_PB26       ((unsigned int) 1 << 26) /* Pin Controlled by PB26*/
#define AT91C_PB26_E_RX1    ((unsigned int) AT91C_PIO_PB26) /*  */
#define AT91C_PIO_PB27       ((unsigned int) 1 << 27) /* Pin Controlled by PB27*/
#define AT91C_PB27_E_RXER   ((unsigned int) AT91C_PIO_PB27) /*  */
#define AT91C_PIO_PB28       ((unsigned int) 1 << 28) /* Pin Controlled by PB28*/
#define AT91C_PB28_E_TXEN   ((unsigned int) AT91C_PIO_PB28) /*  */
#define AT91C_PB28_TCLK0    ((unsigned int) AT91C_PIO_PB28) /*  */
#define AT91C_PIO_PB29       ((unsigned int) 1 << 29) /* Pin Controlled by PB29*/
#define AT91C_PB29_E_MDC    ((unsigned int) AT91C_PIO_PB29) /*  */
#define AT91C_PB29_PWM3     ((unsigned int) AT91C_PIO_PB29) /*  */
#define AT91C_PIO_PB3        ((unsigned int) 1 <<  3) /* Pin Controlled by PB3*/
#define AT91C_PB3_RD0      ((unsigned int) AT91C_PIO_PB3) /*  */
#define AT91C_PIO_PB30       ((unsigned int) 1 << 30) /* Pin Controlled by PB30*/
#define AT91C_PB30_E_MDIO   ((unsigned int) AT91C_PIO_PB30) /*  */
#define AT91C_PIO_PB31       ((unsigned int) 1 << 31) /* Pin Controlled by PB31*/
#define AT91C_PB31_ADTRIG   ((unsigned int) AT91C_PIO_PB31) /*  */
#define AT91C_PB31_E_F100   ((unsigned int) AT91C_PIO_PB31) /*  */
#define AT91C_PIO_PB4        ((unsigned int) 1 <<  4) /* Pin Controlled by PB4*/
#define AT91C_PB4_RK0      ((unsigned int) AT91C_PIO_PB4) /*  */
#define AT91C_PB4_TWD      ((unsigned int) AT91C_PIO_PB4) /*  */
#define AT91C_PIO_PB5        ((unsigned int) 1 <<  5) /* Pin Controlled by PB5*/
#define AT91C_PB5_RF0      ((unsigned int) AT91C_PIO_PB5) /*  */
#define AT91C_PB5_TWCK     ((unsigned int) AT91C_PIO_PB5) /*  */
#define AT91C_PIO_PB6        ((unsigned int) 1 <<  6) /* Pin Controlled by PB6*/
#define AT91C_PB6_TF1      ((unsigned int) AT91C_PIO_PB6) /*  */
#define AT91C_PB6_TIOA1    ((unsigned int) AT91C_PIO_PB6) /*  */
#define AT91C_PIO_PB7        ((unsigned int) 1 <<  7) /* Pin Controlled by PB7*/
#define AT91C_PB7_TK1      ((unsigned int) AT91C_PIO_PB7) /*  */
#define AT91C_PB7_TIOB1    ((unsigned int) AT91C_PIO_PB7) /*  */
#define AT91C_PIO_PB8        ((unsigned int) 1 <<  8) /* Pin Controlled by PB8*/
#define AT91C_PB8_TD1      ((unsigned int) AT91C_PIO_PB8) /*  */
#define AT91C_PB8_PWM2     ((unsigned int) AT91C_PIO_PB8) /*  */
#define AT91C_PIO_PB9        ((unsigned int) 1 <<  9) /* Pin Controlled by PB9*/
#define AT91C_PB9_RD1      ((unsigned int) AT91C_PIO_PB9) /*  */
#define AT91C_PB9_LCDCC    ((unsigned int) AT91C_PIO_PB9) /*  */
#define AT91C_PIO_PC0        ((unsigned int) 1 <<  0) /* Pin Controlled by PC0*/
#define AT91C_PC0_LCDVSYNC ((unsigned int) AT91C_PIO_PC0) /*  */
#define AT91C_PIO_PC1        ((unsigned int) 1 <<  1) /* Pin Controlled by PC1*/
#define AT91C_PC1_LCDHSYNC ((unsigned int) AT91C_PIO_PC1) /*  */
#define AT91C_PIO_PC10       ((unsigned int) 1 << 10) /* Pin Controlled by PC10*/
#define AT91C_PC10_LCDD6    ((unsigned int) AT91C_PIO_PC10) /*  */
#define AT91C_PC10_LCDD11B  ((unsigned int) AT91C_PIO_PC10) /*  */
#define AT91C_PIO_PC11       ((unsigned int) 1 << 11) /* Pin Controlled by PC11*/
#define AT91C_PC11_LCDD7    ((unsigned int) AT91C_PIO_PC11) /*  */
#define AT91C_PC11_LCDD12B  ((unsigned int) AT91C_PIO_PC11) /*  */
#define AT91C_PIO_PC12       ((unsigned int) 1 << 12) /* Pin Controlled by PC12*/
#define AT91C_PC12_LCDD8    ((unsigned int) AT91C_PIO_PC12) /*  */
#define AT91C_PC12_LCDD13B  ((unsigned int) AT91C_PIO_PC12) /*  */
#define AT91C_PIO_PC13       ((unsigned int) 1 << 13) /* Pin Controlled by PC13*/
#define AT91C_PC13_LCDD9    ((unsigned int) AT91C_PIO_PC13) /*  */
#define AT91C_PC13_LCDD14B  ((unsigned int) AT91C_PIO_PC13) /*  */
#define AT91C_PIO_PC14       ((unsigned int) 1 << 14) /* Pin Controlled by PC14*/
#define AT91C_PC14_LCDD10   ((unsigned int) AT91C_PIO_PC14) /*  */
#define AT91C_PC14_LCDD15B  ((unsigned int) AT91C_PIO_PC14) /*  */
#define AT91C_PIO_PC15       ((unsigned int) 1 << 15) /* Pin Controlled by PC15*/
#define AT91C_PC15_LCDD11   ((unsigned int) AT91C_PIO_PC15) /*  */
#define AT91C_PC15_LCDD19B  ((unsigned int) AT91C_PIO_PC15) /*  */
#define AT91C_PIO_PC16       ((unsigned int) 1 << 16) /* Pin Controlled by PC16*/
#define AT91C_PC16_LCDD12   ((unsigned int) AT91C_PIO_PC16) /*  */
#define AT91C_PC16_LCDD20B  ((unsigned int) AT91C_PIO_PC16) /*  */
#define AT91C_PIO_PC17       ((unsigned int) 1 << 17) /* Pin Controlled by PC17*/
#define AT91C_PC17_LCDD13   ((unsigned int) AT91C_PIO_PC17) /*  */
#define AT91C_PC17_LCDD21B  ((unsigned int) AT91C_PIO_PC17) /*  */
#define AT91C_PIO_PC18       ((unsigned int) 1 << 18) /* Pin Controlled by PC18*/
#define AT91C_PC18_LCDD14   ((unsigned int) AT91C_PIO_PC18) /*  */
#define AT91C_PC18_LCDD22B  ((unsigned int) AT91C_PIO_PC18) /*  */
#define AT91C_PIO_PC19       ((unsigned int) 1 << 19) /* Pin Controlled by PC19*/
#define AT91C_PC19_LCDD15   ((unsigned int) AT91C_PIO_PC19) /*  */
#define AT91C_PC19_LCDD23B  ((unsigned int) AT91C_PIO_PC19) /*  */
#define AT91C_PIO_PC2        ((unsigned int) 1 <<  2) /* Pin Controlled by PC2*/
#define AT91C_PC2_LCDDOTCK ((unsigned int) AT91C_PIO_PC2) /*  */
#define AT91C_PIO_PC20       ((unsigned int) 1 << 20) /* Pin Controlled by PC20*/
#define AT91C_PC20_LCDD16   ((unsigned int) AT91C_PIO_PC20) /*  */
#define AT91C_PC20_E_TX2    ((unsigned int) AT91C_PIO_PC20) /*  */
#define AT91C_PIO_PC21       ((unsigned int) 1 << 21) /* Pin Controlled by PC21*/
#define AT91C_PC21_LCDD17   ((unsigned int) AT91C_PIO_PC21) /*  */
#define AT91C_PC21_E_TX3    ((unsigned int) AT91C_PIO_PC21) /*  */
#define AT91C_PIO_PC22       ((unsigned int) 1 << 22) /* Pin Controlled by PC22*/
#define AT91C_PC22_LCDD18   ((unsigned int) AT91C_PIO_PC22) /*  */
#define AT91C_PC22_E_RX2    ((unsigned int) AT91C_PIO_PC22) /*  */
#define AT91C_PIO_PC23       ((unsigned int) 1 << 23) /* Pin Controlled by PC23*/
#define AT91C_PC23_LCDD19   ((unsigned int) AT91C_PIO_PC23) /*  */
#define AT91C_PC23_E_RX3    ((unsigned int) AT91C_PIO_PC23) /*  */
#define AT91C_PIO_PC24       ((unsigned int) 1 << 24) /* Pin Controlled by PC24*/
#define AT91C_PC24_LCDD20   ((unsigned int) AT91C_PIO_PC24) /*  */
#define AT91C_PC24_E_TXER   ((unsigned int) AT91C_PIO_PC24) /*  */
#define AT91C_PIO_PC25       ((unsigned int) 1 << 25) /* Pin Controlled by PC25*/
#define AT91C_PC25_LCDD21   ((unsigned int) AT91C_PIO_PC25) /*  */
#define AT91C_PC25_E_CRS    ((unsigned int) AT91C_PIO_PC25) /*  */
#define AT91C_PIO_PC26       ((unsigned int) 1 << 26) /* Pin Controlled by PC26*/
#define AT91C_PC26_LCDD22   ((unsigned int) AT91C_PIO_PC26) /*  */
#define AT91C_PC26_E_COL    ((unsigned int) AT91C_PIO_PC26) /*  */
#define AT91C_PIO_PC27       ((unsigned int) 1 << 27) /* Pin Controlled by PC27*/
#define AT91C_PC27_LCDD23   ((unsigned int) AT91C_PIO_PC27) /*  */
#define AT91C_PC27_E_RXCK   ((unsigned int) AT91C_PIO_PC27) /*  */
#define AT91C_PIO_PC28       ((unsigned int) 1 << 28) /* Pin Controlled by PC28*/
#define AT91C_PC28_PWM0     ((unsigned int) AT91C_PIO_PC28) /*  */
#define AT91C_PC28_TCLK1    ((unsigned int) AT91C_PIO_PC28) /*  */
#define AT91C_PIO_PC29       ((unsigned int) 1 << 29) /* Pin Controlled by PC29*/
#define AT91C_PC29_PCK0     ((unsigned int) AT91C_PIO_PC29) /*  */
#define AT91C_PC29_PWM2     ((unsigned int) AT91C_PIO_PC29) /*  */
#define AT91C_PIO_PC3        ((unsigned int) 1 <<  3) /* Pin Controlled by PC3*/
#define AT91C_PC3_LCDDEN   ((unsigned int) AT91C_PIO_PC3) /*  */
#define AT91C_PC3_PWM1     ((unsigned int) AT91C_PIO_PC3) /*  */
#define AT91C_PIO_PC30       ((unsigned int) 1 << 30) /* Pin Controlled by PC30*/
#define AT91C_PC30_DRXD     ((unsigned int) AT91C_PIO_PC30) /*  */
#define AT91C_PIO_PC31       ((unsigned int) 1 << 31) /* Pin Controlled by PC31*/
#define AT91C_PC31_DTXD     ((unsigned int) AT91C_PIO_PC31) /*  */
#define AT91C_PIO_PC4        ((unsigned int) 1 <<  4) /* Pin Controlled by PC4*/
#define AT91C_PC4_LCDD0    ((unsigned int) AT91C_PIO_PC4) /*  */
#define AT91C_PC4_LCDD3B   ((unsigned int) AT91C_PIO_PC4) /*  */
#define AT91C_PIO_PC5        ((unsigned int) 1 <<  5) /* Pin Controlled by PC5*/
#define AT91C_PC5_LCDD1    ((unsigned int) AT91C_PIO_PC5) /*  */
#define AT91C_PC5_LCDD4B   ((unsigned int) AT91C_PIO_PC5) /*  */
#define AT91C_PIO_PC6        ((unsigned int) 1 <<  6) /* Pin Controlled by PC6*/
#define AT91C_PC6_LCDD2    ((unsigned int) AT91C_PIO_PC6) /*  */
#define AT91C_PC6_LCDD5B   ((unsigned int) AT91C_PIO_PC6) /*  */
#define AT91C_PIO_PC7        ((unsigned int) 1 <<  7) /* Pin Controlled by PC7*/
#define AT91C_PC7_LCDD3    ((unsigned int) AT91C_PIO_PC7) /*  */
#define AT91C_PC7_LCDD6B   ((unsigned int) AT91C_PIO_PC7) /*  */
#define AT91C_PIO_PC8        ((unsigned int) 1 <<  8) /* Pin Controlled by PC8*/
#define AT91C_PC8_LCDD4    ((unsigned int) AT91C_PIO_PC8) /*  */
#define AT91C_PC8_LCDD7B   ((unsigned int) AT91C_PIO_PC8) /*  */
#define AT91C_PIO_PC9        ((unsigned int) 1 <<  9) /* Pin Controlled by PC9*/
#define AT91C_PC9_LCDD5    ((unsigned int) AT91C_PIO_PC9) /*  */
#define AT91C_PC9_LCDD10B  ((unsigned int) AT91C_PIO_PC9) /*  */
#define AT91C_PIO_PD0        ((unsigned int) 1 <<  0) /* Pin Controlled by PD0*/
#define AT91C_PD0_TXD1     ((unsigned int) AT91C_PIO_PD0) /*  */
#define AT91C_PD0_SPI0_NPCS2D ((unsigned int) AT91C_PIO_PD0) /*  */
#define AT91C_PIO_PD1        ((unsigned int) 1 <<  1) /* Pin Controlled by PD1*/
#define AT91C_PD1_RXD1     ((unsigned int) AT91C_PIO_PD1) /*  */
#define AT91C_PD1_SPI0_NPCS3D ((unsigned int) AT91C_PIO_PD1) /*  */
#define AT91C_PIO_PD10       ((unsigned int) 1 << 10) /* Pin Controlled by PD10*/
#define AT91C_PD10_EBI_CFCE2 ((unsigned int) AT91C_PIO_PD10) /*  */
#define AT91C_PD10_SCK1     ((unsigned int) AT91C_PIO_PD10) /*  */
#define AT91C_PIO_PD11       ((unsigned int) 1 << 11) /* Pin Controlled by PD11*/
#define AT91C_PD11_EBI_NCS2 ((unsigned int) AT91C_PIO_PD11) /*  */
#define AT91C_PIO_PD12       ((unsigned int) 1 << 12) /* Pin Controlled by PD12*/
#define AT91C_PD12_EBI_A23  ((unsigned int) AT91C_PIO_PD12) /*  */
#define AT91C_PIO_PD13       ((unsigned int) 1 << 13) /* Pin Controlled by PD13*/
#define AT91C_PD13_EBI_A24  ((unsigned int) AT91C_PIO_PD13) /*  */
#define AT91C_PIO_PD14       ((unsigned int) 1 << 14) /* Pin Controlled by PD14*/
#define AT91C_PD14_EBI_A25_CFRNW ((unsigned int) AT91C_PIO_PD14) /*  */
#define AT91C_PIO_PD15       ((unsigned int) 1 << 15) /* Pin Controlled by PD15*/
#define AT91C_PD15_EBI_NCS3_NANDCS ((unsigned int) AT91C_PIO_PD15) /*  */
#define AT91C_PIO_PD16       ((unsigned int) 1 << 16) /* Pin Controlled by PD16*/
#define AT91C_PD16_EBI_D16  ((unsigned int) AT91C_PIO_PD16) /*  */
#define AT91C_PIO_PD17       ((unsigned int) 1 << 17) /* Pin Controlled by PD17*/
#define AT91C_PD17_EBI_D17  ((unsigned int) AT91C_PIO_PD17) /*  */
#define AT91C_PIO_PD18       ((unsigned int) 1 << 18) /* Pin Controlled by PD18*/
#define AT91C_PD18_EBI_D18  ((unsigned int) AT91C_PIO_PD18) /*  */
#define AT91C_PIO_PD19       ((unsigned int) 1 << 19) /* Pin Controlled by PD19*/
#define AT91C_PD19_EBI_D19  ((unsigned int) AT91C_PIO_PD19) /*  */
#define AT91C_PIO_PD2        ((unsigned int) 1 <<  2) /* Pin Controlled by PD2*/
#define AT91C_PD2_TXD2     ((unsigned int) AT91C_PIO_PD2) /*  */
#define AT91C_PD2_SPI1_NPCS2D ((unsigned int) AT91C_PIO_PD2) /*  */
#define AT91C_PIO_PD20       ((unsigned int) 1 << 20) /* Pin Controlled by PD20*/
#define AT91C_PD20_EBI_D20  ((unsigned int) AT91C_PIO_PD20) /*  */
#define AT91C_PIO_PD21       ((unsigned int) 1 << 21) /* Pin Controlled by PD21*/
#define AT91C_PD21_EBI_D21  ((unsigned int) AT91C_PIO_PD21) /*  */
#define AT91C_PIO_PD22       ((unsigned int) 1 << 22) /* Pin Controlled by PD22*/
#define AT91C_PD22_EBI_D22  ((unsigned int) AT91C_PIO_PD22) /*  */
#define AT91C_PIO_PD23       ((unsigned int) 1 << 23) /* Pin Controlled by PD23*/
#define AT91C_PD23_EBI_D23  ((unsigned int) AT91C_PIO_PD23) /*  */
#define AT91C_PIO_PD24       ((unsigned int) 1 << 24) /* Pin Controlled by PD24*/
#define AT91C_PD24_EBI_D24  ((unsigned int) AT91C_PIO_PD24) /*  */
#define AT91C_PIO_PD25       ((unsigned int) 1 << 25) /* Pin Controlled by PD25*/
#define AT91C_PD25_EBI_D25  ((unsigned int) AT91C_PIO_PD25) /*  */
#define AT91C_PIO_PD26       ((unsigned int) 1 << 26) /* Pin Controlled by PD26*/
#define AT91C_PD26_EBI_D26  ((unsigned int) AT91C_PIO_PD26) /*  */
#define AT91C_PIO_PD27       ((unsigned int) 1 << 27) /* Pin Controlled by PD27*/
#define AT91C_PD27_EBI_D27  ((unsigned int) AT91C_PIO_PD27) /*  */
#define AT91C_PIO_PD28       ((unsigned int) 1 << 28) /* Pin Controlled by PD28*/
#define AT91C_PD28_EBI_D28  ((unsigned int) AT91C_PIO_PD28) /*  */
#define AT91C_PIO_PD29       ((unsigned int) 1 << 29) /* Pin Controlled by PD29*/
#define AT91C_PD29_EBI_D29  ((unsigned int) AT91C_PIO_PD29) /*  */
#define AT91C_PIO_PD3        ((unsigned int) 1 <<  3) /* Pin Controlled by PD3*/
#define AT91C_PD3_RXD2     ((unsigned int) AT91C_PIO_PD3) /*  */
#define AT91C_PD3_SPI1_NPCS3D ((unsigned int) AT91C_PIO_PD3) /*  */
#define AT91C_PIO_PD30       ((unsigned int) 1 << 30) /* Pin Controlled by PD30*/
#define AT91C_PD30_EBI_D30  ((unsigned int) AT91C_PIO_PD30) /*  */
#define AT91C_PIO_PD31       ((unsigned int) 1 << 31) /* Pin Controlled by PD31*/
#define AT91C_PD31_EBI_D31  ((unsigned int) AT91C_PIO_PD31) /*  */
