una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91cap9.h
#define AT91C_PIO_PD4        ((unsigned int) 1 <<  4) /* Pin Controlled by PD4*/
#define AT91C_PD4_FIQ      ((unsigned int) AT91C_PIO_PD4) /*  */
#define AT91C_PIO_PD5        ((unsigned int) 1 <<  5) /* Pin Controlled by PD5*/
#define AT91C_PD5_DMARQ2   ((unsigned int) AT91C_PIO_PD5) /*  */
#define AT91C_PD5_RTS2     ((unsigned int) AT91C_PIO_PD5) /*  */
#define AT91C_PIO_PD6        ((unsigned int) 1 <<  6) /* Pin Controlled by PD6*/
#define AT91C_PD6_EBI_NWAIT ((unsigned int) AT91C_PIO_PD6) /*  */
#define AT91C_PD6_CTS2     ((unsigned int) AT91C_PIO_PD6) /*  */
#define AT91C_PIO_PD7        ((unsigned int) 1 <<  7) /* Pin Controlled by PD7*/
#define AT91C_PD7_EBI_NCS4_CFCS0 ((unsigned int) AT91C_PIO_PD7) /*  */
#define AT91C_PD7_RTS1     ((unsigned int) AT91C_PIO_PD7) /*  */
#define AT91C_PIO_PD8        ((unsigned int) 1 <<  8) /* Pin Controlled by PD8*/
#define AT91C_PD8_EBI_NCS5_CFCS1 ((unsigned int) AT91C_PIO_PD8) /*  */
#define AT91C_PD8_CTS1     ((unsigned int) AT91C_PIO_PD8) /*  */
#define AT91C_PIO_PD9        ((unsigned int) 1 <<  9) /* Pin Controlled by PD9*/
#define AT91C_PD9_EBI_CFCE1 ((unsigned int) AT91C_PIO_PD9) /*  */
#define AT91C_PD9_SCK2     ((unsigned int) AT91C_PIO_PD9) /*  */

/* ******************************************************************************/
/*               PERIPHERAL ID DEFINITIONS FOR AT91CAP9_UMC*/
/* ******************************************************************************/
#define AT91C_ID_FIQ    ((unsigned int)  0) /* Advanced Interrupt Controller (FIQ)*/
#define AT91C_ID_SYS    ((unsigned int)  1) /* System Controller*/
#define AT91C_ID_PIOABCD ((unsigned int)  2) /* Parallel IO Controller A, Parallel IO Controller B, Parallel IO Controller C, Parallel IO Controller D*/
#define AT91C_ID_MPB0   ((unsigned int)  3) /* MP Block Peripheral 0*/
#define AT91C_ID_MPB1   ((unsigned int)  4) /* MP Block Peripheral 1*/
#define AT91C_ID_MPB2   ((unsigned int)  5) /* MP Block Peripheral 2*/
#define AT91C_ID_MPB3   ((unsigned int)  6) /* MP Block Peripheral 3*/
#define AT91C_ID_MPB4   ((unsigned int)  7) /* MP Block Peripheral 4*/
#define AT91C_ID_US0    ((unsigned int)  8) /* USART 0*/
#define AT91C_ID_US1    ((unsigned int)  9) /* USART 1*/
#define AT91C_ID_US2    ((unsigned int) 10) /* USART 2*/
#define AT91C_ID_MCI0   ((unsigned int) 11) /* Multimedia Card Interface 0*/
#define AT91C_ID_MCI1   ((unsigned int) 12) /* Multimedia Card Interface 1*/
#define AT91C_ID_CAN    ((unsigned int) 13) /* CAN Controller*/
#define AT91C_ID_TWI    ((unsigned int) 14) /* Two-Wire Interface*/
#define AT91C_ID_SPI0   ((unsigned int) 15) /* Serial Peripheral Interface 0*/
#define AT91C_ID_SPI1   ((unsigned int) 16) /* Serial Peripheral Interface 1*/
#define AT91C_ID_SSC0   ((unsigned int) 17) /* Serial Synchronous Controller 0*/
#define AT91C_ID_SSC1   ((unsigned int) 18) /* Serial Synchronous Controller 1*/
#define AT91C_ID_AC97C  ((unsigned int) 19) /* AC97 Controller*/
#define AT91C_ID_TC012  ((unsigned int) 20) /* Timer Counter 0, Timer Counter 1, Timer Counter 2*/
#define AT91C_ID_PWMC   ((unsigned int) 21) /* PWM Controller*/
#define AT91C_ID_EMAC   ((unsigned int) 22) /* Ethernet Mac*/
#define AT91C_ID_AESTDES ((unsigned int) 23) /* Advanced Encryption Standard, Triple DES*/
#define AT91C_ID_ADC    ((unsigned int) 24) /* ADC Controller*/
#define AT91C_ID_HISI   ((unsigned int) 25) /* Image Sensor Interface*/
#define AT91C_ID_LCDC   ((unsigned int) 26) /* LCD Controller*/
#define AT91C_ID_HDMA   ((unsigned int) 27) /* HDMA Controller*/
#define AT91C_ID_UDPHS  ((unsigned int) 28) /* USB High Speed Device Port*/
#define AT91C_ID_UHP    ((unsigned int) 29) /* USB Host Port*/
#define AT91C_ID_IRQ0   ((unsigned int) 30) /* Advanced Interrupt Controller (IRQ0)*/
#define AT91C_ID_IRQ1   ((unsigned int) 31) /* Advanced Interrupt Controller (IRQ1)*/
#define AT91C_ALL_INT   ((unsigned int) 0xFFFFFFFF) /* ALL VALID INTERRUPTS*/

/* ******************************************************************************/
/*               BASE ADDRESS DEFINITIONS FOR AT91CAP9_UMC*/
/* ******************************************************************************/
#define AT91C_BASE_HECC      ((AT91PS_ECC) 	0xFFFFE200) /* (HECC) Base Address*/
#define AT91C_BASE_BCRAMC    ((AT91PS_BCRAMC) 	0xFFFFE400) /* (BCRAMC) Base Address*/
#define AT91C_BASE_SDDRC     ((AT91PS_SDDRC) 	0xFFFFE600) /* (SDDRC) Base Address*/
#define AT91C_BASE_SMC       ((AT91PS_SMC) 	0xFFFFE800) /* (SMC) Base Address*/
#define AT91C_BASE_MATRIX_PRS ((AT91PS_MATRIX_PRS) 	0xFFFFEA80) /* (MATRIX_PRS) Base Address*/
#define AT91C_BASE_MATRIX    ((AT91PS_MATRIX) 	0xFFFFEA00) /* (MATRIX) Base Address*/
#define AT91C_BASE_CCFG      ((AT91PS_CCFG) 	0xFFFFEB10) /* (CCFG) Base Address*/
#define AT91C_BASE_PDC_DBGU  ((AT91PS_PDC) 	0xFFFFEF00) /* (PDC_DBGU) Base Address*/
#define AT91C_BASE_DBGU      ((AT91PS_DBGU) 	0xFFFFEE00) /* (DBGU) Base Address*/
#define AT91C_BASE_AIC       ((AT91PS_AIC) 	0xFFFFF000) /* (AIC) Base Address*/
#define AT91C_BASE_PIOA      ((AT91PS_PIO) 	0xFFFFF200) /* (PIOA) Base Address*/
#define AT91C_BASE_PIOB      ((AT91PS_PIO) 	0xFFFFF400) /* (PIOB) Base Address*/
#define AT91C_BASE_PIOC      ((AT91PS_PIO) 	0xFFFFF600) /* (PIOC) Base Address*/
#define AT91C_BASE_PIOD      ((AT91PS_PIO) 	0xFFFFF800) /* (PIOD) Base Address*/
#define AT91C_BASE_CKGR      ((AT91PS_CKGR) 	0xFFFFFC1C) /* (CKGR) Base Address*/
#define AT91C_BASE_PMC       ((AT91PS_PMC) 	0xFFFFFC00) /* (PMC) Base Address*/
#define AT91C_BASE_RSTC      ((AT91PS_RSTC) 	0xFFFFFD00) /* (RSTC) Base Address*/
#define AT91C_BASE_SHDWC     ((AT91PS_SHDWC) 	0xFFFFFD10) /* (SHDWC) Base Address*/
#define AT91C_BASE_RTTC      ((AT91PS_RTTC) 	0xFFFFFD20) /* (RTTC) Base Address*/
#define AT91C_BASE_PITC      ((AT91PS_PITC) 	0xFFFFFD30) /* (PITC) Base Address*/
#define AT91C_BASE_WDTC      ((AT91PS_WDTC) 	0xFFFFFD40) /* (WDTC) Base Address*/
#define AT91C_BASE_UDP       ((AT91PS_UDP) 	0xFFF78000) /* (UDP) Base Address*/
#define AT91C_BASE_UDPHS_EPTFIFO ((AT91PS_UDPHS_EPTFIFO) 	0x00600000) /* (UDPHS_EPTFIFO) Base Address*/
#define AT91C_BASE_UDPHS_EPT_0 ((AT91PS_UDPHS_EPT) 	0xFFF78100) /* (UDPHS_EPT_0) Base Address*/
#define AT91C_BASE_UDPHS_EPT_1 ((AT91PS_UDPHS_EPT) 	0xFFF78120) /* (UDPHS_EPT_1) Base Address*/
#define AT91C_BASE_UDPHS_EPT_2 ((AT91PS_UDPHS_EPT) 	0xFFF78140) /* (UDPHS_EPT_2) Base Address*/
#define AT91C_BASE_UDPHS_EPT_3 ((AT91PS_UDPHS_EPT) 	0xFFF78160) /* (UDPHS_EPT_3) Base Address*/
#define AT91C_BASE_UDPHS_EPT_4 ((AT91PS_UDPHS_EPT) 	0xFFF78180) /* (UDPHS_EPT_4) Base Address*/
#define AT91C_BASE_UDPHS_EPT_5 ((AT91PS_UDPHS_EPT) 	0xFFF781A0) /* (UDPHS_EPT_5) Base Address*/
#define AT91C_BASE_UDPHS_EPT_6 ((AT91PS_UDPHS_EPT) 	0xFFF781C0) /* (UDPHS_EPT_6) Base Address*/
#define AT91C_BASE_UDPHS_EPT_7 ((AT91PS_UDPHS_EPT) 	0xFFF781E0) /* (UDPHS_EPT_7) Base Address*/
#define AT91C_BASE_UDPHS_DMA_1 ((AT91PS_UDPHS_DMA) 	0xFFF78310) /* (UDPHS_DMA_1) Base Address*/
#define AT91C_BASE_UDPHS_DMA_2 ((AT91PS_UDPHS_DMA) 	0xFFF78320) /* (UDPHS_DMA_2) Base Address*/
#define AT91C_BASE_UDPHS_DMA_3 ((AT91PS_UDPHS_DMA) 	0xFFF78330) /* (UDPHS_DMA_3) Base Address*/
#define AT91C_BASE_UDPHS_DMA_4 ((AT91PS_UDPHS_DMA) 	0xFFF78340) /* (UDPHS_DMA_4) Base Address*/
#define AT91C_BASE_UDPHS_DMA_5 ((AT91PS_UDPHS_DMA) 	0xFFF78350) /* (UDPHS_DMA_5) Base Address*/
#define AT91C_BASE_UDPHS_DMA_6 ((AT91PS_UDPHS_DMA) 	0xFFF78360) /* (UDPHS_DMA_6) Base Address*/
#define AT91C_BASE_UDPHS     ((AT91PS_UDPHS) 	0xFFF78000) /* (UDPHS) Base Address*/
#define AT91C_BASE_TC0       ((AT91PS_TC) 	0xFFF7C000) /* (TC0) Base Address*/
#define AT91C_BASE_TC1       ((AT91PS_TC) 	0xFFF7C040) /* (TC1) Base Address*/
#define AT91C_BASE_TC2       ((AT91PS_TC) 	0xFFF7C080) /* (TC2) Base Address*/
#define AT91C_BASE_TCB0      ((AT91PS_TCB) 	0xFFF7C000) /* (TCB0) Base Address*/
#define AT91C_BASE_TCB1      ((AT91PS_TCB) 	0xFFF7C040) /* (TCB1) Base Address*/
#define AT91C_BASE_TCB2      ((AT91PS_TCB) 	0xFFF7C080) /* (TCB2) Base Address*/
#define AT91C_BASE_PDC_MCI0  ((AT91PS_PDC) 	0xFFF80100) /* (PDC_MCI0) Base Address*/
#define AT91C_BASE_MCI0      ((AT91PS_MCI) 	0xFFF80000) /* (MCI0) Base Address*/
#define AT91C_BASE_PDC_MCI1  ((AT91PS_PDC) 	0xFFF84100) /* (PDC_MCI1) Base Address*/
#define AT91C_BASE_MCI1      ((AT91PS_MCI) 	0xFFF84000) /* (MCI1) Base Address*/
#define AT91C_BASE_PDC_TWI   ((AT91PS_PDC) 	0xFFF88100) /* (PDC_TWI) Base Address*/
#define AT91C_BASE_TWI       ((AT91PS_TWI) 	0xFFF88000) /* (TWI) Base Address*/
#define AT91C_BASE_PDC_US0   ((AT91PS_PDC) 	0xFFF8C100) /* (PDC_US0) Base Address*/
#define AT91C_BASE_US0       ((AT91PS_USART) 	0xFFF8C000) /* (US0) Base Address*/
#define AT91C_BASE_PDC_US1   ((AT91PS_PDC) 	0xFFF90100) /* (PDC_US1) Base Address*/
#define AT91C_BASE_US1       ((AT91PS_USART) 	0xFFF90000) /* (US1) Base Address*/
#define AT91C_BASE_PDC_US2   ((AT91PS_PDC) 	0xFFF94100) /* (PDC_US2) Base Address*/
#define AT91C_BASE_US2       ((AT91PS_USART) 	0xFFF94000) /* (US2) Base Address*/
#define AT91C_BASE_PDC_SSC0  ((AT91PS_PDC) 	0xFFF98100) /* (PDC_SSC0) Base Address*/
#define AT91C_BASE_SSC0      ((AT91PS_SSC) 	0xFFF98000) /* (SSC0) Base Address*/
#define AT91C_BASE_PDC_SSC1  ((AT91PS_PDC) 	0xFFF9C100) /* (PDC_SSC1) Base Address*/
#define AT91C_BASE_SSC1      ((AT91PS_SSC) 	0xFFF9C000) /* (SSC1) Base Address*/
#define AT91C_BASE_PDC_AC97C ((AT91PS_PDC) 	0xFFFA0100) /* (PDC_AC97C) Base Address*/
#define AT91C_BASE_AC97C     ((AT91PS_AC97C) 	0xFFFA0000) /* (AC97C) Base Address*/
#define AT91C_BASE_PDC_SPI0  ((AT91PS_PDC) 	0xFFFA4100) /* (PDC_SPI0) Base Address*/
#define AT91C_BASE_SPI0      ((AT91PS_SPI) 	0xFFFA4000) /* (SPI0) Base Address*/
#define AT91C_BASE_PDC_SPI1  ((AT91PS_PDC) 	0xFFFA8100) /* (PDC_SPI1) Base Address*/
#define AT91C_BASE_SPI1      ((AT91PS_SPI) 	0xFFFA8000) /* (SPI1) Base Address*/
#define AT91C_BASE_CAN_MB0   ((AT91PS_CAN_MB) 	0xFFFAC200) /* (CAN_MB0) Base Address*/
#define AT91C_BASE_CAN_MB1   ((AT91PS_CAN_MB) 	0xFFFAC220) /* (CAN_MB1) Base Address*/
#define AT91C_BASE_CAN_MB2   ((AT91PS_CAN_MB) 	0xFFFAC240) /* (CAN_MB2) Base Address*/
#define AT91C_BASE_CAN_MB3   ((AT91PS_CAN_MB) 	0xFFFAC260) /* (CAN_MB3) Base Address*/
#define AT91C_BASE_CAN_MB4   ((AT91PS_CAN_MB) 	0xFFFAC280) /* (CAN_MB4) Base Address*/
#define AT91C_BASE_CAN_MB5   ((AT91PS_CAN_MB) 	0xFFFAC2A0) /* (CAN_MB5) Base Address*/
#define AT91C_BASE_CAN_MB6   ((AT91PS_CAN_MB) 	0xFFFAC2C0) /* (CAN_MB6) Base Address*/
#define AT91C_BASE_CAN_MB7   ((AT91PS_CAN_MB) 	0xFFFAC2E0) /* (CAN_MB7) Base Address*/
#define AT91C_BASE_CAN_MB8   ((AT91PS_CAN_MB) 	0xFFFAC300) /* (CAN_MB8) Base Address*/
#define AT91C_BASE_CAN_MB9   ((AT91PS_CAN_MB) 	0xFFFAC320) /* (CAN_MB9) Base Address*/
#define AT91C_BASE_CAN_MB10  ((AT91PS_CAN_MB) 	0xFFFAC340) /* (CAN_MB10) Base Address*/
#define AT91C_BASE_CAN_MB11  ((AT91PS_CAN_MB) 	0xFFFAC360) /* (CAN_MB11) Base Address*/
#define AT91C_BASE_CAN_MB12  ((AT91PS_CAN_MB) 	0xFFFAC380) /* (CAN_MB12) Base Address*/
#define AT91C_BASE_CAN_MB13  ((AT91PS_CAN_MB) 	0xFFFAC3A0) /* (CAN_MB13) Base Address*/
#define AT91C_BASE_CAN_MB14  ((AT91PS_CAN_MB) 	0xFFFAC3C0) /* (CAN_MB14) Base Address*/
#define AT91C_BASE_CAN_MB15  ((AT91PS_CAN_MB) 	0xFFFAC3E0) /* (CAN_MB15) Base Address*/
#define AT91C_BASE_CAN       ((AT91PS_CAN) 	0xFFFAC000) /* (CAN) Base Address*/
#define AT91C_BASE_PDC_AES   ((AT91PS_PDC) 	0xFFFB0100) /* (PDC_AES) Base Address*/
#define AT91C_BASE_AES       ((AT91PS_AES) 	0xFFFB0000) /* (AES) Base Address*/
#define AT91C_BASE_PDC_TDES  ((AT91PS_PDC) 	0xFFFB0100) /* (PDC_TDES) Base Address*/
#define AT91C_BASE_TDES      ((AT91PS_TDES) 	0xFFFB0000) /* (TDES) Base Address*/
#define AT91C_BASE_PWMC_CH0  ((AT91PS_PWMC_CH) 	0xFFFB8200) /* (PWMC_CH0) Base Address*/
#define AT91C_BASE_PWMC_CH1  ((AT91PS_PWMC_CH) 	0xFFFB8220) /* (PWMC_CH1) Base Address*/
#define AT91C_BASE_PWMC_CH2  ((AT91PS_PWMC_CH) 	0xFFFB8240) /* (PWMC_CH2) Base Address*/
#define AT91C_BASE_PWMC_CH3  ((AT91PS_PWMC_CH) 	0xFFFB8260) /* (PWMC_CH3) Base Address*/
#define AT91C_BASE_PWMC      ((AT91PS_PWMC) 	0xFFFB8000) /* (PWMC) Base Address*/
#define AT91C_BASE_MACB      ((AT91PS_EMAC) 	0xFFFBC000) /* (MACB) Base Address*/
#define AT91C_BASE_PDC_ADC   ((AT91PS_PDC) 	0xFFFC0100) /* (PDC_ADC) Base Address*/
#define AT91C_BASE_ADC       ((AT91PS_ADC) 	0xFFFC0000) /* (ADC) Base Address*/
#define AT91C_BASE_HISI      ((AT91PS_ISI) 	0xFFFC4000) /* (HISI) Base Address*/
#define AT91C_BASE_LCDC      ((AT91PS_LCDC) 	0x00500000) /* (LCDC) Base Address*/
#define AT91C_BASE_HDMA_CH_0 ((AT91PS_HDMA_CH) 	0xFFFFEC3C) /* (HDMA_CH_0) Base Address*/
#define AT91C_BASE_HDMA_CH_1 ((AT91PS_HDMA_CH) 	0xFFFFEC64) /* (HDMA_CH_1) Base Address*/
#define AT91C_BASE_HDMA_CH_2 ((AT91PS_HDMA_CH) 	0xFFFFEC8C) /* (HDMA_CH_2) Base Address*/
#define AT91C_BASE_HDMA_CH_3 ((AT91PS_HDMA_CH) 	0xFFFFECB4) /* (HDMA_CH_3) Base Address*/
#define AT91C_BASE_HDMA      ((AT91PS_HDMA) 	0xFFFFEC00) /* (HDMA) Base Address*/
#define AT91C_BASE_SYS       ((AT91PS_SYS) 	0xFFFFE200) /* (SYS) Base Address*/
#define AT91C_BASE_UHP       ((AT91PS_UHP) 	0x00700000) /* (UHP) Base Address*/

/* ******************************************************************************/
/*               MEMORY MAPPING DEFINITIONS FOR AT91CAP9_UMC*/
/* ******************************************************************************/
/* IRAM*/
#define AT91C_IRAM 	 ((char *) 	0x00100000) /* 32-KBytes FAST SRAM base address*/
#define AT91C_IRAM_SIZE	 ((unsigned int) 0x00008000) /* 32-KBytes FAST SRAM size in byte (32 Kbytes)*/
/* IRAM_MIN*/
#define AT91C_IRAM_MIN	 ((char *) 	0x00100000) /* Minimum Internal RAM base address*/
#define AT91C_IRAM_MIN_SIZE	 ((unsigned int) 0x00008000) /* Minimum Internal RAM size in byte (32 Kbytes)*/
/* DPR*/
#define AT91C_DPR  	 ((char *) 	0x00200000) /*  base address*/
#define AT91C_DPR_SIZE	 ((unsigned int) 0x00008000) /*  size in byte (32 Kbytes)*/
/* IROM*/
#define AT91C_IROM 	 ((char *) 	0x00400000) /* Internal ROM base address*/
#define AT91C_IROM_SIZE	 ((unsigned int) 0x00008000) /* Internal ROM size in byte (32 Kbytes)*/
/* EBI_CS0*/
#define AT91C_EBI_CS0	 ((char *) 	0x10000000) /* EBI Chip Select 0 base address*/
#define AT91C_EBI_CS0_SIZE	 ((unsigned int) 0x10000000) /* EBI Chip Select 0 size in byte (262144 Kbytes)*/
/* EBI_CS1*/
#define AT91C_EBI_CS1	 ((char *) 	0x20000000) /* EBI Chip Select 1 base address*/
#define AT91C_EBI_CS1_SIZE	 ((unsigned int) 0x10000000) /* EBI Chip Select 1 size in byte (262144 Kbytes)*/
/* EBI_BCRAM*/
#define AT91C_EBI_BCRAM	 ((char *) 	0x20000000) /* BCRAM on EBI Chip Select 1 base address*/
#define AT91C_EBI_BCRAM_SIZE	 ((unsigned int) 0x10000000) /* BCRAM on EBI Chip Select 1 size in byte (262144 Kbytes)*/
/* EBI_BCRAM_16BIT*/
#define AT91C_EBI_BCRAM_16BIT	 ((char *) 	0x20000000) /* BCRAM on EBI Chip Select 1 base address*/
#define AT91C_EBI_BCRAM_16BIT_SIZE	 ((unsigned int) 0x02000000) /* BCRAM on EBI Chip Select 1 size in byte (32768 Kbytes)*/
/* EBI_BCRAM_32BIT*/
#define AT91C_EBI_BCRAM_32BIT	 ((char *) 	0x20000000) /* BCRAM on EBI Chip Select 1 base address*/
#define AT91C_EBI_BCRAM_32BIT_SIZE	 ((unsigned int) 0x04000000) /* BCRAM on EBI Chip Select 1 size in byte (65536 Kbytes)*/
/* EBI_CS2*/
#define AT91C_EBI_CS2	 ((char *) 	0x30000000) /* EBI Chip Select 2 base address*/
#define AT91C_EBI_CS2_SIZE	 ((unsigned int) 0x10000000) /* EBI Chip Select 2 size in byte (262144 Kbytes)*/
/* EBI_CS3*/
#define AT91C_EBI_CS3	 ((char *) 	0x40000000) /* EBI Chip Select 3 base address*/
#define AT91C_EBI_CS3_SIZE	 ((unsigned int) 0x10000000) /* EBI Chip Select 3 size in byte (262144 Kbytes)*/
/* EBI_SM*/
#define AT91C_EBI_SM	 ((char *) 	0x40000000) /* SmartMedia on EBI Chip Select 3 base address*/
#define AT91C_EBI_SM_SIZE	 ((unsigned int) 0x10000000) /* SmartMedia on EBI Chip Select 3 size in byte (262144 Kbytes)*/
/* EBI_CS4*/
#define AT91C_EBI_CS4	 ((char *) 	0x50000000) /* EBI Chip Select 4 base address*/
#define AT91C_EBI_CS4_SIZE	 ((unsigned int) 0x10000000) /* EBI Chip Select 4 size in byte (262144 Kbytes)*/
/* EBI_CF0*/
#define AT91C_EBI_CF0	 ((char *) 	0x50000000) /* CompactFlash 0 on EBI Chip Select 4 base address*/
#define AT91C_EBI_CF0_SIZE	 ((unsigned int) 0x10000000) /* CompactFlash 0 on EBI Chip Select 4 size in byte (262144 Kbytes)*/
/* EBI_CS5*/
#define AT91C_EBI_CS5	 ((char *) 	0x60000000) /* EBI Chip Select 5 base address*/
#define AT91C_EBI_CS5_SIZE	 ((unsigned int) 0x10000000) /* EBI Chip Select 5 size in byte (262144 Kbytes)*/
/* EBI_CF1*/
#define AT91C_EBI_CF1	 ((char *) 	0x60000000) /* CompactFlash 1 on EBI Chip Select 5 base address*/
#define AT91C_EBI_CF1_SIZE	 ((unsigned int) 0x10000000) /* CompactFlash 1 on EBI Chip Select 5 size in byte (262144 Kbytes)*/
/* EBI_SDRAM*/
#define AT91C_EBI_SDRAM	 ((char *) 	0x70000000) /* SDRAM on EBI Chip Select 6 base address*/
#define AT91C_EBI_SDRAM_SIZE	 ((unsigned int) 0x10000000) /* SDRAM on EBI Chip Select 6 size in byte (262144 Kbytes)*/
/* EBI_SDRAM_16BIT*/
#define AT91C_EBI_SDRAM_16BIT	 ((char *) 	0x70000000) /* SDRAM on EBI Chip Select 6 base address*/
#define AT91C_EBI_SDRAM_16BIT_SIZE	 ((unsigned int) 0x02000000) /* SDRAM on EBI Chip Select 6 size in byte (32768 Kbytes)*/
/* EBI_SDRAM_32BIT*/
#define AT91C_EBI_SDRAM_32BIT	 ((char *) 	0x70000000) /* SDRAM on EBI Chip Select 6 base address*/
#define AT91C_EBI_SDRAM_32BIT_SIZE	 ((unsigned int) 0x04000000) /* SDRAM on EBI Chip Select 6 size in byte (65536 Kbytes)*/
#endif /* __IAR_SYSTEMS_ICC__ */

