una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91cap9.h
#ifdef __IAR_SYSTEMS_ASM__

/* - Hardware register definition*/

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR Error Correction Code controller*/
/* - ******************************************************************************/
/* - -------- ECC_CR : (ECC Offset: 0x0) ECC reset register -------- */
AT91C_ECC_RST             EQU (0x1 <<  0) ;- (ECC) ECC reset parity
/* - -------- ECC_MR : (ECC Offset: 0x4) ECC page size register -------- */
AT91C_ECC_PAGE_SIZE       EQU (0x3 <<  0) ;- (ECC) Nand Flash page size
/* - -------- ECC_SR : (ECC Offset: 0x8) ECC status register -------- */
AT91C_ECC_RECERR          EQU (0x1 <<  0) ;- (ECC) ECC error
AT91C_ECC_ECCERR          EQU (0x1 <<  1) ;- (ECC) ECC single error
AT91C_ECC_MULERR          EQU (0x1 <<  2) ;- (ECC) ECC_MULERR
/* - -------- ECC_PR : (ECC Offset: 0xc) ECC parity register -------- */
AT91C_ECC_BITADDR         EQU (0xF <<  0) ;- (ECC) Bit address error
AT91C_ECC_WORDADDR        EQU (0xFFF <<  4) ;- (ECC) address of the failing bit
/* - -------- ECC_NPR : (ECC Offset: 0x10) ECC N parity register -------- */
AT91C_ECC_NPARITY         EQU (0xFFFF <<  0) ;- (ECC) ECC parity N 
/* - -------- ECC_VR : (ECC Offset: 0xfc) ECC version register -------- */
AT91C_ECC_VR              EQU (0xF <<  0) ;- (ECC) ECC version register

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR Busr Cellular RAM Controller Interface*/
/* - ******************************************************************************/
/* - -------- BCRAMC_CR : (BCRAMC Offset: 0x0) BCRAM Controller Configuration Register -------- */
AT91C_BCRAMC_EN           EQU (0x1 <<  0) ;- (BCRAMC) Enable
AT91C_BCRAMC_CAS          EQU (0x7 <<  4) ;- (BCRAMC) CAS Latency
AT91C_BCRAMC_CAS_2        EQU (0x2 <<  4) ;- (BCRAMC) 2 cycles Latency for Cellular RAM v1.0/1.5/2.0
AT91C_BCRAMC_CAS_3        EQU (0x3 <<  4) ;- (BCRAMC) 3 cycles Latency for Cellular RAM v1.0/1.5/2.0
AT91C_BCRAMC_CAS_4        EQU (0x4 <<  4) ;- (BCRAMC) 4 cycles Latency for Cellular RAM v1.5/2.0
AT91C_BCRAMC_CAS_5        EQU (0x5 <<  4) ;- (BCRAMC) 5 cycles Latency for Cellular RAM v1.5/2.0
AT91C_BCRAMC_CAS_6        EQU (0x6 <<  4) ;- (BCRAMC) 6 cycles Latency for Cellular RAM v1.5/2.0
AT91C_BCRAMC_DBW          EQU (0x1 <<  8) ;- (BCRAMC) Data Bus Width
AT91C_BCRAMC_DBW_32_BITS  EQU (0x0 <<  8) ;- (BCRAMC) 32 Bits datas bus
AT91C_BCRAMC_DBW_16_BITS  EQU (0x1 <<  8) ;- (BCRAMC) 16 Bits datas bus
AT91C_BCRAM_NWIR          EQU (0x3 << 12) ;- (BCRAMC) Number Of Words in Row
AT91C_BCRAM_NWIR_64       EQU (0x0 << 12) ;- (BCRAMC) 64 Words in Row
AT91C_BCRAM_NWIR_128      EQU (0x1 << 12) ;- (BCRAMC) 128 Words in Row
AT91C_BCRAM_NWIR_256      EQU (0x2 << 12) ;- (BCRAMC) 256 Words in Row
AT91C_BCRAM_NWIR_512      EQU (0x3 << 12) ;- (BCRAMC) 512 Words in Row
AT91C_BCRAM_ADMX          EQU (0x1 << 16) ;- (BCRAMC) ADDR / DATA Mux
AT91C_BCRAM_ADMX_NO_MUX   EQU (0x0 << 16) ;- (BCRAMC) No ADD/DATA Mux for Cellular RAM v1.0/1.5/2.0
AT91C_BCRAM_ADMX_MUX      EQU (0x1 << 16) ;- (BCRAMC) ADD/DATA Mux Only for Cellular RAM v2.0
AT91C_BCRAM_DS            EQU (0x3 << 20) ;- (BCRAMC) Drive Strength
AT91C_BCRAM_DS_FULL_DRIVE EQU (0x0 << 20) ;- (BCRAMC) Full Cellular RAM Drive
AT91C_BCRAM_DS_HALF_DRIVE EQU (0x1 << 20) ;- (BCRAMC) Half Cellular RAM Drive
AT91C_BCRAM_DS_QUARTER_DRIVE EQU (0x2 << 20) ;- (BCRAMC) Quarter Cellular RAM Drive
AT91C_BCRAM_VFLAT         EQU (0x1 << 24) ;- (BCRAMC) Variable or Fixed Latency
AT91C_BCRAM_VFLAT_VARIABLE EQU (0x0 << 24) ;- (BCRAMC) Variable Latency
AT91C_BCRAM_VFLAT_FIXED   EQU (0x1 << 24) ;- (BCRAMC) Fixed Latency
/* - -------- BCRAMC_TPR : (BCRAMC Offset: 0x4) BCRAMC Timing Parameter Register -------- */
AT91C_BCRAMC_TCW          EQU (0xF <<  0) ;- (BCRAMC) Chip Enable to End of Write
AT91C_BCRAMC_TCW_0        EQU (0x0) ;- (BCRAMC) Value :  0
AT91C_BCRAMC_TCW_1        EQU (0x1) ;- (BCRAMC) Value :  1
AT91C_BCRAMC_TCW_2        EQU (0x2) ;- (BCRAMC) Value :  2
AT91C_BCRAMC_TCW_3        EQU (0x3) ;- (BCRAMC) Value :  3
AT91C_BCRAMC_TCW_4        EQU (0x4) ;- (BCRAMC) Value :  4
AT91C_BCRAMC_TCW_5        EQU (0x5) ;- (BCRAMC) Value :  5
AT91C_BCRAMC_TCW_6        EQU (0x6) ;- (BCRAMC) Value :  6
AT91C_BCRAMC_TCW_7        EQU (0x7) ;- (BCRAMC) Value :  7
AT91C_BCRAMC_TCW_8        EQU (0x8) ;- (BCRAMC) Value :  8
AT91C_BCRAMC_TCW_9        EQU (0x9) ;- (BCRAMC) Value :  9
AT91C_BCRAMC_TCW_10       EQU (0xA) ;- (BCRAMC) Value : 10
AT91C_BCRAMC_TCW_11       EQU (0xB) ;- (BCRAMC) Value : 11
AT91C_BCRAMC_TCW_12       EQU (0xC) ;- (BCRAMC) Value : 12
AT91C_BCRAMC_TCW_13       EQU (0xD) ;- (BCRAMC) Value : 13
AT91C_BCRAMC_TCW_14       EQU (0xE) ;- (BCRAMC) Value : 14
AT91C_BCRAMC_TCW_15       EQU (0xF) ;- (BCRAMC) Value : 15
AT91C_BCRAMC_TCRES        EQU (0x3 <<  4) ;- (BCRAMC) CRE Setup
AT91C_BCRAMC_TCRES_0      EQU (0x0 <<  4) ;- (BCRAMC) Value :  0
AT91C_BCRAMC_TCRES_1      EQU (0x1 <<  4) ;- (BCRAMC) Value :  1
AT91C_BCRAMC_TCRES_2      EQU (0x2 <<  4) ;- (BCRAMC) Value :  2
AT91C_BCRAMC_TCRES_3      EQU (0x3 <<  4) ;- (BCRAMC) Value :  3
AT91C_BCRAMC_TCKA         EQU (0xF <<  8) ;- (BCRAMC) WE High to CLK Valid
AT91C_BCRAMC_TCKA_0       EQU (0x0 <<  8) ;- (BCRAMC) Value :  0
AT91C_BCRAMC_TCKA_1       EQU (0x1 <<  8) ;- (BCRAMC) Value :  1
AT91C_BCRAMC_TCKA_2       EQU (0x2 <<  8) ;- (BCRAMC) Value :  2
AT91C_BCRAMC_TCKA_3       EQU (0x3 <<  8) ;- (BCRAMC) Value :  3
AT91C_BCRAMC_TCKA_4       EQU (0x4 <<  8) ;- (BCRAMC) Value :  4
AT91C_BCRAMC_TCKA_5       EQU (0x5 <<  8) ;- (BCRAMC) Value :  5
AT91C_BCRAMC_TCKA_6       EQU (0x6 <<  8) ;- (BCRAMC) Value :  6
AT91C_BCRAMC_TCKA_7       EQU (0x7 <<  8) ;- (BCRAMC) Value :  7
AT91C_BCRAMC_TCKA_8       EQU (0x8 <<  8) ;- (BCRAMC) Value :  8
AT91C_BCRAMC_TCKA_9       EQU (0x9 <<  8) ;- (BCRAMC) Value :  9
AT91C_BCRAMC_TCKA_10      EQU (0xA <<  8) ;- (BCRAMC) Value : 10
AT91C_BCRAMC_TCKA_11      EQU (0xB <<  8) ;- (BCRAMC) Value : 11
AT91C_BCRAMC_TCKA_12      EQU (0xC <<  8) ;- (BCRAMC) Value : 12
AT91C_BCRAMC_TCKA_13      EQU (0xD <<  8) ;- (BCRAMC) Value : 13
AT91C_BCRAMC_TCKA_14      EQU (0xE <<  8) ;- (BCRAMC) Value : 14
AT91C_BCRAMC_TCKA_15      EQU (0xF <<  8) ;- (BCRAMC) Value : 15
/* - -------- BCRAMC_HSR : (BCRAMC Offset: 0x8) BCRAM Controller High Speed Register -------- */
AT91C_BCRAMC_DA           EQU (0x1 <<  0) ;- (BCRAMC) Decode Cycle Enable Bit
AT91C_BCRAMC_DA_DISABLE   EQU (0x0) ;- (BCRAMC) Disable Decode Cycle
AT91C_BCRAMC_DA_ENABLE    EQU (0x1) ;- (BCRAMC) Enable Decode Cycle
/* - -------- BCRAMC_LPR : (BCRAMC Offset: 0xc) BCRAM Controller Low-power Register -------- */
AT91C_BCRAMC_PAR          EQU (0x7 <<  0) ;- (BCRAMC) Partial Array Refresh
AT91C_BCRAMC_PAR_FULL     EQU (0x0) ;- (BCRAMC) Full Refresh
AT91C_BCRAMC_PAR_PARTIAL_BOTTOM_HALF EQU (0x1) ;- (BCRAMC) Partial Bottom Half Refresh
AT91C_BCRAMC_PAR_PARTIAL_BOTTOM_QUARTER EQU (0x2) ;- (BCRAMC) Partial Bottom Quarter Refresh
AT91C_BCRAMC_PAR_PARTIAL_BOTTOM_EIGTH EQU (0x3) ;- (BCRAMC) Partial Bottom eigth Refresh
AT91C_BCRAMC_PAR_NONE     EQU (0x4) ;- (BCRAMC) Not Refreshed
AT91C_BCRAMC_PAR_PARTIAL_TOP_HALF EQU (0x5) ;- (BCRAMC) Partial Top Half Refresh
AT91C_BCRAMC_PAR_PARTIAL_TOP_QUARTER EQU (0x6) ;- (BCRAMC) Partial Top Quarter Refresh
AT91C_BCRAMC_PAR_PARTIAL_TOP_EIGTH EQU (0x7) ;- (BCRAMC) Partial Top eigth Refresh
AT91C_BCRAMC_TCR          EQU (0x3 <<  4) ;- (BCRAMC) Temperature Compensated Self Refresh
AT91C_BCRAMC_TCR_85C      EQU (0x0 <<  4) ;- (BCRAMC) +85C Temperature
AT91C_BCRAMC_TCR_INTERNAL_OR_70C EQU (0x1 <<  4) ;- (BCRAMC) Internal Sensor or +70C Temperature
AT91C_BCRAMC_TCR_45C      EQU (0x2 <<  4) ;- (BCRAMC) +45C Temperature
AT91C_BCRAMC_TCR_15C      EQU (0x3 <<  4) ;- (BCRAMC) +15C Temperature
AT91C_BCRAMC_LPCB         EQU (0x3 <<  8) ;- (BCRAMC) Low-power Command Bit
AT91C_BCRAMC_LPCB_DISABLE EQU (0x0 <<  8) ;- (BCRAMC) Disable Low Power Features
AT91C_BCRAMC_LPCB_STANDBY EQU (0x1 <<  8) ;- (BCRAMC) Enable Cellular RAM Standby Mode
AT91C_BCRAMC_LPCB_DEEP_POWER_DOWN EQU (0x2 <<  8) ;- (BCRAMC) Enable Cellular RAM Deep Power Down Mode
/* - -------- BCRAMC_MDR : (BCRAMC Offset: 0x10) BCRAM Controller Memory Device Register -------- */
AT91C_BCRAMC_MD           EQU (0x3 <<  0) ;- (BCRAMC) Memory Device Type
AT91C_BCRAMC_MD_BCRAM_V10 EQU (0x0) ;- (BCRAMC) Busrt Cellular RAM v1.0
AT91C_BCRAMC_MD_BCRAM_V15 EQU (0x1) ;- (BCRAMC) Busrt Cellular RAM v1.5
AT91C_BCRAMC_MD_BCRAM_V20 EQU (0x2) ;- (BCRAMC) Busrt Cellular RAM v2.0

