una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91cap9.h
/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR DDR/SDRAM Controller*/
/* - ******************************************************************************/
/* - -------- SDDRC_MR : (SDDRC Offset: 0x0)  -------- */
AT91C_MODE                EQU (0xF <<  0) ;- (SDDRC) 
AT91C_MODE_NORMAL_CMD     EQU (0x0) ;- (SDDRC) Normal Mode
AT91C_MODE_NOP_CMD        EQU (0x1) ;- (SDDRC) Issue a NOP Command at every access
AT91C_MODE_PRCGALL_CMD    EQU (0x2) ;- (SDDRC) Issue a All Banks Precharge Command at every access
AT91C_MODE_LMR_CMD        EQU (0x3) ;- (SDDRC) Issue a Load Mode Register at every access
AT91C_MODE_RFSH_CMD       EQU (0x4) ;- (SDDRC) Issue a Refresh
AT91C_MODE_EXT_LMR_CMD    EQU (0x5) ;- (SDDRC) Issue an Extended Load Mode Register
AT91C_MODE_DEEP_CMD       EQU (0x6) ;- (SDDRC) Enter Deep Power Mode
/* - -------- SDDRC_RTR : (SDDRC Offset: 0x4)  -------- */
AT91C_COUNT               EQU (0xFFF <<  0) ;- (SDDRC) 
/* - -------- SDDRC_CR : (SDDRC Offset: 0x8)  -------- */
AT91C_NC                  EQU (0x3 <<  0) ;- (SDDRC) 
AT91C_NC_DDR9_SDR8        EQU (0x0) ;- (SDDRC) DDR 9 Bits | SDR 8 Bits
AT91C_NC_DDR10_SDR9       EQU (0x1) ;- (SDDRC) DDR 10 Bits | SDR 9 Bits
AT91C_NC_DDR11_SDR10      EQU (0x2) ;- (SDDRC) DDR 11 Bits | SDR 10 Bits
AT91C_NC_DDR12_SDR11      EQU (0x3) ;- (SDDRC) DDR 12 Bits | SDR 11 Bits
AT91C_NR                  EQU (0x3 <<  2) ;- (SDDRC) 
AT91C_NR_11               EQU (0x0 <<  2) ;- (SDDRC) 11 Bits
AT91C_NR_12               EQU (0x1 <<  2) ;- (SDDRC) 12 Bits
AT91C_NR_13               EQU (0x2 <<  2) ;- (SDDRC) 13 Bits
AT91C_NR_14               EQU (0x3 <<  2) ;- (SDDRC) 14 Bits
AT91C_CAS                 EQU (0x7 <<  4) ;- (SDDRC) 
AT91C_CAS_2               EQU (0x2 <<  4) ;- (SDDRC) 2 cycles
AT91C_CAS_3               EQU (0x3 <<  4) ;- (SDDRC) 3 cycles
AT91C_DLL                 EQU (0x1 <<  7) ;- (SDDRC) 
AT91C_DLL_RESET_DISABLED  EQU (0x0 <<  7) ;- (SDDRC) Disable DLL reset
AT91C_DLL_RESET_ENABLED   EQU (0x1 <<  7) ;- (SDDRC) Enable DLL reset
AT91C_DIC_DS              EQU (0x1 <<  8) ;- (SDDRC) 
/* - -------- SDDRC_T0PR : (SDDRC Offset: 0xc)  -------- */
AT91C_TRAS                EQU (0xF <<  0) ;- (SDDRC) 
AT91C_TRAS_0              EQU (0x0) ;- (SDDRC) Value :  0
AT91C_TRAS_1              EQU (0x1) ;- (SDDRC) Value :  1
AT91C_TRAS_2              EQU (0x2) ;- (SDDRC) Value :  2
AT91C_TRAS_3              EQU (0x3) ;- (SDDRC) Value :  3
AT91C_TRAS_4              EQU (0x4) ;- (SDDRC) Value :  4
AT91C_TRAS_5              EQU (0x5) ;- (SDDRC) Value :  5
AT91C_TRAS_6              EQU (0x6) ;- (SDDRC) Value :  6
AT91C_TRAS_7              EQU (0x7) ;- (SDDRC) Value :  7
AT91C_TRAS_8              EQU (0x8) ;- (SDDRC) Value :  8
AT91C_TRAS_9              EQU (0x9) ;- (SDDRC) Value :  9
AT91C_TRAS_10             EQU (0xA) ;- (SDDRC) Value : 10
AT91C_TRAS_11             EQU (0xB) ;- (SDDRC) Value : 11
AT91C_TRAS_12             EQU (0xC) ;- (SDDRC) Value : 12
AT91C_TRAS_13             EQU (0xD) ;- (SDDRC) Value : 13
AT91C_TRAS_14             EQU (0xE) ;- (SDDRC) Value : 14
AT91C_TRAS_15             EQU (0xF) ;- (SDDRC) Value : 15
AT91C_TRCD                EQU (0xF <<  4) ;- (SDDRC) 
AT91C_TRCD_0              EQU (0x0 <<  4) ;- (SDDRC) Value :  0
AT91C_TRCD_1              EQU (0x1 <<  4) ;- (SDDRC) Value :  1
AT91C_TRCD_2              EQU (0x2 <<  4) ;- (SDDRC) Value :  2
AT91C_TRCD_3              EQU (0x3 <<  4) ;- (SDDRC) Value :  3
AT91C_TRCD_4              EQU (0x4 <<  4) ;- (SDDRC) Value :  4
AT91C_TRCD_5              EQU (0x5 <<  4) ;- (SDDRC) Value :  5
AT91C_TRCD_6              EQU (0x6 <<  4) ;- (SDDRC) Value :  6
AT91C_TRCD_7              EQU (0x7 <<  4) ;- (SDDRC) Value :  7
AT91C_TRCD_8              EQU (0x8 <<  4) ;- (SDDRC) Value :  8
AT91C_TRCD_9              EQU (0x9 <<  4) ;- (SDDRC) Value :  9
AT91C_TRCD_10             EQU (0xA <<  4) ;- (SDDRC) Value : 10
AT91C_TRCD_11             EQU (0xB <<  4) ;- (SDDRC) Value : 11
AT91C_TRCD_12             EQU (0xC <<  4) ;- (SDDRC) Value : 12
AT91C_TRCD_13             EQU (0xD <<  4) ;- (SDDRC) Value : 13
AT91C_TRCD_14             EQU (0xE <<  4) ;- (SDDRC) Value : 14
AT91C_TRCD_15             EQU (0xF <<  4) ;- (SDDRC) Value : 15
AT91C_TWR                 EQU (0xF <<  8) ;- (SDDRC) 
AT91C_TWR_0               EQU (0x0 <<  8) ;- (SDDRC) Value :  0
AT91C_TWR_1               EQU (0x1 <<  8) ;- (SDDRC) Value :  1
AT91C_TWR_2               EQU (0x2 <<  8) ;- (SDDRC) Value :  2
AT91C_TWR_3               EQU (0x3 <<  8) ;- (SDDRC) Value :  3
AT91C_TWR_4               EQU (0x4 <<  8) ;- (SDDRC) Value :  4
AT91C_TWR_5               EQU (0x5 <<  8) ;- (SDDRC) Value :  5
AT91C_TWR_6               EQU (0x6 <<  8) ;- (SDDRC) Value :  6
AT91C_TWR_7               EQU (0x7 <<  8) ;- (SDDRC) Value :  7
AT91C_TWR_8               EQU (0x8 <<  8) ;- (SDDRC) Value :  8
AT91C_TWR_9               EQU (0x9 <<  8) ;- (SDDRC) Value :  9
AT91C_TWR_10              EQU (0xA <<  8) ;- (SDDRC) Value : 10
AT91C_TWR_11              EQU (0xB <<  8) ;- (SDDRC) Value : 11
AT91C_TWR_12              EQU (0xC <<  8) ;- (SDDRC) Value : 12
AT91C_TWR_13              EQU (0xD <<  8) ;- (SDDRC) Value : 13
AT91C_TWR_14              EQU (0xE <<  8) ;- (SDDRC) Value : 14
AT91C_TWR_15              EQU (0xF <<  8) ;- (SDDRC) Value : 15
AT91C_TRC                 EQU (0xF << 12) ;- (SDDRC) 
AT91C_TRC_0               EQU (0x0 << 12) ;- (SDDRC) Value :  0
AT91C_TRC_1               EQU (0x1 << 12) ;- (SDDRC) Value :  1
AT91C_TRC_2               EQU (0x2 << 12) ;- (SDDRC) Value :  2
AT91C_TRC_3               EQU (0x3 << 12) ;- (SDDRC) Value :  3
AT91C_TRC_4               EQU (0x4 << 12) ;- (SDDRC) Value :  4
AT91C_TRC_5               EQU (0x5 << 12) ;- (SDDRC) Value :  5
AT91C_TRC_6               EQU (0x6 << 12) ;- (SDDRC) Value :  6
AT91C_TRC_7               EQU (0x7 << 12) ;- (SDDRC) Value :  7
AT91C_TRC_8               EQU (0x8 << 12) ;- (SDDRC) Value :  8
AT91C_TRC_9               EQU (0x9 << 12) ;- (SDDRC) Value :  9
AT91C_TRC_10              EQU (0xA << 12) ;- (SDDRC) Value : 10
AT91C_TRC_11              EQU (0xB << 12) ;- (SDDRC) Value : 11
AT91C_TRC_12              EQU (0xC << 12) ;- (SDDRC) Value : 12
AT91C_TRC_13              EQU (0xD << 12) ;- (SDDRC) Value : 13
AT91C_TRC_14              EQU (0xE << 12) ;- (SDDRC) Value : 14
AT91C_TRC_15              EQU (0xF << 12) ;- (SDDRC) Value : 15
AT91C_TRP                 EQU (0xF << 16) ;- (SDDRC) 
AT91C_TRP_0               EQU (0x0 << 16) ;- (SDDRC) Value :  0
AT91C_TRP_1               EQU (0x1 << 16) ;- (SDDRC) Value :  1
AT91C_TRP_2               EQU (0x2 << 16) ;- (SDDRC) Value :  2
AT91C_TRP_3               EQU (0x3 << 16) ;- (SDDRC) Value :  3
AT91C_TRP_4               EQU (0x4 << 16) ;- (SDDRC) Value :  4
AT91C_TRP_5               EQU (0x5 << 16) ;- (SDDRC) Value :  5
AT91C_TRP_6               EQU (0x6 << 16) ;- (SDDRC) Value :  6
AT91C_TRP_7               EQU (0x7 << 16) ;- (SDDRC) Value :  7
AT91C_TRP_8               EQU (0x8 << 16) ;- (SDDRC) Value :  8
AT91C_TRP_9               EQU (0x9 << 16) ;- (SDDRC) Value :  9
AT91C_TRP_10              EQU (0xA << 16) ;- (SDDRC) Value : 10
AT91C_TRP_11              EQU (0xB << 16) ;- (SDDRC) Value : 11
AT91C_TRP_12              EQU (0xC << 16) ;- (SDDRC) Value : 12
AT91C_TRP_13              EQU (0xD << 16) ;- (SDDRC) Value : 13
AT91C_TRP_14              EQU (0xE << 16) ;- (SDDRC) Value : 14
AT91C_TRP_15              EQU (0xF << 16) ;- (SDDRC) Value : 15
AT91C_TRRD                EQU (0xF << 20) ;- (SDDRC) 
AT91C_TRRD_0              EQU (0x0 << 20) ;- (SDDRC) Value :  0
AT91C_TRRD_1              EQU (0x1 << 20) ;- (SDDRC) Value :  1
AT91C_TRRD_2              EQU (0x2 << 20) ;- (SDDRC) Value :  2
AT91C_TRRD_3              EQU (0x3 << 20) ;- (SDDRC) Value :  3
AT91C_TRRD_4              EQU (0x4 << 20) ;- (SDDRC) Value :  4
AT91C_TRRD_5              EQU (0x5 << 20) ;- (SDDRC) Value :  5
AT91C_TRRD_6              EQU (0x6 << 20) ;- (SDDRC) Value :  6
AT91C_TRRD_7              EQU (0x7 << 20) ;- (SDDRC) Value :  7
AT91C_TRRD_8              EQU (0x8 << 20) ;- (SDDRC) Value :  8
AT91C_TRRD_9              EQU (0x9 << 20) ;- (SDDRC) Value :  9
AT91C_TRRD_10             EQU (0xA << 20) ;- (SDDRC) Value : 10
AT91C_TRRD_11             EQU (0xB << 20) ;- (SDDRC) Value : 11
AT91C_TRRD_12             EQU (0xC << 20) ;- (SDDRC) Value : 12
AT91C_TRRD_13             EQU (0xD << 20) ;- (SDDRC) Value : 13
AT91C_TRRD_14             EQU (0xE << 20) ;- (SDDRC) Value : 14
AT91C_TRRD_15             EQU (0xF << 20) ;- (SDDRC) Value : 15
AT91C_TWTR                EQU (0x1 << 24) ;- (SDDRC) 
AT91C_TWTR_0              EQU (0x0 << 24) ;- (SDDRC) Value :  0
AT91C_TWTR_1              EQU (0x1 << 24) ;- (SDDRC) Value :  1
AT91C_TMRD                EQU (0xF << 28) ;- (SDDRC) 
AT91C_TMRD_0              EQU (0x0 << 28) ;- (SDDRC) Value :  0
AT91C_TMRD_1              EQU (0x1 << 28) ;- (SDDRC) Value :  1
AT91C_TMRD_2              EQU (0x2 << 28) ;- (SDDRC) Value :  2
AT91C_TMRD_3              EQU (0x3 << 28) ;- (SDDRC) Value :  3
AT91C_TMRD_4              EQU (0x4 << 28) ;- (SDDRC) Value :  4
AT91C_TMRD_5              EQU (0x5 << 28) ;- (SDDRC) Value :  5
AT91C_TMRD_6              EQU (0x6 << 28) ;- (SDDRC) Value :  6
AT91C_TMRD_7              EQU (0x7 << 28) ;- (SDDRC) Value :  7
AT91C_TMRD_8              EQU (0x8 << 28) ;- (SDDRC) Value :  8
AT91C_TMRD_9              EQU (0x9 << 28) ;- (SDDRC) Value :  9
AT91C_TMRD_10             EQU (0xA << 28) ;- (SDDRC) Value : 10
AT91C_TMRD_11             EQU (0xB << 28) ;- (SDDRC) Value : 11
AT91C_TMRD_12             EQU (0xC << 28) ;- (SDDRC) Value : 12
AT91C_TMRD_13             EQU (0xD << 28) ;- (SDDRC) Value : 13
AT91C_TMRD_14             EQU (0xE << 28) ;- (SDDRC) Value : 14
AT91C_TMRD_15             EQU (0xF << 28) ;- (SDDRC) Value : 15
/* - -------- SDDRC_T1PR : (SDDRC Offset: 0x10)  -------- */
AT91C_TRFC                EQU (0x1F <<  0) ;- (SDDRC) 
AT91C_TRFC_0              EQU (0x0) ;- (SDDRC) Value :  0
AT91C_TRFC_1              EQU (0x1) ;- (SDDRC) Value :  1
AT91C_TRFC_2              EQU (0x2) ;- (SDDRC) Value :  2
AT91C_TRFC_3              EQU (0x3) ;- (SDDRC) Value :  3
AT91C_TRFC_4              EQU (0x4) ;- (SDDRC) Value :  4
AT91C_TRFC_5              EQU (0x5) ;- (SDDRC) Value :  5
AT91C_TRFC_6              EQU (0x6) ;- (SDDRC) Value :  6
AT91C_TRFC_7              EQU (0x7) ;- (SDDRC) Value :  7
AT91C_TRFC_8              EQU (0x8) ;- (SDDRC) Value :  8
AT91C_TRFC_9              EQU (0x9) ;- (SDDRC) Value :  9
AT91C_TRFC_10             EQU (0xA) ;- (SDDRC) Value : 10
AT91C_TRFC_11             EQU (0xB) ;- (SDDRC) Value : 11
AT91C_TRFC_12             EQU (0xC) ;- (SDDRC) Value : 12
AT91C_TRFC_13             EQU (0xD) ;- (SDDRC) Value : 13
AT91C_TRFC_14             EQU (0xE) ;- (SDDRC) Value : 14
AT91C_TRFC_15             EQU (0xF) ;- (SDDRC) Value : 15
AT91C_TRFC_16             EQU (0x10) ;- (SDDRC) Value : 16
AT91C_TRFC_17             EQU (0x11) ;- (SDDRC) Value : 17
AT91C_TRFC_18             EQU (0x12) ;- (SDDRC) Value : 18
AT91C_TRFC_19             EQU (0x13) ;- (SDDRC) Value : 19
AT91C_TRFC_20             EQU (0x14) ;- (SDDRC) Value : 20
AT91C_TRFC_21             EQU (0x15) ;- (SDDRC) Value : 21
AT91C_TRFC_22             EQU (0x16) ;- (SDDRC) Value : 22
AT91C_TRFC_23             EQU (0x17) ;- (SDDRC) Value : 23
AT91C_TRFC_24             EQU (0x18) ;- (SDDRC) Value : 24
AT91C_TRFC_25             EQU (0x19) ;- (SDDRC) Value : 25
AT91C_TRFC_26             EQU (0x1A) ;- (SDDRC) Value : 26
AT91C_TRFC_27             EQU (0x1B) ;- (SDDRC) Value : 27
AT91C_TRFC_28             EQU (0x1C) ;- (SDDRC) Value : 28
AT91C_TRFC_29             EQU (0x1D) ;- (SDDRC) Value : 29
AT91C_TRFC_30             EQU (0x1E) ;- (SDDRC) Value : 30
AT91C_TRFC_31             EQU (0x1F) ;- (SDDRC) Value : 31
AT91C_TXSNR               EQU (0xFF <<  8) ;- (SDDRC) 
AT91C_TXSNR_0             EQU (0x0 <<  8) ;- (SDDRC) Value :  0
AT91C_TXSNR_1             EQU (0x1 <<  8) ;- (SDDRC) Value :  1
AT91C_TXSNR_2             EQU (0x2 <<  8) ;- (SDDRC) Value :  2
AT91C_TXSNR_3             EQU (0x3 <<  8) ;- (SDDRC) Value :  3
AT91C_TXSNR_4             EQU (0x4 <<  8) ;- (SDDRC) Value :  4
AT91C_TXSNR_5             EQU (0x5 <<  8) ;- (SDDRC) Value :  5
AT91C_TXSNR_6             EQU (0x6 <<  8) ;- (SDDRC) Value :  6
AT91C_TXSNR_7             EQU (0x7 <<  8) ;- (SDDRC) Value :  7
AT91C_TXSNR_8             EQU (0x8 <<  8) ;- (SDDRC) Value :  8
AT91C_TXSNR_9             EQU (0x9 <<  8) ;- (SDDRC) Value :  9
AT91C_TXSNR_10            EQU (0xA <<  8) ;- (SDDRC) Value : 10
AT91C_TXSNR_11            EQU (0xB <<  8) ;- (SDDRC) Value : 11
AT91C_TXSNR_12            EQU (0xC <<  8) ;- (SDDRC) Value : 12
AT91C_TXSNR_13            EQU (0xD <<  8) ;- (SDDRC) Value : 13
AT91C_TXSNR_14            EQU (0xE <<  8) ;- (SDDRC) Value : 14
AT91C_TXSNR_15            EQU (0xF <<  8) ;- (SDDRC) Value : 15
AT91C_TXSRD               EQU (0xFF << 16) ;- (SDDRC) 
AT91C_TXSRD_0             EQU (0x0 << 16) ;- (SDDRC) Value :  0
AT91C_TXSRD_1             EQU (0x1 << 16) ;- (SDDRC) Value :  1
AT91C_TXSRD_2             EQU (0x2 << 16) ;- (SDDRC) Value :  2
AT91C_TXSRD_3             EQU (0x3 << 16) ;- (SDDRC) Value :  3
AT91C_TXSRD_4             EQU (0x4 << 16) ;- (SDDRC) Value :  4
AT91C_TXSRD_5             EQU (0x5 << 16) ;- (SDDRC) Value :  5
AT91C_TXSRD_6             EQU (0x6 << 16) ;- (SDDRC) Value :  6
AT91C_TXSRD_7             EQU (0x7 << 16) ;- (SDDRC) Value :  7
AT91C_TXSRD_8             EQU (0x8 << 16) ;- (SDDRC) Value :  8
AT91C_TXSRD_9             EQU (0x9 << 16) ;- (SDDRC) Value :  9
AT91C_TXSRD_10            EQU (0xA << 16) ;- (SDDRC) Value : 10
AT91C_TXSRD_11            EQU (0xB << 16) ;- (SDDRC) Value : 11
AT91C_TXSRD_12            EQU (0xC << 16) ;- (SDDRC) Value : 12
AT91C_TXSRD_13            EQU (0xD << 16) ;- (SDDRC) Value : 13
AT91C_TXSRD_14            EQU (0xE << 16) ;- (SDDRC) Value : 14
AT91C_TXSRD_15            EQU (0xF << 16) ;- (SDDRC) Value : 15
AT91C_TXP                 EQU (0xF << 24) ;- (SDDRC) 
AT91C_TXP_0               EQU (0x0 << 24) ;- (SDDRC) Value :  0
AT91C_TXP_1               EQU (0x1 << 24) ;- (SDDRC) Value :  1
AT91C_TXP_2               EQU (0x2 << 24) ;- (SDDRC) Value :  2
AT91C_TXP_3               EQU (0x3 << 24) ;- (SDDRC) Value :  3
AT91C_TXP_4               EQU (0x4 << 24) ;- (SDDRC) Value :  4
AT91C_TXP_5               EQU (0x5 << 24) ;- (SDDRC) Value :  5
AT91C_TXP_6               EQU (0x6 << 24) ;- (SDDRC) Value :  6
AT91C_TXP_7               EQU (0x7 << 24) ;- (SDDRC) Value :  7
AT91C_TXP_8               EQU (0x8 << 24) ;- (SDDRC) Value :  8
AT91C_TXP_9               EQU (0x9 << 24) ;- (SDDRC) Value :  9
AT91C_TXP_10              EQU (0xA << 24) ;- (SDDRC) Value : 10
AT91C_TXP_11              EQU (0xB << 24) ;- (SDDRC) Value : 11
AT91C_TXP_12              EQU (0xC << 24) ;- (SDDRC) Value : 12
AT91C_TXP_13              EQU (0xD << 24) ;- (SDDRC) Value : 13
AT91C_TXP_14              EQU (0xE << 24) ;- (SDDRC) Value : 14
AT91C_TXP_15              EQU (0xF << 24) ;- (SDDRC) Value : 15
/* - -------- SDDRC_HS : (SDDRC Offset: 0x14)  -------- */
AT91C_DA                  EQU (0x1 <<  0) ;- (SDDRC) 
AT91C_OVL                 EQU (0x1 <<  1) ;- (SDDRC) 
/* - -------- SDDRC_LPR : (SDDRC Offset: 0x18)  -------- */
AT91C_LPCB                EQU (0x3 <<  0) ;- (SDDRC) 
AT91C_PASR                EQU (0x7 <<  4) ;- (SDDRC) 
AT91C_LP_TRC              EQU (0x3 <<  8) ;- (SDDRC) 
AT91C_DS                  EQU (0x3 << 10) ;- (SDDRC) 
AT91C_TIMEOUT             EQU (0x3 << 12) ;- (SDDRC) 
/* - -------- SDDRC_MDR : (SDDRC Offset: 0x1c)  -------- */
AT91C_MD                  EQU (0x3 <<  0) ;- (SDDRC) 
AT91C_MD_SDR_SDRAM        EQU (0x0) ;- (SDDRC) SDR_SDRAM
AT91C_MD_LP_SDR_SDRAM     EQU (0x1) ;- (SDDRC) Low Power SDR_SDRAM
AT91C_MD_DDR_SDRAM        EQU (0x2) ;- (SDDRC) DDR_SDRAM
AT91C_MD_LP_DDR_SDRAM     EQU (0x3) ;- (SDDRC) Low Power DDR_SDRAM
AT91C_B16MODE             EQU (0x1 <<  4) ;- (SDDRC) 
AT91C_B16MODE_32_BITS     EQU (0x0 <<  4) ;- (SDDRC) 32 Bits datas bus
AT91C_B16MODE_16_BITS     EQU (0x1 <<  4) ;- (SDDRC) 16 Bits datas bus

