una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91cap9.h
/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR AHB CCFG Interface*/
/* - ******************************************************************************/
/* - -------- CCFG_TCMR : (CCFG Offset: 0x0) TCM Configuration -------- */
AT91C_CCFG_ITCM_SIZE      EQU (0xF <<  0) ;- (CCFG) Size of ITCM enabled memory block
AT91C_CCFG_ITCM_SIZE_0KB  EQU (0x0) ;- (CCFG) 0 KB (No ITCM Memory)
AT91C_CCFG_ITCM_SIZE_16KB EQU (0x5) ;- (CCFG) 16 KB
AT91C_CCFG_ITCM_SIZE_32KB EQU (0x6) ;- (CCFG) 32 KB
AT91C_CCFG_DTCM_SIZE      EQU (0xF <<  4) ;- (CCFG) Size of DTCM enabled memory block
AT91C_CCFG_DTCM_SIZE_0KB  EQU (0x0 <<  4) ;- (CCFG) 0 KB (No DTCM Memory)
AT91C_CCFG_DTCM_SIZE_16KB EQU (0x5 <<  4) ;- (CCFG) 16 KB
AT91C_CCFG_DTCM_SIZE_32KB EQU (0x6 <<  4) ;- (CCFG) 32 KB
AT91C_CCFG_WAIT_STATE_TCM EQU (0x1 << 11) ;- (CCFG) Wait state TCM register
AT91C_CCFG_WAIT_STATE_TCM_NO_WS EQU (0x0 << 11) ;- (CCFG) NO WAIT STATE : 0 WS
AT91C_CCFG_WAIT_STATE_TCM_ONE_WS EQU (0x1 << 11) ;- (CCFG) 1 WS activated (only for RATIO 3:1 or 4:1
/* - -------- CCFG_UDPHS : (CCFG Offset: 0x8) UDPHS Configuration -------- */
AT91C_CCFG_UDPHS_UDP_SELECT EQU (0x1 << 31) ;- (CCFG) UDPHS or UDP Selection
AT91C_CCFG_UDPHS_UDP_SELECT_UDPHS EQU (0x0 << 31) ;- (CCFG) UDPHS Selected.
AT91C_CCFG_UDPHS_UDP_SELECT_UDP EQU (0x1 << 31) ;- (CCFG) UDP Selected.
/* - -------- CCFG_EBICSA : (CCFG Offset: 0x10) EBI Chip Select Assignement Register -------- */
AT91C_EBI_CS1A            EQU (0x1 <<  1) ;- (CCFG) Chip Select 1 Assignment
AT91C_EBI_CS1A_SMC        EQU (0x0 <<  1) ;- (CCFG) Chip Select 1 is assigned to the Static Memory Controller.
AT91C_EBI_CS1A_BCRAMC     EQU (0x1 <<  1) ;- (CCFG) Chip Select 1 is assigned to the BCRAM Controller.
AT91C_EBI_CS3A            EQU (0x1 <<  3) ;- (CCFG) Chip Select 3 Assignment
AT91C_EBI_CS3A_SMC        EQU (0x0 <<  3) ;- (CCFG) Chip Select 3 is only assigned to the Static Memory Controller and NCS3 behaves as defined by the SMC.
AT91C_EBI_CS3A_SM         EQU (0x1 <<  3) ;- (CCFG) Chip Select 3 is assigned to the Static Memory Controller and the SmartMedia Logic is activated.
AT91C_EBI_CS4A            EQU (0x1 <<  4) ;- (CCFG) Chip Select 4 Assignment
AT91C_EBI_CS4A_SMC        EQU (0x0 <<  4) ;- (CCFG) Chip Select 4 is only assigned to the Static Memory Controller and NCS4 behaves as defined by the SMC.
AT91C_EBI_CS4A_CF         EQU (0x1 <<  4) ;- (CCFG) Chip Select 4 is assigned to the Static Memory Controller and the CompactFlash Logic (first slot) is activated.
AT91C_EBI_CS5A            EQU (0x1 <<  5) ;- (CCFG) Chip Select 5 Assignment
AT91C_EBI_CS5A_SMC        EQU (0x0 <<  5) ;- (CCFG) Chip Select 5 is only assigned to the Static Memory Controller and NCS5 behaves as defined by the SMC
AT91C_EBI_CS5A_CF         EQU (0x1 <<  5) ;- (CCFG) Chip Select 5 is assigned to the Static Memory Controller and the CompactFlash Logic (second slot) is activated.
AT91C_EBI_DBPUC           EQU (0x1 <<  8) ;- (CCFG) Data Bus Pull-up Configuration
AT91C_EBI_DDRPUC          EQU (0x1 <<  9) ;- (CCFG) DDDR DQS Pull-up Configuration
AT91C_EBI_SUP             EQU (0x1 << 16) ;- (CCFG) EBI Supply
AT91C_EBI_SUP_1V8         EQU (0x0 << 16) ;- (CCFG) EBI Supply is 1.8V
AT91C_EBI_SUP_3V3         EQU (0x1 << 16) ;- (CCFG) EBI Supply is 3.3V
AT91C_EBI_LP              EQU (0x1 << 17) ;- (CCFG) EBI Low Power Reduction
AT91C_EBI_LP_LOW_DRIVE    EQU (0x0 << 17) ;- (CCFG) EBI Pads are in Standard drive
AT91C_EBI_LP_STD_DRIVE    EQU (0x1 << 17) ;- (CCFG) EBI Pads are in Low Drive (Low Power)
AT91C_CCFG_DDR_SDR_SELECT EQU (0x1 << 31) ;- (CCFG) DDR or SDR Selection
AT91C_CCFG_DDR_SDR_SELECT_DDR EQU (0x0 << 31) ;- (CCFG) DDR Selected.
AT91C_CCFG_DDR_SDR_SELECT_SDR EQU (0x1 << 31) ;- (CCFG) SDR Selected.
/* - -------- CCFG_EBI1CSA : (CCFG Offset: 0x14) EBI1 Chip Select Assignement Register -------- */
AT91C_EBI_CS2A            EQU (0x1 <<  3) ;- (CCFG) EBI1 Chip Select 2 Assignment
AT91C_EBI_CS2A_SMC        EQU (0x0 <<  3) ;- (CCFG) Chip Select 2 is assigned to the Static Memory Controller.
AT91C_EBI_CS2A_SM         EQU (0x1 <<  3) ;- (CCFG) Chip Select 2 is assigned to the Static Memory Controller and the SmartMedia Logic is activated.
/* - -------- CCFG_EBICSA : (CCFG Offset: 0x18) EBI Chip Select Assignement Register -------- */
AT91C_EBI_SUPPLY          EQU (0x1 << 16) ;- (CCFG) EBI supply set to 1.8
AT91C_EBI_DRV             EQU (0x1 << 17) ;- (CCFG) Drive type for EBI pads
AT91C_CCFG_DDR_DRV        EQU (0x1 << 18) ;- (CCFG) Drive type for DDR2 dedicated port
/* - -------- CCFG_BRIDGE : (CCFG Offset: 0x24) BRIDGE Configuration -------- */
AT91C_CCFG_AES_TDES_SELECT EQU (0x1 << 31) ;- (CCFG) AES or TDES Selection
AT91C_CCFG_AES_TDES_SELECT_AES EQU (0x0 << 31) ;- (CCFG) AES Selected.
AT91C_CCFG_AES_TDES_SELECT_TDES EQU (0x1 << 31) ;- (CCFG) TDES Selected.

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR Peripheral DMA Controller*/
/* - ******************************************************************************/
/* - -------- PDC_PTCR : (PDC Offset: 0x20) PDC Transfer Control Register -------- */
AT91C_PDC_RXTEN           EQU (0x1 <<  0) ;- (PDC) Receiver Transfer Enable
AT91C_PDC_RXTDIS          EQU (0x1 <<  1) ;- (PDC) Receiver Transfer Disable
AT91C_PDC_TXTEN           EQU (0x1 <<  8) ;- (PDC) Transmitter Transfer Enable
AT91C_PDC_TXTDIS          EQU (0x1 <<  9) ;- (PDC) Transmitter Transfer Disable
/* - -------- PDC_PTSR : (PDC Offset: 0x24) PDC Transfer Status Register -------- */

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR Debug Unit*/
/* - ******************************************************************************/
/* - -------- DBGU_CR : (DBGU Offset: 0x0) Debug Unit Control Register -------- */
AT91C_US_RSTRX            EQU (0x1 <<  2) ;- (DBGU) Reset Receiver
AT91C_US_RSTTX            EQU (0x1 <<  3) ;- (DBGU) Reset Transmitter
AT91C_US_RXEN             EQU (0x1 <<  4) ;- (DBGU) Receiver Enable
AT91C_US_RXDIS            EQU (0x1 <<  5) ;- (DBGU) Receiver Disable
AT91C_US_TXEN             EQU (0x1 <<  6) ;- (DBGU) Transmitter Enable
AT91C_US_TXDIS            EQU (0x1 <<  7) ;- (DBGU) Transmitter Disable
AT91C_US_RSTSTA           EQU (0x1 <<  8) ;- (DBGU) Reset Status Bits
/* - -------- DBGU_MR : (DBGU Offset: 0x4) Debug Unit Mode Register -------- */
AT91C_US_PAR              EQU (0x7 <<  9) ;- (DBGU) Parity type
AT91C_US_PAR_EVEN         EQU (0x0 <<  9) ;- (DBGU) Even Parity
AT91C_US_PAR_ODD          EQU (0x1 <<  9) ;- (DBGU) Odd Parity
AT91C_US_PAR_SPACE        EQU (0x2 <<  9) ;- (DBGU) Parity forced to 0 (Space)
AT91C_US_PAR_MARK         EQU (0x3 <<  9) ;- (DBGU) Parity forced to 1 (Mark)
AT91C_US_PAR_NONE         EQU (0x4 <<  9) ;- (DBGU) No Parity
AT91C_US_PAR_MULTI_DROP   EQU (0x6 <<  9) ;- (DBGU) Multi-drop mode
AT91C_US_CHMODE           EQU (0x3 << 14) ;- (DBGU) Channel Mode
AT91C_US_CHMODE_NORMAL    EQU (0x0 << 14) ;- (DBGU) Normal Mode: The USART channel operates as an RX/TX USART.
AT91C_US_CHMODE_AUTO      EQU (0x1 << 14) ;- (DBGU) Automatic Echo: Receiver Data Input is connected to the TXD pin.
AT91C_US_CHMODE_LOCAL     EQU (0x2 << 14) ;- (DBGU) Local Loopback: Transmitter Output Signal is connected to Receiver Input Signal.
AT91C_US_CHMODE_REMOTE    EQU (0x3 << 14) ;- (DBGU) Remote Loopback: RXD pin is internally connected to TXD pin.
/* - -------- DBGU_IER : (DBGU Offset: 0x8) Debug Unit Interrupt Enable Register -------- */
AT91C_US_RXRDY            EQU (0x1 <<  0) ;- (DBGU) RXRDY Interrupt
AT91C_US_TXRDY            EQU (0x1 <<  1) ;- (DBGU) TXRDY Interrupt
AT91C_US_ENDRX            EQU (0x1 <<  3) ;- (DBGU) End of Receive Transfer Interrupt
AT91C_US_ENDTX            EQU (0x1 <<  4) ;- (DBGU) End of Transmit Interrupt
AT91C_US_OVRE             EQU (0x1 <<  5) ;- (DBGU) Overrun Interrupt
AT91C_US_FRAME            EQU (0x1 <<  6) ;- (DBGU) Framing Error Interrupt
AT91C_US_PARE             EQU (0x1 <<  7) ;- (DBGU) Parity Error Interrupt
AT91C_US_TXEMPTY          EQU (0x1 <<  9) ;- (DBGU) TXEMPTY Interrupt
AT91C_US_TXBUFE           EQU (0x1 << 11) ;- (DBGU) TXBUFE Interrupt
AT91C_US_RXBUFF           EQU (0x1 << 12) ;- (DBGU) RXBUFF Interrupt
AT91C_US_COMM_TX          EQU (0x1 << 30) ;- (DBGU) COMM_TX Interrupt
AT91C_US_COMM_RX          EQU (0x1 << 31) ;- (DBGU) COMM_RX Interrupt
/* - -------- DBGU_IDR : (DBGU Offset: 0xc) Debug Unit Interrupt Disable Register -------- */
/* - -------- DBGU_IMR : (DBGU Offset: 0x10) Debug Unit Interrupt Mask Register -------- */
/* - -------- DBGU_CSR : (DBGU Offset: 0x14) Debug Unit Channel Status Register -------- */
/* - -------- DBGU_FNTR : (DBGU Offset: 0x48) Debug Unit FORCE_NTRST Register -------- */
AT91C_US_FORCE_NTRST      EQU (0x1 <<  0) ;- (DBGU) Force NTRST in JTAG

