una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91cap9.h
/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR USB Device Interface*/
/* - ******************************************************************************/
/* - -------- UDP_FRM_NUM : (UDP Offset: 0x0) USB Frame Number Register -------- */
AT91C_UDP_FRM_NUM         EQU (0x7FF <<  0) ;- (UDP) Frame Number as Defined in the Packet Field Formats
AT91C_UDP_FRM_ERR         EQU (0x1 << 16) ;- (UDP) Frame Error
AT91C_UDP_FRM_OK          EQU (0x1 << 17) ;- (UDP) Frame OK
/* - -------- UDP_GLB_STATE : (UDP Offset: 0x4) USB Global State Register -------- */
AT91C_UDP_FADDEN          EQU (0x1 <<  0) ;- (UDP) Function Address Enable
AT91C_UDP_CONFG           EQU (0x1 <<  1) ;- (UDP) Configured
AT91C_UDP_ESR             EQU (0x1 <<  2) ;- (UDP) Enable Send Resume
AT91C_UDP_RSMINPR         EQU (0x1 <<  3) ;- (UDP) A Resume Has Been Sent to the Host
AT91C_UDP_RMWUPE          EQU (0x1 <<  4) ;- (UDP) Remote Wake Up Enable
/* - -------- UDP_FADDR : (UDP Offset: 0x8) USB Function Address Register -------- */
AT91C_UDP_FADD            EQU (0xFF <<  0) ;- (UDP) Function Address Value
AT91C_UDP_FEN             EQU (0x1 <<  8) ;- (UDP) Function Enable
/* - -------- UDP_IER : (UDP Offset: 0x10) USB Interrupt Enable Register -------- */
AT91C_UDP_EPINT0          EQU (0x1 <<  0) ;- (UDP) Endpoint 0 Interrupt
AT91C_UDP_EPINT1          EQU (0x1 <<  1) ;- (UDP) Endpoint 0 Interrupt
AT91C_UDP_EPINT2          EQU (0x1 <<  2) ;- (UDP) Endpoint 2 Interrupt
AT91C_UDP_EPINT3          EQU (0x1 <<  3) ;- (UDP) Endpoint 3 Interrupt
AT91C_UDP_EPINT4          EQU (0x1 <<  4) ;- (UDP) Endpoint 4 Interrupt
AT91C_UDP_EPINT5          EQU (0x1 <<  5) ;- (UDP) Endpoint 5 Interrupt
AT91C_UDP_RXSUSP          EQU (0x1 <<  8) ;- (UDP) USB Suspend Interrupt
AT91C_UDP_RXRSM           EQU (0x1 <<  9) ;- (UDP) USB Resume Interrupt
AT91C_UDP_EXTRSM          EQU (0x1 << 10) ;- (UDP) USB External Resume Interrupt
AT91C_UDP_SOFINT          EQU (0x1 << 11) ;- (UDP) USB Start Of frame Interrupt
AT91C_UDP_WAKEUP          EQU (0x1 << 13) ;- (UDP) USB Resume Interrupt
/* - -------- UDP_IDR : (UDP Offset: 0x14) USB Interrupt Disable Register -------- */
/* - -------- UDP_IMR : (UDP Offset: 0x18) USB Interrupt Mask Register -------- */
/* - -------- UDP_ISR : (UDP Offset: 0x1c) USB Interrupt Status Register -------- */
AT91C_UDP_ENDBUSRES       EQU (0x1 << 12) ;- (UDP) USB End Of Bus Reset Interrupt
/* - -------- UDP_ICR : (UDP Offset: 0x20) USB Interrupt Clear Register -------- */
/* - -------- UDP_RST_EP : (UDP Offset: 0x28) USB Reset Endpoint Register -------- */
AT91C_UDP_EP0             EQU (0x1 <<  0) ;- (UDP) Reset Endpoint 0
AT91C_UDP_EP1             EQU (0x1 <<  1) ;- (UDP) Reset Endpoint 1
AT91C_UDP_EP2             EQU (0x1 <<  2) ;- (UDP) Reset Endpoint 2
AT91C_UDP_EP3             EQU (0x1 <<  3) ;- (UDP) Reset Endpoint 3
AT91C_UDP_EP4             EQU (0x1 <<  4) ;- (UDP) Reset Endpoint 4
AT91C_UDP_EP5             EQU (0x1 <<  5) ;- (UDP) Reset Endpoint 5
/* - -------- UDP_CSR : (UDP Offset: 0x30) USB Endpoint Control and Status Register -------- */
AT91C_UDP_TXCOMP          EQU (0x1 <<  0) ;- (UDP) Generates an IN packet with data previously written in the DPR
AT91C_UDP_RX_DATA_BK0     EQU (0x1 <<  1) ;- (UDP) Receive Data Bank 0
AT91C_UDP_RXSETUP         EQU (0x1 <<  2) ;- (UDP) Sends STALL to the Host (Control endpoints)
AT91C_UDP_ISOERROR        EQU (0x1 <<  3) ;- (UDP) Isochronous error (Isochronous endpoints)
AT91C_UDP_STALLSENT       EQU (0x1 <<  3) ;- (UDP) Stall sent (Control, bulk, interrupt endpoints)
AT91C_UDP_TXPKTRDY        EQU (0x1 <<  4) ;- (UDP) Transmit Packet Ready
AT91C_UDP_FORCESTALL      EQU (0x1 <<  5) ;- (UDP) Force Stall (used by Control, Bulk and Isochronous endpoints).
AT91C_UDP_RX_DATA_BK1     EQU (0x1 <<  6) ;- (UDP) Receive Data Bank 1 (only used by endpoints with ping-pong attributes).
AT91C_UDP_DIR             EQU (0x1 <<  7) ;- (UDP) Transfer Direction
AT91C_UDP_EPTYPE          EQU (0x7 <<  8) ;- (UDP) Endpoint type
AT91C_UDP_EPTYPE_CTRL     EQU (0x0 <<  8) ;- (UDP) Control
AT91C_UDP_EPTYPE_ISO_OUT  EQU (0x1 <<  8) ;- (UDP) Isochronous OUT
AT91C_UDP_EPTYPE_BULK_OUT EQU (0x2 <<  8) ;- (UDP) Bulk OUT
AT91C_UDP_EPTYPE_INT_OUT  EQU (0x3 <<  8) ;- (UDP) Interrupt OUT
AT91C_UDP_EPTYPE_ISO_IN   EQU (0x5 <<  8) ;- (UDP) Isochronous IN
AT91C_UDP_EPTYPE_BULK_IN  EQU (0x6 <<  8) ;- (UDP) Bulk IN
AT91C_UDP_EPTYPE_INT_IN   EQU (0x7 <<  8) ;- (UDP) Interrupt IN
AT91C_UDP_DTGLE           EQU (0x1 << 11) ;- (UDP) Data Toggle
AT91C_UDP_EPEDS           EQU (0x1 << 15) ;- (UDP) Endpoint Enable Disable
AT91C_UDP_RXBYTECNT       EQU (0x7FF << 16) ;- (UDP) Number Of Bytes Available in the FIFO
/* - -------- UDP_TXVC : (UDP Offset: 0x74) Transceiver Control Register -------- */
AT91C_UDP_TXVDIS          EQU (0x1 <<  8) ;- (UDP) 
AT91C_UDP_PUON            EQU (0x1 <<  9) ;- (UDP) Pull-up ON

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR UDPHS Enpoint FIFO data register*/
/* - ******************************************************************************/

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR UDPHS Endpoint struct*/
/* - ******************************************************************************/
/* - -------- UDPHS_EPTCFG : (UDPHS_EPT Offset: 0x0) UDPHS Endpoint Config Register -------- */
AT91C_UDPHS_EPT_SIZE      EQU (0x7 <<  0) ;- (UDPHS_EPT) Endpoint Size
AT91C_UDPHS_EPT_SIZE_8    EQU (0x0) ;- (UDPHS_EPT)    8 bytes
AT91C_UDPHS_EPT_SIZE_16   EQU (0x1) ;- (UDPHS_EPT)   16 bytes
AT91C_UDPHS_EPT_SIZE_32   EQU (0x2) ;- (UDPHS_EPT)   32 bytes
AT91C_UDPHS_EPT_SIZE_64   EQU (0x3) ;- (UDPHS_EPT)   64 bytes
AT91C_UDPHS_EPT_SIZE_128  EQU (0x4) ;- (UDPHS_EPT)  128 bytes
AT91C_UDPHS_EPT_SIZE_256  EQU (0x5) ;- (UDPHS_EPT)  256 bytes (if possible)
AT91C_UDPHS_EPT_SIZE_512  EQU (0x6) ;- (UDPHS_EPT)  512 bytes (if possible)
AT91C_UDPHS_EPT_SIZE_1024 EQU (0x7) ;- (UDPHS_EPT) 1024 bytes (if possible)
AT91C_UDPHS_EPT_DIR       EQU (0x1 <<  3) ;- (UDPHS_EPT) Endpoint Direction 0:OUT, 1:IN
AT91C_UDPHS_EPT_DIR_OUT   EQU (0x0 <<  3) ;- (UDPHS_EPT) Direction OUT
AT91C_UDPHS_EPT_DIR_IN    EQU (0x1 <<  3) ;- (UDPHS_EPT) Direction IN
AT91C_UDPHS_EPT_TYPE      EQU (0x3 <<  4) ;- (UDPHS_EPT) Endpoint Type
AT91C_UDPHS_EPT_TYPE_CTL_EPT EQU (0x0 <<  4) ;- (UDPHS_EPT) Control endpoint
AT91C_UDPHS_EPT_TYPE_ISO_EPT EQU (0x1 <<  4) ;- (UDPHS_EPT) Isochronous endpoint
AT91C_UDPHS_EPT_TYPE_BUL_EPT EQU (0x2 <<  4) ;- (UDPHS_EPT) Bulk endpoint
AT91C_UDPHS_EPT_TYPE_INT_EPT EQU (0x3 <<  4) ;- (UDPHS_EPT) Interrupt endpoint
AT91C_UDPHS_BK_NUMBER     EQU (0x3 <<  6) ;- (UDPHS_EPT) Number of Banks
AT91C_UDPHS_BK_NUMBER_0   EQU (0x0 <<  6) ;- (UDPHS_EPT) Zero Bank, the EndPoint is not mapped in memory
AT91C_UDPHS_BK_NUMBER_1   EQU (0x1 <<  6) ;- (UDPHS_EPT) One Bank (Bank0)
AT91C_UDPHS_BK_NUMBER_2   EQU (0x2 <<  6) ;- (UDPHS_EPT) Double bank (Ping-Pong : Bank0 / Bank1)
AT91C_UDPHS_BK_NUMBER_3   EQU (0x3 <<  6) ;- (UDPHS_EPT) Triple Bank (Bank0 / Bank1 / Bank2) (if possible)
AT91C_UDPHS_NB_TRANS      EQU (0x3 <<  8) ;- (UDPHS_EPT) Number Of Transaction per Micro-Frame (High-Bandwidth iso only)
AT91C_UDPHS_EPT_MAPD      EQU (0x1 << 31) ;- (UDPHS_EPT) Endpoint Mapped (read only
/* - -------- UDPHS_EPTCTLENB : (UDPHS_EPT Offset: 0x4) UDPHS Endpoint Control Enable Register -------- */
AT91C_UDPHS_EPT_ENABL     EQU (0x1 <<  0) ;- (UDPHS_EPT) Endpoint Enable
AT91C_UDPHS_AUTO_VALID    EQU (0x1 <<  1) ;- (UDPHS_EPT) Packet Auto-Valid Enable/Disable
AT91C_UDPHS_INTDIS_DMA    EQU (0x1 <<  3) ;- (UDPHS_EPT) Endpoint Interrupts DMA Request Enable/Disable
AT91C_UDPHS_NYET_DIS      EQU (0x1 <<  4) ;- (UDPHS_EPT) NYET Enable/Disable
AT91C_UDPHS_DATAX_RX      EQU (0x1 <<  6) ;- (UDPHS_EPT) DATAx Interrupt Enable/Disable
AT91C_UDPHS_MDATA_RX      EQU (0x1 <<  7) ;- (UDPHS_EPT) MDATA Interrupt Enabled/Disable
AT91C_UDPHS_ERR_OVFLW     EQU (0x1 <<  8) ;- (UDPHS_EPT) OverFlow Error Interrupt Enable/Disable/Status
AT91C_UDPHS_RX_BK_RDY     EQU (0x1 <<  9) ;- (UDPHS_EPT) Received OUT Data
AT91C_UDPHS_TX_COMPLT     EQU (0x1 << 10) ;- (UDPHS_EPT) Transmitted IN Data Complete Interrupt Enable/Disable or Transmitted IN Data Complete (clear)
AT91C_UDPHS_ERR_TRANS     EQU (0x1 << 11) ;- (UDPHS_EPT) Transaction Error Interrupt Enable/Disable
AT91C_UDPHS_TX_PK_RDY     EQU (0x1 << 11) ;- (UDPHS_EPT) TX Packet Ready Interrupt Enable/Disable
AT91C_UDPHS_RX_SETUP      EQU (0x1 << 12) ;- (UDPHS_EPT) Received SETUP Interrupt Enable/Disable
AT91C_UDPHS_ERR_FL_ISO    EQU (0x1 << 12) ;- (UDPHS_EPT) Error Flow Clear/Interrupt Enable/Disable
AT91C_UDPHS_STALL_SNT     EQU (0x1 << 13) ;- (UDPHS_EPT) Stall Sent Clear
AT91C_UDPHS_ERR_CRISO     EQU (0x1 << 13) ;- (UDPHS_EPT) CRC error / Error NB Trans / Interrupt Enable/Disable
AT91C_UDPHS_NAK_IN        EQU (0x1 << 14) ;- (UDPHS_EPT) NAKIN ERROR FLUSH / Clear / Interrupt Enable/Disable
AT91C_UDPHS_NAK_OUT       EQU (0x1 << 15) ;- (UDPHS_EPT) NAKOUT / Clear / Interrupt Enable/Disable
AT91C_UDPHS_BUSY_BANK     EQU (0x1 << 18) ;- (UDPHS_EPT) Busy Bank Interrupt Enable/Disable
AT91C_UDPHS_SHRT_PCKT     EQU (0x1 << 31) ;- (UDPHS_EPT) Short Packet / Interrupt Enable/Disable
/* - -------- UDPHS_EPTCTLDIS : (UDPHS_EPT Offset: 0x8) UDPHS Endpoint Control Disable Register -------- */
AT91C_UDPHS_EPT_DISABL    EQU (0x1 <<  0) ;- (UDPHS_EPT) Endpoint Disable
/* - -------- UDPHS_EPTCTL : (UDPHS_EPT Offset: 0xc) UDPHS Endpoint Control Register -------- */
/* - -------- UDPHS_EPTSETSTA : (UDPHS_EPT Offset: 0x14) UDPHS Endpoint Set Status Register -------- */
AT91C_UDPHS_FRCESTALL     EQU (0x1 <<  5) ;- (UDPHS_EPT) Stall Handshake Request Set/Clear/Status
AT91C_UDPHS_KILL_BANK     EQU (0x1 <<  9) ;- (UDPHS_EPT) KILL Bank
/* - -------- UDPHS_EPTCLRSTA : (UDPHS_EPT Offset: 0x18) UDPHS Endpoint Clear Status Register -------- */
AT91C_UDPHS_TOGGLESQ      EQU (0x1 <<  6) ;- (UDPHS_EPT) Data Toggle Clear
/* - -------- UDPHS_EPTSTA : (UDPHS_EPT Offset: 0x1c) UDPHS Endpoint Status Register -------- */
AT91C_UDPHS_TOGGLESQ_STA  EQU (0x3 <<  6) ;- (UDPHS_EPT) Toggle Sequencing
AT91C_UDPHS_TOGGLESQ_STA_00 EQU (0x0 <<  6) ;- (UDPHS_EPT) Data0
AT91C_UDPHS_TOGGLESQ_STA_01 EQU (0x1 <<  6) ;- (UDPHS_EPT) Data1
AT91C_UDPHS_TOGGLESQ_STA_10 EQU (0x2 <<  6) ;- (UDPHS_EPT) Data2 (only for High-Bandwidth Isochronous EndPoint)
AT91C_UDPHS_TOGGLESQ_STA_11 EQU (0x3 <<  6) ;- (UDPHS_EPT) MData (only for High-Bandwidth Isochronous EndPoint)
AT91C_UDPHS_CONTROL_DIR   EQU (0x3 << 16) ;- (UDPHS_EPT) 
AT91C_UDPHS_CONTROL_DIR_00 EQU (0x0 << 16) ;- (UDPHS_EPT) Bank 0
AT91C_UDPHS_CONTROL_DIR_01 EQU (0x1 << 16) ;- (UDPHS_EPT) Bank 1
AT91C_UDPHS_CONTROL_DIR_10 EQU (0x2 << 16) ;- (UDPHS_EPT) Bank 2
AT91C_UDPHS_CONTROL_DIR_11 EQU (0x3 << 16) ;- (UDPHS_EPT) Invalid
AT91C_UDPHS_CURRENT_BANK  EQU (0x3 << 16) ;- (UDPHS_EPT) 
AT91C_UDPHS_CURRENT_BANK_00 EQU (0x0 << 16) ;- (UDPHS_EPT) Bank 0
AT91C_UDPHS_CURRENT_BANK_01 EQU (0x1 << 16) ;- (UDPHS_EPT) Bank 1
AT91C_UDPHS_CURRENT_BANK_10 EQU (0x2 << 16) ;- (UDPHS_EPT) Bank 2
AT91C_UDPHS_CURRENT_BANK_11 EQU (0x3 << 16) ;- (UDPHS_EPT) Invalid
AT91C_UDPHS_BUSY_BANK_STA EQU (0x3 << 18) ;- (UDPHS_EPT) Busy Bank Number
AT91C_UDPHS_BUSY_BANK_STA_00 EQU (0x0 << 18) ;- (UDPHS_EPT) All banks are free
AT91C_UDPHS_BUSY_BANK_STA_01 EQU (0x1 << 18) ;- (UDPHS_EPT) 1 busy bank
AT91C_UDPHS_BUSY_BANK_STA_10 EQU (0x2 << 18) ;- (UDPHS_EPT) 2 busy banks
AT91C_UDPHS_BUSY_BANK_STA_11 EQU (0x3 << 18) ;- (UDPHS_EPT) 3 busy banks (if possible)
AT91C_UDPHS_BYTE_COUNT    EQU (0x7FF << 20) ;- (UDPHS_EPT) UDPHS Byte Count

