una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91cap9.h
/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR Synchronous Serial Controller Interface*/
/* - ******************************************************************************/
/* - -------- SSC_CR : (SSC Offset: 0x0) SSC Control Register -------- */
AT91C_SSC_RXEN            EQU (0x1 <<  0) ;- (SSC) Receive Enable
AT91C_SSC_RXDIS           EQU (0x1 <<  1) ;- (SSC) Receive Disable
AT91C_SSC_TXEN            EQU (0x1 <<  8) ;- (SSC) Transmit Enable
AT91C_SSC_TXDIS           EQU (0x1 <<  9) ;- (SSC) Transmit Disable
AT91C_SSC_SWRST           EQU (0x1 << 15) ;- (SSC) Software Reset
/* - -------- SSC_RCMR : (SSC Offset: 0x10) SSC Receive Clock Mode Register -------- */
AT91C_SSC_CKS             EQU (0x3 <<  0) ;- (SSC) Receive/Transmit Clock Selection
AT91C_SSC_CKS_DIV         EQU (0x0) ;- (SSC) Divided Clock
AT91C_SSC_CKS_TK          EQU (0x1) ;- (SSC) TK Clock signal
AT91C_SSC_CKS_RK          EQU (0x2) ;- (SSC) RK pin
AT91C_SSC_CKO             EQU (0x7 <<  2) ;- (SSC) Receive/Transmit Clock Output Mode Selection
AT91C_SSC_CKO_NONE        EQU (0x0 <<  2) ;- (SSC) Receive/Transmit Clock Output Mode: None RK pin: Input-only
AT91C_SSC_CKO_CONTINOUS   EQU (0x1 <<  2) ;- (SSC) Continuous Receive/Transmit Clock RK pin: Output
AT91C_SSC_CKO_DATA_TX     EQU (0x2 <<  2) ;- (SSC) Receive/Transmit Clock only during data transfers RK pin: Output
AT91C_SSC_CKI             EQU (0x1 <<  5) ;- (SSC) Receive/Transmit Clock Inversion
AT91C_SSC_START           EQU (0xF <<  8) ;- (SSC) Receive/Transmit Start Selection
AT91C_SSC_START_CONTINOUS EQU (0x0 <<  8) ;- (SSC) Continuous, as soon as the receiver is enabled, and immediately after the end of transfer of the previous data.
AT91C_SSC_START_TX        EQU (0x1 <<  8) ;- (SSC) Transmit/Receive start
AT91C_SSC_START_LOW_RF    EQU (0x2 <<  8) ;- (SSC) Detection of a low level on RF input
AT91C_SSC_START_HIGH_RF   EQU (0x3 <<  8) ;- (SSC) Detection of a high level on RF input
AT91C_SSC_START_FALL_RF   EQU (0x4 <<  8) ;- (SSC) Detection of a falling edge on RF input
AT91C_SSC_START_RISE_RF   EQU (0x5 <<  8) ;- (SSC) Detection of a rising edge on RF input
AT91C_SSC_START_LEVEL_RF  EQU (0x6 <<  8) ;- (SSC) Detection of any level change on RF input
AT91C_SSC_START_EDGE_RF   EQU (0x7 <<  8) ;- (SSC) Detection of any edge on RF input
AT91C_SSC_START_0         EQU (0x8 <<  8) ;- (SSC) Compare 0
AT91C_SSC_STTDLY          EQU (0xFF << 16) ;- (SSC) Receive/Transmit Start Delay
AT91C_SSC_PERIOD          EQU (0xFF << 24) ;- (SSC) Receive/Transmit Period Divider Selection
/* - -------- SSC_RFMR : (SSC Offset: 0x14) SSC Receive Frame Mode Register -------- */
AT91C_SSC_DATLEN          EQU (0x1F <<  0) ;- (SSC) Data Length
AT91C_SSC_LOOP            EQU (0x1 <<  5) ;- (SSC) Loop Mode
AT91C_SSC_MSBF            EQU (0x1 <<  7) ;- (SSC) Most Significant Bit First
AT91C_SSC_DATNB           EQU (0xF <<  8) ;- (SSC) Data Number per Frame
AT91C_SSC_FSLEN           EQU (0xF << 16) ;- (SSC) Receive/Transmit Frame Sync length
AT91C_SSC_FSOS            EQU (0x7 << 20) ;- (SSC) Receive/Transmit Frame Sync Output Selection
AT91C_SSC_FSOS_NONE       EQU (0x0 << 20) ;- (SSC) Selected Receive/Transmit Frame Sync Signal: None RK pin Input-only
AT91C_SSC_FSOS_NEGATIVE   EQU (0x1 << 20) ;- (SSC) Selected Receive/Transmit Frame Sync Signal: Negative Pulse
AT91C_SSC_FSOS_POSITIVE   EQU (0x2 << 20) ;- (SSC) Selected Receive/Transmit Frame Sync Signal: Positive Pulse
AT91C_SSC_FSOS_LOW        EQU (0x3 << 20) ;- (SSC) Selected Receive/Transmit Frame Sync Signal: Driver Low during data transfer
AT91C_SSC_FSOS_HIGH       EQU (0x4 << 20) ;- (SSC) Selected Receive/Transmit Frame Sync Signal: Driver High during data transfer
AT91C_SSC_FSOS_TOGGLE     EQU (0x5 << 20) ;- (SSC) Selected Receive/Transmit Frame Sync Signal: Toggling at each start of data transfer
AT91C_SSC_FSEDGE          EQU (0x1 << 24) ;- (SSC) Frame Sync Edge Detection
/* - -------- SSC_TCMR : (SSC Offset: 0x18) SSC Transmit Clock Mode Register -------- */
/* - -------- SSC_TFMR : (SSC Offset: 0x1c) SSC Transmit Frame Mode Register -------- */
AT91C_SSC_DATDEF          EQU (0x1 <<  5) ;- (SSC) Data Default Value
AT91C_SSC_FSDEN           EQU (0x1 << 23) ;- (SSC) Frame Sync Data Enable
/* - -------- SSC_SR : (SSC Offset: 0x40) SSC Status Register -------- */
AT91C_SSC_TXRDY           EQU (0x1 <<  0) ;- (SSC) Transmit Ready
AT91C_SSC_TXEMPTY         EQU (0x1 <<  1) ;- (SSC) Transmit Empty
AT91C_SSC_ENDTX           EQU (0x1 <<  2) ;- (SSC) End Of Transmission
AT91C_SSC_TXBUFE          EQU (0x1 <<  3) ;- (SSC) Transmit Buffer Empty
AT91C_SSC_RXRDY           EQU (0x1 <<  4) ;- (SSC) Receive Ready
AT91C_SSC_OVRUN           EQU (0x1 <<  5) ;- (SSC) Receive Overrun
AT91C_SSC_ENDRX           EQU (0x1 <<  6) ;- (SSC) End of Reception
AT91C_SSC_RXBUFF          EQU (0x1 <<  7) ;- (SSC) Receive Buffer Full
AT91C_SSC_TXSYN           EQU (0x1 << 10) ;- (SSC) Transmit Sync
AT91C_SSC_RXSYN           EQU (0x1 << 11) ;- (SSC) Receive Sync
AT91C_SSC_TXENA           EQU (0x1 << 16) ;- (SSC) Transmit Enable
AT91C_SSC_RXENA           EQU (0x1 << 17) ;- (SSC) Receive Enable
/* - -------- SSC_IER : (SSC Offset: 0x44) SSC Interrupt Enable Register -------- */
/* - -------- SSC_IDR : (SSC Offset: 0x48) SSC Interrupt Disable Register -------- */
/* - -------- SSC_IMR : (SSC Offset: 0x4c) SSC Interrupt Mask Register -------- */

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR AC97 Controller Interface*/
/* - ******************************************************************************/
/* - -------- AC97C_MR : (AC97C Offset: 0x8) AC97C Mode Register -------- */
AT91C_AC97C_ENA           EQU (0x1 <<  0) ;- (AC97C) AC97 Controller Global Enable
AT91C_AC97C_WRST          EQU (0x1 <<  1) ;- (AC97C) Warm Reset
AT91C_AC97C_VRA           EQU (0x1 <<  2) ;- (AC97C) Variable RAte (for Data Slots)
/* - -------- AC97C_ICA : (AC97C Offset: 0x10) AC97C Input Channel Assignement Register -------- */
AT91C_AC97C_CHID3         EQU (0x7 <<  0) ;- (AC97C) Channel Id for the input slot 3
AT91C_AC97C_CHID3_NONE    EQU (0x0) ;- (AC97C) No data will be transmitted during this slot
AT91C_AC97C_CHID3_CA      EQU (0x1) ;- (AC97C) Channel A data will be transmitted during this slot
AT91C_AC97C_CHID3_CB      EQU (0x2) ;- (AC97C) Channel B data will be transmitted during this slot
AT91C_AC97C_CHID3_CC      EQU (0x3) ;- (AC97C) Channel C data will be transmitted during this slot
AT91C_AC97C_CHID4         EQU (0x7 <<  3) ;- (AC97C) Channel Id for the input slot 4
AT91C_AC97C_CHID4_NONE    EQU (0x0 <<  3) ;- (AC97C) No data will be transmitted during this slot
AT91C_AC97C_CHID4_CA      EQU (0x1 <<  3) ;- (AC97C) Channel A data will be transmitted during this slot
AT91C_AC97C_CHID4_CB      EQU (0x2 <<  3) ;- (AC97C) Channel B data will be transmitted during this slot
AT91C_AC97C_CHID4_CC      EQU (0x3 <<  3) ;- (AC97C) Channel C data will be transmitted during this slot
AT91C_AC97C_CHID5         EQU (0x7 <<  6) ;- (AC97C) Channel Id for the input slot 5
AT91C_AC97C_CHID5_NONE    EQU (0x0 <<  6) ;- (AC97C) No data will be transmitted during this slot
AT91C_AC97C_CHID5_CA      EQU (0x1 <<  6) ;- (AC97C) Channel A data will be transmitted during this slot
AT91C_AC97C_CHID5_CB      EQU (0x2 <<  6) ;- (AC97C) Channel B data will be transmitted during this slot
AT91C_AC97C_CHID5_CC      EQU (0x3 <<  6) ;- (AC97C) Channel C data will be transmitted during this slot
AT91C_AC97C_CHID6         EQU (0x7 <<  9) ;- (AC97C) Channel Id for the input slot 6
AT91C_AC97C_CHID6_NONE    EQU (0x0 <<  9) ;- (AC97C) No data will be transmitted during this slot
AT91C_AC97C_CHID6_CA      EQU (0x1 <<  9) ;- (AC97C) Channel A data will be transmitted during this slot
AT91C_AC97C_CHID6_CB      EQU (0x2 <<  9) ;- (AC97C) Channel B data will be transmitted during this slot
AT91C_AC97C_CHID6_CC      EQU (0x3 <<  9) ;- (AC97C) Channel C data will be transmitted during this slot
AT91C_AC97C_CHID7         EQU (0x7 << 12) ;- (AC97C) Channel Id for the input slot 7
AT91C_AC97C_CHID7_NONE    EQU (0x0 << 12) ;- (AC97C) No data will be transmitted during this slot
AT91C_AC97C_CHID7_CA      EQU (0x1 << 12) ;- (AC97C) Channel A data will be transmitted during this slot
AT91C_AC97C_CHID7_CB      EQU (0x2 << 12) ;- (AC97C) Channel B data will be transmitted during this slot
AT91C_AC97C_CHID7_CC      EQU (0x3 << 12) ;- (AC97C) Channel C data will be transmitted during this slot
AT91C_AC97C_CHID8         EQU (0x7 << 15) ;- (AC97C) Channel Id for the input slot 8
AT91C_AC97C_CHID8_NONE    EQU (0x0 << 15) ;- (AC97C) No data will be transmitted during this slot
AT91C_AC97C_CHID8_CA      EQU (0x1 << 15) ;- (AC97C) Channel A data will be transmitted during this slot
AT91C_AC97C_CHID8_CB      EQU (0x2 << 15) ;- (AC97C) Channel B data will be transmitted during this slot
AT91C_AC97C_CHID8_CC      EQU (0x3 << 15) ;- (AC97C) Channel C data will be transmitted during this slot
AT91C_AC97C_CHID9         EQU (0x7 << 18) ;- (AC97C) Channel Id for the input slot 9
AT91C_AC97C_CHID9_NONE    EQU (0x0 << 18) ;- (AC97C) No data will be transmitted during this slot
AT91C_AC97C_CHID9_CA      EQU (0x1 << 18) ;- (AC97C) Channel A data will be transmitted during this slot
AT91C_AC97C_CHID9_CB      EQU (0x2 << 18) ;- (AC97C) Channel B data will be transmitted during this slot
AT91C_AC97C_CHID9_CC      EQU (0x3 << 18) ;- (AC97C) Channel C data will be transmitted during this slot
AT91C_AC97C_CHID10        EQU (0x7 << 21) ;- (AC97C) Channel Id for the input slot 10
AT91C_AC97C_CHID10_NONE   EQU (0x0 << 21) ;- (AC97C) No data will be transmitted during this slot
AT91C_AC97C_CHID10_CA     EQU (0x1 << 21) ;- (AC97C) Channel A data will be transmitted during this slot
AT91C_AC97C_CHID10_CB     EQU (0x2 << 21) ;- (AC97C) Channel B data will be transmitted during this slot
AT91C_AC97C_CHID10_CC     EQU (0x3 << 21) ;- (AC97C) Channel C data will be transmitted during this slot
AT91C_AC97C_CHID11        EQU (0x7 << 24) ;- (AC97C) Channel Id for the input slot 11
AT91C_AC97C_CHID11_NONE   EQU (0x0 << 24) ;- (AC97C) No data will be transmitted during this slot
AT91C_AC97C_CHID11_CA     EQU (0x1 << 24) ;- (AC97C) Channel A data will be transmitted during this slot
AT91C_AC97C_CHID11_CB     EQU (0x2 << 24) ;- (AC97C) Channel B data will be transmitted during this slot
AT91C_AC97C_CHID11_CC     EQU (0x3 << 24) ;- (AC97C) Channel C data will be transmitted during this slot
AT91C_AC97C_CHID12        EQU (0x7 << 27) ;- (AC97C) Channel Id for the input slot 12
AT91C_AC97C_CHID12_NONE   EQU (0x0 << 27) ;- (AC97C) No data will be transmitted during this slot
AT91C_AC97C_CHID12_CA     EQU (0x1 << 27) ;- (AC97C) Channel A data will be transmitted during this slot
AT91C_AC97C_CHID12_CB     EQU (0x2 << 27) ;- (AC97C) Channel B data will be transmitted during this slot
AT91C_AC97C_CHID12_CC     EQU (0x3 << 27) ;- (AC97C) Channel C data will be transmitted during this slot
/* - -------- AC97C_OCA : (AC97C Offset: 0x14) AC97C Output Channel Assignement Register -------- */
/* - -------- AC97C_CARHR : (AC97C Offset: 0x20) AC97C Channel A Receive Holding Register -------- */
AT91C_AC97C_RDATA         EQU (0xFFFFF <<  0) ;- (AC97C) Receive data
/* - -------- AC97C_CATHR : (AC97C Offset: 0x24) AC97C Channel A Transmit Holding Register -------- */
AT91C_AC97C_TDATA         EQU (0xFFFFF <<  0) ;- (AC97C) Transmit data
/* - -------- AC97C_CASR : (AC97C Offset: 0x28) AC97C Channel A Status Register -------- */
AT91C_AC97C_TXRDY         EQU (0x1 <<  0) ;- (AC97C) 
AT91C_AC97C_TXEMPTY       EQU (0x1 <<  1) ;- (AC97C) 
AT91C_AC97C_UNRUN         EQU (0x1 <<  2) ;- (AC97C) 
AT91C_AC97C_RXRDY         EQU (0x1 <<  4) ;- (AC97C) 
AT91C_AC97C_OVRUN         EQU (0x1 <<  5) ;- (AC97C) 
AT91C_AC97C_ENDTX         EQU (0x1 << 10) ;- (AC97C) 
AT91C_AC97C_TXBUFE        EQU (0x1 << 11) ;- (AC97C) 
AT91C_AC97C_ENDRX         EQU (0x1 << 14) ;- (AC97C) 
AT91C_AC97C_RXBUFF        EQU (0x1 << 15) ;- (AC97C) 
/* - -------- AC97C_CAMR : (AC97C Offset: 0x2c) AC97C Channel A Mode Register -------- */
AT91C_AC97C_SIZE          EQU (0x3 << 16) ;- (AC97C) 
AT91C_AC97C_SIZE_20_BITS  EQU (0x0 << 16) ;- (AC97C) Data size is 20 bits
AT91C_AC97C_SIZE_18_BITS  EQU (0x1 << 16) ;- (AC97C) Data size is 18 bits
AT91C_AC97C_SIZE_16_BITS  EQU (0x2 << 16) ;- (AC97C) Data size is 16 bits
AT91C_AC97C_SIZE_10_BITS  EQU (0x3 << 16) ;- (AC97C) Data size is 10 bits
AT91C_AC97C_CEM           EQU (0x1 << 18) ;- (AC97C) 
AT91C_AC97C_CEN           EQU (0x1 << 21) ;- (AC97C) 
AT91C_AC97C_PDCEN         EQU (0x1 << 22) ;- (AC97C) 
/* - -------- AC97C_CBRHR : (AC97C Offset: 0x30) AC97C Channel B Receive Holding Register -------- */
/* - -------- AC97C_CBTHR : (AC97C Offset: 0x34) AC97C Channel B Transmit Holding Register -------- */
/* - -------- AC97C_CBSR : (AC97C Offset: 0x38) AC97C Channel B Status Register -------- */
/* - -------- AC97C_CBMR : (AC97C Offset: 0x3c) AC97C Channel B Mode Register -------- */
/* - -------- AC97C_CORHR : (AC97C Offset: 0x40) AC97C Codec Channel Receive Holding Register -------- */
AT91C_AC97C_SDATA         EQU (0xFFFF <<  0) ;- (AC97C) Status Data
/* - -------- AC97C_COTHR : (AC97C Offset: 0x44) AC97C Codec Channel Transmit Holding Register -------- */
AT91C_AC97C_CDATA         EQU (0xFFFF <<  0) ;- (AC97C) Command Data
AT91C_AC97C_CADDR         EQU (0x7F << 16) ;- (AC97C) COdec control register index
AT91C_AC97C_READ          EQU (0x1 << 23) ;- (AC97C) Read/Write command
/* - -------- AC97C_COSR : (AC97C Offset: 0x48) AC97C CODEC Status Register -------- */
/* - -------- AC97C_COMR : (AC97C Offset: 0x4c) AC97C CODEC Mode Register -------- */
/* - -------- AC97C_SR : (AC97C Offset: 0x50) AC97C Status Register -------- */
AT91C_AC97C_SOF           EQU (0x1 <<  0) ;- (AC97C) 
AT91C_AC97C_WKUP          EQU (0x1 <<  1) ;- (AC97C) 
AT91C_AC97C_COEVT         EQU (0x1 <<  2) ;- (AC97C) 
AT91C_AC97C_CAEVT         EQU (0x1 <<  3) ;- (AC97C) 
AT91C_AC97C_CBEVT         EQU (0x1 <<  4) ;- (AC97C) 
/* - -------- AC97C_IER : (AC97C Offset: 0x54) AC97C Interrupt Enable Register -------- */
/* - -------- AC97C_IDR : (AC97C Offset: 0x58) AC97C Interrupt Disable Register -------- */
/* - -------- AC97C_IMR : (AC97C Offset: 0x5c) AC97C Interrupt Mask Register -------- */

