una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91cap9.h
/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR HDMA Channel structure*/
/* - ******************************************************************************/
/* - -------- HDMA_SADDR : (HDMA_CH Offset: 0x0)  -------- */
AT91C_SADDR               EQU (0x0 <<  0) ;- (HDMA_CH) 
/* - -------- HDMA_DADDR : (HDMA_CH Offset: 0x4)  -------- */
AT91C_DADDR               EQU (0x0 <<  0) ;- (HDMA_CH) 
/* - -------- HDMA_DSCR : (HDMA_CH Offset: 0x8)  -------- */
AT91C_DSCR_IF             EQU (0x3 <<  0) ;- (HDMA_CH) 
AT91C_DSCR                EQU (0x3FFFFFFF <<  2) ;- (HDMA_CH) 
/* - -------- HDMA_CTRLA : (HDMA_CH Offset: 0xc)  -------- */
AT91C_BTSIZE              EQU (0xFFF <<  0) ;- (HDMA_CH) 
AT91C_FC                  EQU (0x7 << 12) ;- (HDMA_CH) 
AT91C_AUTO                EQU (0x1 << 15) ;- (HDMA_CH) 
AT91C_SCSIZE              EQU (0x7 << 16) ;- (HDMA_CH) 
AT91C_DCSIZE              EQU (0x7 << 20) ;- (HDMA_CH) 
AT91C_SRC_WIDTH           EQU (0x3 << 24) ;- (HDMA_CH) 
AT91C_DST_WIDTH           EQU (0x3 << 28) ;- (HDMA_CH) 
/* - -------- HDMA_CTRLB : (HDMA_CH Offset: 0x10)  -------- */
AT91C_SIF                 EQU (0x3 <<  0) ;- (HDMA_CH) 
AT91C_DIF                 EQU (0x3 <<  4) ;- (HDMA_CH) 
AT91C_SRC_PIP             EQU (0x1 <<  8) ;- (HDMA_CH) 
AT91C_DST_PIP             EQU (0x1 << 12) ;- (HDMA_CH) 
AT91C_SRC_DSCR            EQU (0x1 << 16) ;- (HDMA_CH) 
AT91C_DST_DSCR            EQU (0x1 << 20) ;- (HDMA_CH) 
AT91C_SRC_INCR            EQU (0x3 << 24) ;- (HDMA_CH) 
AT91C_DST_INCR            EQU (0x3 << 28) ;- (HDMA_CH) 
/* - -------- HDMA_CFG : (HDMA_CH Offset: 0x14)  -------- */
AT91C_SRC_PER             EQU (0xF <<  0) ;- (HDMA_CH) 
AT91C_DST_PER             EQU (0xF <<  4) ;- (HDMA_CH) 
AT91C_SRC_REP             EQU (0x1 <<  8) ;- (HDMA_CH) 
AT91C_SRC_H2SEL           EQU (0x1 <<  9) ;- (HDMA_CH) 
AT91C_DST_REP             EQU (0x1 << 12) ;- (HDMA_CH) 
AT91C_DST_H2SEL           EQU (0x1 << 13) ;- (HDMA_CH) 
AT91C_LOCK_IF             EQU (0x1 << 20) ;- (HDMA_CH) 
AT91C_LOCK_B              EQU (0x1 << 21) ;- (HDMA_CH) 
AT91C_LOCK_IF_L           EQU (0x1 << 22) ;- (HDMA_CH) 
AT91C_AHB_PROT            EQU (0x7 << 24) ;- (HDMA_CH) 
/* - -------- HDMA_SPIP : (HDMA_CH Offset: 0x18)  -------- */
AT91C_SPIP_HOLE           EQU (0xFFFF <<  0) ;- (HDMA_CH) 
AT91C_SPIP_BOUNDARY       EQU (0x3FF << 16) ;- (HDMA_CH) 
/* - -------- HDMA_DPIP : (HDMA_CH Offset: 0x1c)  -------- */
AT91C_DPIP_HOLE           EQU (0xFFFF <<  0) ;- (HDMA_CH) 
AT91C_DPIP_BOUNDARY       EQU (0x3FF << 16) ;- (HDMA_CH) 

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR HDMA controller*/
/* - ******************************************************************************/
/* - -------- HDMA_GCFG : (HDMA Offset: 0x0)  -------- */
AT91C_IF0_BIGEND          EQU (0x1 <<  0) ;- (HDMA) 
AT91C_IF1_BIGEND          EQU (0x1 <<  1) ;- (HDMA) 
AT91C_IF2_BIGEND          EQU (0x1 <<  2) ;- (HDMA) 
AT91C_IF3_BIGEND          EQU (0x1 <<  3) ;- (HDMA) 
AT91C_ARB_CFG             EQU (0x1 <<  4) ;- (HDMA) 
/* - -------- HDMA_EN : (HDMA Offset: 0x4)  -------- */
AT91C_HDMA_ENABLE         EQU (0x1 <<  0) ;- (HDMA) 
/* - -------- HDMA_SREQ : (HDMA Offset: 0x8)  -------- */
AT91C_SOFT_SREQ           EQU (0xFFFF <<  0) ;- (HDMA) 
/* - -------- HDMA_BREQ : (HDMA Offset: 0xc)  -------- */
AT91C_SOFT_BREQ           EQU (0xFFFF <<  0) ;- (HDMA) 
/* - -------- HDMA_LAST : (HDMA Offset: 0x10)  -------- */
AT91C_SOFT_LAST           EQU (0xFFFF <<  0) ;- (HDMA) 
/* - -------- HDMA_SYNC : (HDMA Offset: 0x14)  -------- */
AT91C_SYNC_REQ            EQU (0xFFFF <<  0) ;- (HDMA) 
/* - -------- HDMA_EBCIER : (HDMA Offset: 0x18)  -------- */
AT91C_BTC                 EQU (0xFF <<  0) ;- (HDMA) 
AT91C_CBTC                EQU (0xFF <<  8) ;- (HDMA) 
AT91C_ERR                 EQU (0xFF << 16) ;- (HDMA) 
/* - -------- HDMA_EBCIDR : (HDMA Offset: 0x1c)  -------- */
/* - -------- HDMA_EBCIMR : (HDMA Offset: 0x20)  -------- */
/* - -------- HDMA_EBCISR : (HDMA Offset: 0x24)  -------- */
/* - -------- HDMA_CHER : (HDMA Offset: 0x28)  -------- */
AT91C_ENABLE              EQU (0xFF <<  0) ;- (HDMA) 
AT91C_SUSPEND             EQU (0xFF <<  8) ;- (HDMA) 
AT91C_KEEPON              EQU (0xFF << 24) ;- (HDMA) 
/* - -------- HDMA_CHDR : (HDMA Offset: 0x2c)  -------- */
AT91C_RESUME              EQU (0xFF <<  8) ;- (HDMA) 
/* - -------- HDMA_CHSR : (HDMA Offset: 0x30)  -------- */
AT91C_STALLED             EQU (0xFF << 14) ;- (HDMA) 
AT91C_EMPTY               EQU (0xFF << 16) ;- (HDMA) 

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR System Peripherals*/
/* - ******************************************************************************/
/* - -------- SLCKSEL : (SYS Offset: 0x1b50) Slow Clock Selection Register -------- */
AT91C_SLCKSEL_RCEN        EQU (0x1 <<  0) ;- (SYS) Enable Internal RC Oscillator
AT91C_SLCKSEL_OSC32EN     EQU (0x1 <<  1) ;- (SYS) Enable External Oscillator
AT91C_SLCKSEL_OSC32BYP    EQU (0x1 <<  2) ;- (SYS) Bypass External Oscillator
AT91C_SLCKSEL_OSCSEL      EQU (0x1 <<  3) ;- (SYS) OSC Selection
/* - -------- GPBR : (SYS Offset: 0x1b60) GPBR General Purpose Register -------- */
AT91C_GPBR_GPRV           EQU (0x0 <<  0) ;- (SYS) General Purpose Register Value

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR USB Host Interface*/
/* - ******************************************************************************/

/* - ******************************************************************************/
/* -               REGISTER ADDRESS DEFINITION FOR AT91CAP9_UMC*/
/* - ******************************************************************************/
/* - ========== Register definition for HECC peripheral ========== */
AT91C_HECC_VR             EQU (0xFFFFE2FC) ;- (HECC)  ECC Version register
AT91C_HECC_SR             EQU (0xFFFFE208) ;- (HECC)  ECC Status register
AT91C_HECC_CR             EQU (0xFFFFE200) ;- (HECC)  ECC reset register
AT91C_HECC_NPR            EQU (0xFFFFE210) ;- (HECC)  ECC Parity N register
AT91C_HECC_PR             EQU (0xFFFFE20C) ;- (HECC)  ECC Parity register
AT91C_HECC_MR             EQU (0xFFFFE204) ;- (HECC)  ECC Page size register
/* - ========== Register definition for BCRAMC peripheral ========== */
AT91C_BCRAMC_IPNR1        EQU (0xFFFFE4F0) ;- (BCRAMC) BCRAM IP Name Register 1
AT91C_BCRAMC_HSR          EQU (0xFFFFE408) ;- (BCRAMC) BCRAM Controller High Speed Register
AT91C_BCRAMC_CR           EQU (0xFFFFE400) ;- (BCRAMC) BCRAM Controller Configuration Register
AT91C_BCRAMC_TPR          EQU (0xFFFFE404) ;- (BCRAMC) BCRAM Controller Timing Parameter Register
AT91C_BCRAMC_LPR          EQU (0xFFFFE40C) ;- (BCRAMC) BCRAM Controller Low Power Register
AT91C_BCRAMC_IPNR2        EQU (0xFFFFE4F4) ;- (BCRAMC) BCRAM IP Name Register 2
AT91C_BCRAMC_IPFR         EQU (0xFFFFE4F8) ;- (BCRAMC) BCRAM IP Features Register
AT91C_BCRAMC_VR           EQU (0xFFFFE4FC) ;- (BCRAMC) BCRAM Version Register
AT91C_BCRAMC_MDR          EQU (0xFFFFE410) ;- (BCRAMC) BCRAM Memory Device Register
AT91C_BCRAMC_PADDSR       EQU (0xFFFFE4EC) ;- (BCRAMC) BCRAM PADDR Size Register
/* - ========== Register definition for SDDRC peripheral ========== */
AT91C_SDDRC_RTR           EQU (0xFFFFE604) ;- (SDDRC) 
AT91C_SDDRC_T0PR          EQU (0xFFFFE60C) ;- (SDDRC) 
AT91C_SDDRC_MDR           EQU (0xFFFFE61C) ;- (SDDRC) 
AT91C_SDDRC_HS            EQU (0xFFFFE614) ;- (SDDRC) 
AT91C_SDDRC_VERSION       EQU (0xFFFFE6FC) ;- (SDDRC) 
AT91C_SDDRC_MR            EQU (0xFFFFE600) ;- (SDDRC) 
AT91C_SDDRC_T1PR          EQU (0xFFFFE610) ;- (SDDRC) 
AT91C_SDDRC_CR            EQU (0xFFFFE608) ;- (SDDRC) 
AT91C_SDDRC_LPR           EQU (0xFFFFE618) ;- (SDDRC) 
/* - ========== Register definition for SMC peripheral ========== */
AT91C_SMC_PULSE7          EQU (0xFFFFE874) ;- (SMC)  Pulse Register for CS 7
AT91C_SMC_DELAY1          EQU (0xFFFFE8C0) ;- (SMC) SMC Delay Control Register
AT91C_SMC_CYCLE2          EQU (0xFFFFE828) ;- (SMC)  Cycle Register for CS 2
AT91C_SMC_DELAY5          EQU (0xFFFFE8D0) ;- (SMC) SMC Delay Control Register
AT91C_SMC_DELAY6          EQU (0xFFFFE8D4) ;- (SMC) SMC Delay Control Register
AT91C_SMC_PULSE2          EQU (0xFFFFE824) ;- (SMC)  Pulse Register for CS 2
AT91C_SMC_SETUP6          EQU (0xFFFFE860) ;- (SMC)  Setup Register for CS 6
AT91C_SMC_SETUP5          EQU (0xFFFFE850) ;- (SMC)  Setup Register for CS 5
AT91C_SMC_CYCLE6          EQU (0xFFFFE868) ;- (SMC)  Cycle Register for CS 6
AT91C_SMC_PULSE6          EQU (0xFFFFE864) ;- (SMC)  Pulse Register for CS 6
AT91C_SMC_CTRL5           EQU (0xFFFFE85C) ;- (SMC)  Control Register for CS 5
AT91C_SMC_CTRL3           EQU (0xFFFFE83C) ;- (SMC)  Control Register for CS 3
AT91C_SMC_DELAY7          EQU (0xFFFFE8D8) ;- (SMC) SMC Delay Control Register
AT91C_SMC_DELAY3          EQU (0xFFFFE8C8) ;- (SMC) SMC Delay Control Register
AT91C_SMC_CYCLE0          EQU (0xFFFFE808) ;- (SMC)  Cycle Register for CS 0
AT91C_SMC_SETUP1          EQU (0xFFFFE810) ;- (SMC)  Setup Register for CS 1
AT91C_SMC_PULSE5          EQU (0xFFFFE854) ;- (SMC)  Pulse Register for CS 5
AT91C_SMC_SETUP7          EQU (0xFFFFE870) ;- (SMC)  Setup Register for CS 7
AT91C_SMC_CTRL4           EQU (0xFFFFE84C) ;- (SMC)  Control Register for CS 4
AT91C_SMC_DELAY2          EQU (0xFFFFE8C4) ;- (SMC) SMC Delay Control Register
AT91C_SMC_PULSE3          EQU (0xFFFFE834) ;- (SMC)  Pulse Register for CS 3
AT91C_SMC_CYCLE4          EQU (0xFFFFE848) ;- (SMC)  Cycle Register for CS 4
AT91C_SMC_CTRL1           EQU (0xFFFFE81C) ;- (SMC)  Control Register for CS 1
AT91C_SMC_SETUP3          EQU (0xFFFFE830) ;- (SMC)  Setup Register for CS 3
AT91C_SMC_CTRL0           EQU (0xFFFFE80C) ;- (SMC)  Control Register for CS 0
AT91C_SMC_CYCLE7          EQU (0xFFFFE878) ;- (SMC)  Cycle Register for CS 7
AT91C_SMC_DELAY4          EQU (0xFFFFE8CC) ;- (SMC) SMC Delay Control Register
AT91C_SMC_CYCLE1          EQU (0xFFFFE818) ;- (SMC)  Cycle Register for CS 1
AT91C_SMC_SETUP2          EQU (0xFFFFE820) ;- (SMC)  Setup Register for CS 2
AT91C_SMC_PULSE1          EQU (0xFFFFE814) ;- (SMC)  Pulse Register for CS 1
AT91C_SMC_DELAY8          EQU (0xFFFFE8DC) ;- (SMC) SMC Delay Control Register
AT91C_SMC_CTRL2           EQU (0xFFFFE82C) ;- (SMC)  Control Register for CS 2
AT91C_SMC_PULSE4          EQU (0xFFFFE844) ;- (SMC)  Pulse Register for CS 4
AT91C_SMC_SETUP4          EQU (0xFFFFE840) ;- (SMC)  Setup Register for CS 4
AT91C_SMC_CYCLE3          EQU (0xFFFFE838) ;- (SMC)  Cycle Register for CS 3
AT91C_SMC_SETUP0          EQU (0xFFFFE800) ;- (SMC)  Setup Register for CS 0
AT91C_SMC_CYCLE5          EQU (0xFFFFE858) ;- (SMC)  Cycle Register for CS 5
AT91C_SMC_PULSE0          EQU (0xFFFFE804) ;- (SMC)  Pulse Register for CS 0
AT91C_SMC_CTRL6           EQU (0xFFFFE86C) ;- (SMC)  Control Register for CS 6
AT91C_SMC_CTRL7           EQU (0xFFFFE87C) ;- (SMC)  Control Register for CS 7
/* - ========== Register definition for MATRIX_PRS peripheral ========== */
AT91C_MATRIX_PRS_PRAS     EQU (0xFFFFEA80) ;- (MATRIX_PRS)  Slave Priority Registers A for Slave
AT91C_MATRIX_PRS_PRBS     EQU (0xFFFFEA84) ;- (MATRIX_PRS)  Slave Priority Registers B for Slave
/* - ========== Register definition for MATRIX peripheral ========== */
AT91C_MATRIX_MCFG         EQU (0xFFFFEA00) ;- (MATRIX)  Master Configuration Register 
AT91C_MATRIX_MRCR         EQU (0xFFFFEB00) ;- (MATRIX)  Master Remp Control Register 
AT91C_MATRIX_SCFG         EQU (0xFFFFEA40) ;- (MATRIX)  Slave Configuration Register 
/* - ========== Register definition for CCFG peripheral ========== */
AT91C_CCFG_RAM            EQU (0xFFFFEB10) ;- (CCFG)  Slave 0 (Ram) Special Function Register
AT91C_CCFG_MPBS1          EQU (0xFFFFEB1C) ;- (CCFG)  Slave 3 (MP Block Slave 1) Special Function Register
AT91C_CCFG_BRIDGE         EQU (0xFFFFEB34) ;- (CCFG)  Slave 8 (APB Bridge) Special Function Register
AT91C_CCFG_HDDRC2         EQU (0xFFFFEB24) ;- (CCFG)  Slave 5 (DDRC Port 2) Special Function Register
AT91C_CCFG_MPBS3          EQU (0xFFFFEB30) ;- (CCFG)  Slave 7 (MP Block Slave 3) Special Function Register
AT91C_CCFG_MPBS2          EQU (0xFFFFEB2C) ;- (CCFG)  Slave 7 (MP Block Slave 2) Special Function Register
AT91C_CCFG_UDPHS          EQU (0xFFFFEB18) ;- (CCFG)  Slave 2 (AHB Periphs) Special Function Register
AT91C_CCFG_HDDRC3         EQU (0xFFFFEB28) ;- (CCFG)  Slave 6 (DDRC Port 3) Special Function Register
AT91C_CCFG_EBICSA         EQU (0xFFFFEB20) ;- (CCFG)  EBI Chip Select Assignement Register
AT91C_CCFG_MATRIXVERSION  EQU (0xFFFFEBFC) ;- (CCFG)  Version Register
AT91C_CCFG_MPBS0          EQU (0xFFFFEB14) ;- (CCFG)  Slave 1 (MP Block Slave 0) Special Function Register
/* - ========== Register definition for PDC_DBGU peripheral ========== */
AT91C_DBGU_PTCR           EQU (0xFFFFEF20) ;- (PDC_DBGU) PDC Transfer Control Register
AT91C_DBGU_RCR            EQU (0xFFFFEF04) ;- (PDC_DBGU) Receive Counter Register
AT91C_DBGU_TCR            EQU (0xFFFFEF0C) ;- (PDC_DBGU) Transmit Counter Register
AT91C_DBGU_RNCR           EQU (0xFFFFEF14) ;- (PDC_DBGU) Receive Next Counter Register
AT91C_DBGU_TNPR           EQU (0xFFFFEF18) ;- (PDC_DBGU) Transmit Next Pointer Register
AT91C_DBGU_RNPR           EQU (0xFFFFEF10) ;- (PDC_DBGU) Receive Next Pointer Register
AT91C_DBGU_PTSR           EQU (0xFFFFEF24) ;- (PDC_DBGU) PDC Transfer Status Register
AT91C_DBGU_RPR            EQU (0xFFFFEF00) ;- (PDC_DBGU) Receive Pointer Register
AT91C_DBGU_TPR            EQU (0xFFFFEF08) ;- (PDC_DBGU) Transmit Pointer Register
AT91C_DBGU_TNCR           EQU (0xFFFFEF1C) ;- (PDC_DBGU) Transmit Next Counter Register
/* - ========== Register definition for DBGU peripheral ========== */
AT91C_DBGU_BRGR           EQU (0xFFFFEE20) ;- (DBGU) Baud Rate Generator Register
AT91C_DBGU_CR             EQU (0xFFFFEE00) ;- (DBGU) Control Register
AT91C_DBGU_THR            EQU (0xFFFFEE1C) ;- (DBGU) Transmitter Holding Register
AT91C_DBGU_IDR            EQU (0xFFFFEE0C) ;- (DBGU) Interrupt Disable Register
AT91C_DBGU_EXID           EQU (0xFFFFEE44) ;- (DBGU) Chip ID Extension Register
AT91C_DBGU_IMR            EQU (0xFFFFEE10) ;- (DBGU) Interrupt Mask Register
AT91C_DBGU_FNTR           EQU (0xFFFFEE48) ;- (DBGU) Force NTRST Register
AT91C_DBGU_IER            EQU (0xFFFFEE08) ;- (DBGU) Interrupt Enable Register
AT91C_DBGU_CSR            EQU (0xFFFFEE14) ;- (DBGU) Channel Status Register
AT91C_DBGU_MR             EQU (0xFFFFEE04) ;- (DBGU) Mode Register
AT91C_DBGU_RHR            EQU (0xFFFFEE18) ;- (DBGU) Receiver Holding Register
AT91C_DBGU_CIDR           EQU (0xFFFFEE40) ;- (DBGU) Chip ID Register
/* - ========== Register definition for AIC peripheral ========== */
AT91C_AIC_IVR             EQU (0xFFFFF100) ;- (AIC) IRQ Vector Register
AT91C_AIC_SMR             EQU (0xFFFFF000) ;- (AIC) Source Mode Register
AT91C_AIC_FVR             EQU (0xFFFFF104) ;- (AIC) FIQ Vector Register
AT91C_AIC_DCR             EQU (0xFFFFF138) ;- (AIC) Debug Control Register (Protect)
AT91C_AIC_EOICR           EQU (0xFFFFF130) ;- (AIC) End of Interrupt Command Register
AT91C_AIC_SVR             EQU (0xFFFFF080) ;- (AIC) Source Vector Register
AT91C_AIC_FFSR            EQU (0xFFFFF148) ;- (AIC) Fast Forcing Status Register
AT91C_AIC_ICCR            EQU (0xFFFFF128) ;- (AIC) Interrupt Clear Command Register
AT91C_AIC_ISR             EQU (0xFFFFF108) ;- (AIC) Interrupt Status Register
AT91C_AIC_IMR             EQU (0xFFFFF110) ;- (AIC) Interrupt Mask Register
AT91C_AIC_IPR             EQU (0xFFFFF10C) ;- (AIC) Interrupt Pending Register
AT91C_AIC_FFER            EQU (0xFFFFF140) ;- (AIC) Fast Forcing Enable Register
AT91C_AIC_IECR            EQU (0xFFFFF120) ;- (AIC) Interrupt Enable Command Register
AT91C_AIC_ISCR            EQU (0xFFFFF12C) ;- (AIC) Interrupt Set Command Register
AT91C_AIC_FFDR            EQU (0xFFFFF144) ;- (AIC) Fast Forcing Disable Register
AT91C_AIC_CISR            EQU (0xFFFFF114) ;- (AIC) Core Interrupt Status Register
AT91C_AIC_IDCR            EQU (0xFFFFF124) ;- (AIC) Interrupt Disable Command Register
AT91C_AIC_SPU             EQU (0xFFFFF134) ;- (AIC) Spurious Vector Register
/* - ========== Register definition for PIOA peripheral ========== */
AT91C_PIOA_OWDR           EQU (0xFFFFF2A4) ;- (PIOA) Output Write Disable Register
AT91C_PIOA_DELAY3         EQU (0xFFFFF2C8) ;- (PIOA) PIO Delay Control Register
AT91C_PIOA_ISR            EQU (0xFFFFF24C) ;- (PIOA) Interrupt Status Register
AT91C_PIOA_PDR            EQU (0xFFFFF204) ;- (PIOA) PIO Disable Register
AT91C_PIOA_OSR            EQU (0xFFFFF218) ;- (PIOA) Output Status Register
AT91C_PIOA_ABSR           EQU (0xFFFFF278) ;- (PIOA) AB Select Status Register
AT91C_PIOA_DELAY2         EQU (0xFFFFF2C4) ;- (PIOA) PIO Delay Control Register
AT91C_PIOA_PDSR           EQU (0xFFFFF23C) ;- (PIOA) Pin Data Status Register
AT91C_PIOA_BSR            EQU (0xFFFFF274) ;- (PIOA) Select B Register
AT91C_PIOA_DELAY1         EQU (0xFFFFF2C0) ;- (PIOA) PIO Delay Control Register
AT91C_PIOA_PPUER          EQU (0xFFFFF264) ;- (PIOA) Pull-up Enable Register
AT91C_PIOA_OER            EQU (0xFFFFF210) ;- (PIOA) Output Enable Register
AT91C_PIOA_PER            EQU (0xFFFFF200) ;- (PIOA) PIO Enable Register
AT91C_PIOA_VERSION        EQU (0xFFFFF2FC) ;- (PIOA) PIO Version Register
AT91C_PIOA_PPUDR          EQU (0xFFFFF260) ;- (PIOA) Pull-up Disable Register
AT91C_PIOA_ODSR           EQU (0xFFFFF238) ;- (PIOA) Output Data Status Register
AT91C_PIOA_SLEWRATE1      EQU (0xFFFFF2B0) ;- (PIOA) PIO Slewrate Control Register
AT91C_PIOA_MDDR           EQU (0xFFFFF254) ;- (PIOA) Multi-driver Disable Register
AT91C_PIOA_IFSR           EQU (0xFFFFF228) ;- (PIOA) Input Filter Status Register
AT91C_PIOA_CODR           EQU (0xFFFFF234) ;- (PIOA) Clear Output Data Register
AT91C_PIOA_ASR            EQU (0xFFFFF270) ;- (PIOA) Select A Register
AT91C_PIOA_OWSR           EQU (0xFFFFF2A8) ;- (PIOA) Output Write Status Register
AT91C_PIOA_IMR            EQU (0xFFFFF248) ;- (PIOA) Interrupt Mask Register
AT91C_PIOA_PPUSR          EQU (0xFFFFF268) ;- (PIOA) Pull-up Status Register
AT91C_PIOA_MDER           EQU (0xFFFFF250) ;- (PIOA) Multi-driver Enable Register
AT91C_PIOA_IFDR           EQU (0xFFFFF224) ;- (PIOA) Input Filter Disable Register
AT91C_PIOA_SODR           EQU (0xFFFFF230) ;- (PIOA) Set Output Data Register
AT91C_PIOA_OWER           EQU (0xFFFFF2A0) ;- (PIOA) Output Write Enable Register
AT91C_PIOA_IDR            EQU (0xFFFFF244) ;- (PIOA) Interrupt Disable Register
AT91C_PIOA_IFER           EQU (0xFFFFF220) ;- (PIOA) Input Filter Enable Register
AT91C_PIOA_IER            EQU (0xFFFFF240) ;- (PIOA) Interrupt Enable Register
AT91C_PIOA_ODR            EQU (0xFFFFF214) ;- (PIOA) Output Disable Registerr
AT91C_PIOA_MDSR           EQU (0xFFFFF258) ;- (PIOA) Multi-driver Status Register
AT91C_PIOA_DELAY4         EQU (0xFFFFF2CC) ;- (PIOA) PIO Delay Control Register
AT91C_PIOA_PSR            EQU (0xFFFFF208) ;- (PIOA) PIO Status Register
/* - ========== Register definition for PIOB peripheral ========== */
AT91C_PIOB_ODR            EQU (0xFFFFF414) ;- (PIOB) Output Disable Registerr
AT91C_PIOB_DELAY4         EQU (0xFFFFF4CC) ;- (PIOB) PIO Delay Control Register
AT91C_PIOB_SODR           EQU (0xFFFFF430) ;- (PIOB) Set Output Data Register
AT91C_PIOB_ISR            EQU (0xFFFFF44C) ;- (PIOB) Interrupt Status Register
AT91C_PIOB_ABSR           EQU (0xFFFFF478) ;- (PIOB) AB Select Status Register
AT91C_PIOB_IMR            EQU (0xFFFFF448) ;- (PIOB) Interrupt Mask Register
AT91C_PIOB_MDSR           EQU (0xFFFFF458) ;- (PIOB) Multi-driver Status Register
AT91C_PIOB_PPUSR          EQU (0xFFFFF468) ;- (PIOB) Pull-up Status Register
AT91C_PIOB_PDSR           EQU (0xFFFFF43C) ;- (PIOB) Pin Data Status Register
AT91C_PIOB_DELAY3         EQU (0xFFFFF4C8) ;- (PIOB) PIO Delay Control Register
AT91C_PIOB_MDDR           EQU (0xFFFFF454) ;- (PIOB) Multi-driver Disable Register
AT91C_PIOB_CODR           EQU (0xFFFFF434) ;- (PIOB) Clear Output Data Register
AT91C_PIOB_MDER           EQU (0xFFFFF450) ;- (PIOB) Multi-driver Enable Register
AT91C_PIOB_PDR            EQU (0xFFFFF404) ;- (PIOB) PIO Disable Register
AT91C_PIOB_IFSR           EQU (0xFFFFF428) ;- (PIOB) Input Filter Status Register
AT91C_PIOB_PSR            EQU (0xFFFFF408) ;- (PIOB) PIO Status Register
AT91C_PIOB_SLEWRATE1      EQU (0xFFFFF4B0) ;- (PIOB) PIO Slewrate Control Register
AT91C_PIOB_IER            EQU (0xFFFFF440) ;- (PIOB) Interrupt Enable Register
AT91C_PIOB_PPUDR          EQU (0xFFFFF460) ;- (PIOB) Pull-up Disable Register
AT91C_PIOB_PER            EQU (0xFFFFF400) ;- (PIOB) PIO Enable Register
AT91C_PIOB_IFDR           EQU (0xFFFFF424) ;- (PIOB) Input Filter Disable Register
AT91C_PIOB_IDR            EQU (0xFFFFF444) ;- (PIOB) Interrupt Disable Register
AT91C_PIOB_OWDR           EQU (0xFFFFF4A4) ;- (PIOB) Output Write Disable Register
AT91C_PIOB_ODSR           EQU (0xFFFFF438) ;- (PIOB) Output Data Status Register
AT91C_PIOB_DELAY2         EQU (0xFFFFF4C4) ;- (PIOB) PIO Delay Control Register
AT91C_PIOB_OWSR           EQU (0xFFFFF4A8) ;- (PIOB) Output Write Status Register
AT91C_PIOB_BSR            EQU (0xFFFFF474) ;- (PIOB) Select B Register
AT91C_PIOB_IFER           EQU (0xFFFFF420) ;- (PIOB) Input Filter Enable Register
AT91C_PIOB_OWER           EQU (0xFFFFF4A0) ;- (PIOB) Output Write Enable Register
AT91C_PIOB_PPUER          EQU (0xFFFFF464) ;- (PIOB) Pull-up Enable Register
AT91C_PIOB_OSR            EQU (0xFFFFF418) ;- (PIOB) Output Status Register
AT91C_PIOB_ASR            EQU (0xFFFFF470) ;- (PIOB) Select A Register
AT91C_PIOB_OER            EQU (0xFFFFF410) ;- (PIOB) Output Enable Register
AT91C_PIOB_VERSION        EQU (0xFFFFF4FC) ;- (PIOB) PIO Version Register
AT91C_PIOB_DELAY1         EQU (0xFFFFF4C0) ;- (PIOB) PIO Delay Control Register
/* - ========== Register definition for PIOC peripheral ========== */
AT91C_PIOC_OWDR           EQU (0xFFFFF6A4) ;- (PIOC) Output Write Disable Register
AT91C_PIOC_IMR            EQU (0xFFFFF648) ;- (PIOC) Interrupt Mask Register
AT91C_PIOC_ASR            EQU (0xFFFFF670) ;- (PIOC) Select A Register
AT91C_PIOC_PPUDR          EQU (0xFFFFF660) ;- (PIOC) Pull-up Disable Register
AT91C_PIOC_CODR           EQU (0xFFFFF634) ;- (PIOC) Clear Output Data Register
AT91C_PIOC_OWER           EQU (0xFFFFF6A0) ;- (PIOC) Output Write Enable Register
AT91C_PIOC_ABSR           EQU (0xFFFFF678) ;- (PIOC) AB Select Status Register
AT91C_PIOC_IFDR           EQU (0xFFFFF624) ;- (PIOC) Input Filter Disable Register
AT91C_PIOC_VERSION        EQU (0xFFFFF6FC) ;- (PIOC) PIO Version Register
AT91C_PIOC_ODR            EQU (0xFFFFF614) ;- (PIOC) Output Disable Registerr
AT91C_PIOC_PPUER          EQU (0xFFFFF664) ;- (PIOC) Pull-up Enable Register
AT91C_PIOC_SODR           EQU (0xFFFFF630) ;- (PIOC) Set Output Data Register
AT91C_PIOC_ISR            EQU (0xFFFFF64C) ;- (PIOC) Interrupt Status Register
AT91C_PIOC_OSR            EQU (0xFFFFF618) ;- (PIOC) Output Status Register
AT91C_PIOC_MDSR           EQU (0xFFFFF658) ;- (PIOC) Multi-driver Status Register
AT91C_PIOC_IFER           EQU (0xFFFFF620) ;- (PIOC) Input Filter Enable Register
AT91C_PIOC_DELAY2         EQU (0xFFFFF6C4) ;- (PIOC) PIO Delay Control Register
AT91C_PIOC_MDER           EQU (0xFFFFF650) ;- (PIOC) Multi-driver Enable Register
AT91C_PIOC_PPUSR          EQU (0xFFFFF668) ;- (PIOC) Pull-up Status Register
AT91C_PIOC_PSR            EQU (0xFFFFF608) ;- (PIOC) PIO Status Register
AT91C_PIOC_DELAY4         EQU (0xFFFFF6CC) ;- (PIOC) PIO Delay Control Register
