una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91cap9.h
AT91C_PIOC_DELAY3         EQU (0xFFFFF6C8) ;- (PIOC) PIO Delay Control Register
AT91C_PIOC_IER            EQU (0xFFFFF640) ;- (PIOC) Interrupt Enable Register
AT91C_PIOC_SLEWRATE1      EQU (0xFFFFF6B0) ;- (PIOC) PIO Slewrate Control Register
AT91C_PIOC_IDR            EQU (0xFFFFF644) ;- (PIOC) Interrupt Disable Register
AT91C_PIOC_PDSR           EQU (0xFFFFF63C) ;- (PIOC) Pin Data Status Register
AT91C_PIOC_DELAY1         EQU (0xFFFFF6C0) ;- (PIOC) PIO Delay Control Register
AT91C_PIOC_PDR            EQU (0xFFFFF604) ;- (PIOC) PIO Disable Register
AT91C_PIOC_OWSR           EQU (0xFFFFF6A8) ;- (PIOC) Output Write Status Register
AT91C_PIOC_IFSR           EQU (0xFFFFF628) ;- (PIOC) Input Filter Status Register
AT91C_PIOC_ODSR           EQU (0xFFFFF638) ;- (PIOC) Output Data Status Register
AT91C_PIOC_OER            EQU (0xFFFFF610) ;- (PIOC) Output Enable Register
AT91C_PIOC_MDDR           EQU (0xFFFFF654) ;- (PIOC) Multi-driver Disable Register
AT91C_PIOC_BSR            EQU (0xFFFFF674) ;- (PIOC) Select B Register
AT91C_PIOC_PER            EQU (0xFFFFF600) ;- (PIOC) PIO Enable Register
/* - ========== Register definition for PIOD peripheral ========== */
AT91C_PIOD_DELAY1         EQU (0xFFFFF8C0) ;- (PIOD) PIO Delay Control Register
AT91C_PIOD_OWDR           EQU (0xFFFFF8A4) ;- (PIOD) Output Write Disable Register
AT91C_PIOD_SODR           EQU (0xFFFFF830) ;- (PIOD) Set Output Data Register
AT91C_PIOD_PPUER          EQU (0xFFFFF864) ;- (PIOD) Pull-up Enable Register
AT91C_PIOD_CODR           EQU (0xFFFFF834) ;- (PIOD) Clear Output Data Register
AT91C_PIOD_DELAY4         EQU (0xFFFFF8CC) ;- (PIOD) PIO Delay Control Register
AT91C_PIOD_PSR            EQU (0xFFFFF808) ;- (PIOD) PIO Status Register
AT91C_PIOD_PDR            EQU (0xFFFFF804) ;- (PIOD) PIO Disable Register
AT91C_PIOD_ODR            EQU (0xFFFFF814) ;- (PIOD) Output Disable Registerr
AT91C_PIOD_PPUSR          EQU (0xFFFFF868) ;- (PIOD) Pull-up Status Register
AT91C_PIOD_IFSR           EQU (0xFFFFF828) ;- (PIOD) Input Filter Status Register
AT91C_PIOD_IMR            EQU (0xFFFFF848) ;- (PIOD) Interrupt Mask Register
AT91C_PIOD_ASR            EQU (0xFFFFF870) ;- (PIOD) Select A Register
AT91C_PIOD_DELAY2         EQU (0xFFFFF8C4) ;- (PIOD) PIO Delay Control Register
AT91C_PIOD_OWSR           EQU (0xFFFFF8A8) ;- (PIOD) Output Write Status Register
AT91C_PIOD_PER            EQU (0xFFFFF800) ;- (PIOD) PIO Enable Register
AT91C_PIOD_MDER           EQU (0xFFFFF850) ;- (PIOD) Multi-driver Enable Register
AT91C_PIOD_PDSR           EQU (0xFFFFF83C) ;- (PIOD) Pin Data Status Register
AT91C_PIOD_MDSR           EQU (0xFFFFF858) ;- (PIOD) Multi-driver Status Register
AT91C_PIOD_OWER           EQU (0xFFFFF8A0) ;- (PIOD) Output Write Enable Register
AT91C_PIOD_BSR            EQU (0xFFFFF874) ;- (PIOD) Select B Register
AT91C_PIOD_IFDR           EQU (0xFFFFF824) ;- (PIOD) Input Filter Disable Register
AT91C_PIOD_DELAY3         EQU (0xFFFFF8C8) ;- (PIOD) PIO Delay Control Register
AT91C_PIOD_ABSR           EQU (0xFFFFF878) ;- (PIOD) AB Select Status Register
AT91C_PIOD_OER            EQU (0xFFFFF810) ;- (PIOD) Output Enable Register
AT91C_PIOD_MDDR           EQU (0xFFFFF854) ;- (PIOD) Multi-driver Disable Register
AT91C_PIOD_IDR            EQU (0xFFFFF844) ;- (PIOD) Interrupt Disable Register
AT91C_PIOD_IER            EQU (0xFFFFF840) ;- (PIOD) Interrupt Enable Register
AT91C_PIOD_PPUDR          EQU (0xFFFFF860) ;- (PIOD) Pull-up Disable Register
AT91C_PIOD_VERSION        EQU (0xFFFFF8FC) ;- (PIOD) PIO Version Register
AT91C_PIOD_ISR            EQU (0xFFFFF84C) ;- (PIOD) Interrupt Status Register
AT91C_PIOD_ODSR           EQU (0xFFFFF838) ;- (PIOD) Output Data Status Register
AT91C_PIOD_OSR            EQU (0xFFFFF818) ;- (PIOD) Output Status Register
AT91C_PIOD_IFER           EQU (0xFFFFF820) ;- (PIOD) Input Filter Enable Register
AT91C_PIOD_SLEWRATE1      EQU (0xFFFFF8B0) ;- (PIOD) PIO Slewrate Control Register
/* - ========== Register definition for CKGR peripheral ========== */
AT91C_CKGR_MOR            EQU (0xFFFFFC20) ;- (CKGR) Main Oscillator Register
AT91C_CKGR_PLLBR          EQU (0xFFFFFC2C) ;- (CKGR) PLL B Register
AT91C_CKGR_MCFR           EQU (0xFFFFFC24) ;- (CKGR) Main Clock  Frequency Register
AT91C_CKGR_PLLAR          EQU (0xFFFFFC28) ;- (CKGR) PLL A Register
AT91C_CKGR_UCKR           EQU (0xFFFFFC1C) ;- (CKGR) UTMI Clock Configuration Register
/* - ========== Register definition for PMC peripheral ========== */
AT91C_PMC_PCER            EQU (0xFFFFFC10) ;- (PMC) Peripheral Clock Enable Register
AT91C_PMC_PCKR            EQU (0xFFFFFC40) ;- (PMC) Programmable Clock Register
AT91C_PMC_MCKR            EQU (0xFFFFFC30) ;- (PMC) Master Clock Register
AT91C_PMC_PLLAR           EQU (0xFFFFFC28) ;- (PMC) PLL A Register
AT91C_PMC_PCDR            EQU (0xFFFFFC14) ;- (PMC) Peripheral Clock Disable Register
AT91C_PMC_SCSR            EQU (0xFFFFFC08) ;- (PMC) System Clock Status Register
AT91C_PMC_MCFR            EQU (0xFFFFFC24) ;- (PMC) Main Clock  Frequency Register
AT91C_PMC_IMR             EQU (0xFFFFFC6C) ;- (PMC) Interrupt Mask Register
AT91C_PMC_IER             EQU (0xFFFFFC60) ;- (PMC) Interrupt Enable Register
AT91C_PMC_UCKR            EQU (0xFFFFFC1C) ;- (PMC) UTMI Clock Configuration Register
AT91C_PMC_MOR             EQU (0xFFFFFC20) ;- (PMC) Main Oscillator Register
AT91C_PMC_IDR             EQU (0xFFFFFC64) ;- (PMC) Interrupt Disable Register
AT91C_PMC_PLLBR           EQU (0xFFFFFC2C) ;- (PMC) PLL B Register
AT91C_PMC_SCDR            EQU (0xFFFFFC04) ;- (PMC) System Clock Disable Register
AT91C_PMC_PCSR            EQU (0xFFFFFC18) ;- (PMC) Peripheral Clock Status Register
AT91C_PMC_SCER            EQU (0xFFFFFC00) ;- (PMC) System Clock Enable Register
AT91C_PMC_SR              EQU (0xFFFFFC68) ;- (PMC) Status Register
/* - ========== Register definition for RSTC peripheral ========== */
AT91C_RSTC_RCR            EQU (0xFFFFFD00) ;- (RSTC) Reset Control Register
AT91C_RSTC_RMR            EQU (0xFFFFFD08) ;- (RSTC) Reset Mode Register
AT91C_RSTC_RSR            EQU (0xFFFFFD04) ;- (RSTC) Reset Status Register
/* - ========== Register definition for SHDWC peripheral ========== */
AT91C_SHDWC_SHSR          EQU (0xFFFFFD18) ;- (SHDWC) Shut Down Status Register
AT91C_SHDWC_SHMR          EQU (0xFFFFFD14) ;- (SHDWC) Shut Down Mode Register
AT91C_SHDWC_SHCR          EQU (0xFFFFFD10) ;- (SHDWC) Shut Down Control Register
/* - ========== Register definition for RTTC peripheral ========== */
AT91C_RTTC_RTSR           EQU (0xFFFFFD2C) ;- (RTTC) Real-time Status Register
AT91C_RTTC_RTMR           EQU (0xFFFFFD20) ;- (RTTC) Real-time Mode Register
AT91C_RTTC_RTVR           EQU (0xFFFFFD28) ;- (RTTC) Real-time Value Register
AT91C_RTTC_RTAR           EQU (0xFFFFFD24) ;- (RTTC) Real-time Alarm Register
/* - ========== Register definition for PITC peripheral ========== */
AT91C_PITC_PIVR           EQU (0xFFFFFD38) ;- (PITC) Period Interval Value Register
AT91C_PITC_PISR           EQU (0xFFFFFD34) ;- (PITC) Period Interval Status Register
AT91C_PITC_PIIR           EQU (0xFFFFFD3C) ;- (PITC) Period Interval Image Register
AT91C_PITC_PIMR           EQU (0xFFFFFD30) ;- (PITC) Period Interval Mode Register
/* - ========== Register definition for WDTC peripheral ========== */
AT91C_WDTC_WDCR           EQU (0xFFFFFD40) ;- (WDTC) Watchdog Control Register
AT91C_WDTC_WDSR           EQU (0xFFFFFD48) ;- (WDTC) Watchdog Status Register
AT91C_WDTC_WDMR           EQU (0xFFFFFD44) ;- (WDTC) Watchdog Mode Register
/* - ========== Register definition for UDP peripheral ========== */
AT91C_UDP_FDR             EQU (0xFFF78050) ;- (UDP) Endpoint FIFO Data Register
AT91C_UDP_IER             EQU (0xFFF78010) ;- (UDP) Interrupt Enable Register
AT91C_UDP_CSR             EQU (0xFFF78030) ;- (UDP) Endpoint Control and Status Register
AT91C_UDP_RSTEP           EQU (0xFFF78028) ;- (UDP) Reset Endpoint Register
AT91C_UDP_GLBSTATE        EQU (0xFFF78004) ;- (UDP) Global State Register
AT91C_UDP_TXVC            EQU (0xFFF78074) ;- (UDP) Transceiver Control Register
AT91C_UDP_IDR             EQU (0xFFF78014) ;- (UDP) Interrupt Disable Register
AT91C_UDP_ISR             EQU (0xFFF7801C) ;- (UDP) Interrupt Status Register
AT91C_UDP_IMR             EQU (0xFFF78018) ;- (UDP) Interrupt Mask Register
AT91C_UDP_FADDR           EQU (0xFFF78008) ;- (UDP) Function Address Register
AT91C_UDP_NUM             EQU (0xFFF78000) ;- (UDP) Frame Number Register
AT91C_UDP_ICR             EQU (0xFFF78020) ;- (UDP) Interrupt Clear Register
/* - ========== Register definition for UDPHS_EPTFIFO peripheral ========== */
AT91C_UDPHS_EPTFIFO_READEPT3 EQU (0x00630000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 3
AT91C_UDPHS_EPTFIFO_READEPT5 EQU (0x00650000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 5
AT91C_UDPHS_EPTFIFO_READEPT1 EQU (0x00610000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 1
AT91C_UDPHS_EPTFIFO_READEPT0 EQU (0x00600000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 0
AT91C_UDPHS_EPTFIFO_READEPT6 EQU (0x00660000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 6
AT91C_UDPHS_EPTFIFO_READEPT2 EQU (0x00620000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 2
AT91C_UDPHS_EPTFIFO_READEPT4 EQU (0x00640000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 4
AT91C_UDPHS_EPTFIFO_READEPT7 EQU (0x00670000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 7
/* - ========== Register definition for UDPHS_EPT_0 peripheral ========== */
AT91C_UDPHS_EPT_0_EPTSTA  EQU (0xFFF7811C) ;- (UDPHS_EPT_0) UDPHS Endpoint Status Register
AT91C_UDPHS_EPT_0_EPTCTL  EQU (0xFFF7810C) ;- (UDPHS_EPT_0) UDPHS Endpoint Control Register
AT91C_UDPHS_EPT_0_EPTCTLDIS EQU (0xFFF78108) ;- (UDPHS_EPT_0) UDPHS Endpoint Control Disable Register
AT91C_UDPHS_EPT_0_EPTCFG  EQU (0xFFF78100) ;- (UDPHS_EPT_0) UDPHS Endpoint Config Register
AT91C_UDPHS_EPT_0_EPTCLRSTA EQU (0xFFF78118) ;- (UDPHS_EPT_0) UDPHS Endpoint Clear Status Register
AT91C_UDPHS_EPT_0_EPTSETSTA EQU (0xFFF78114) ;- (UDPHS_EPT_0) UDPHS Endpoint Set Status Register
AT91C_UDPHS_EPT_0_EPTCTLENB EQU (0xFFF78104) ;- (UDPHS_EPT_0) UDPHS Endpoint Control Enable Register
/* - ========== Register definition for UDPHS_EPT_1 peripheral ========== */
AT91C_UDPHS_EPT_1_EPTCTLENB EQU (0xFFF78124) ;- (UDPHS_EPT_1) UDPHS Endpoint Control Enable Register
AT91C_UDPHS_EPT_1_EPTCFG  EQU (0xFFF78120) ;- (UDPHS_EPT_1) UDPHS Endpoint Config Register
AT91C_UDPHS_EPT_1_EPTCTL  EQU (0xFFF7812C) ;- (UDPHS_EPT_1) UDPHS Endpoint Control Register
AT91C_UDPHS_EPT_1_EPTSTA  EQU (0xFFF7813C) ;- (UDPHS_EPT_1) UDPHS Endpoint Status Register
AT91C_UDPHS_EPT_1_EPTCLRSTA EQU (0xFFF78138) ;- (UDPHS_EPT_1) UDPHS Endpoint Clear Status Register
AT91C_UDPHS_EPT_1_EPTSETSTA EQU (0xFFF78134) ;- (UDPHS_EPT_1) UDPHS Endpoint Set Status Register
AT91C_UDPHS_EPT_1_EPTCTLDIS EQU (0xFFF78128) ;- (UDPHS_EPT_1) UDPHS Endpoint Control Disable Register
/* - ========== Register definition for UDPHS_EPT_2 peripheral ========== */
AT91C_UDPHS_EPT_2_EPTCLRSTA EQU (0xFFF78158) ;- (UDPHS_EPT_2) UDPHS Endpoint Clear Status Register
AT91C_UDPHS_EPT_2_EPTCTLDIS EQU (0xFFF78148) ;- (UDPHS_EPT_2) UDPHS Endpoint Control Disable Register
AT91C_UDPHS_EPT_2_EPTSTA  EQU (0xFFF7815C) ;- (UDPHS_EPT_2) UDPHS Endpoint Status Register
AT91C_UDPHS_EPT_2_EPTSETSTA EQU (0xFFF78154) ;- (UDPHS_EPT_2) UDPHS Endpoint Set Status Register
AT91C_UDPHS_EPT_2_EPTCTL  EQU (0xFFF7814C) ;- (UDPHS_EPT_2) UDPHS Endpoint Control Register
AT91C_UDPHS_EPT_2_EPTCFG  EQU (0xFFF78140) ;- (UDPHS_EPT_2) UDPHS Endpoint Config Register
AT91C_UDPHS_EPT_2_EPTCTLENB EQU (0xFFF78144) ;- (UDPHS_EPT_2) UDPHS Endpoint Control Enable Register
/* - ========== Register definition for UDPHS_EPT_3 peripheral ========== */
AT91C_UDPHS_EPT_3_EPTCTL  EQU (0xFFF7816C) ;- (UDPHS_EPT_3) UDPHS Endpoint Control Register
AT91C_UDPHS_EPT_3_EPTCLRSTA EQU (0xFFF78178) ;- (UDPHS_EPT_3) UDPHS Endpoint Clear Status Register
AT91C_UDPHS_EPT_3_EPTCTLDIS EQU (0xFFF78168) ;- (UDPHS_EPT_3) UDPHS Endpoint Control Disable Register
AT91C_UDPHS_EPT_3_EPTSTA  EQU (0xFFF7817C) ;- (UDPHS_EPT_3) UDPHS Endpoint Status Register
AT91C_UDPHS_EPT_3_EPTSETSTA EQU (0xFFF78174) ;- (UDPHS_EPT_3) UDPHS Endpoint Set Status Register
AT91C_UDPHS_EPT_3_EPTCTLENB EQU (0xFFF78164) ;- (UDPHS_EPT_3) UDPHS Endpoint Control Enable Register
AT91C_UDPHS_EPT_3_EPTCFG  EQU (0xFFF78160) ;- (UDPHS_EPT_3) UDPHS Endpoint Config Register
/* - ========== Register definition for UDPHS_EPT_4 peripheral ========== */
AT91C_UDPHS_EPT_4_EPTCLRSTA EQU (0xFFF78198) ;- (UDPHS_EPT_4) UDPHS Endpoint Clear Status Register
AT91C_UDPHS_EPT_4_EPTCTL  EQU (0xFFF7818C) ;- (UDPHS_EPT_4) UDPHS Endpoint Control Register
AT91C_UDPHS_EPT_4_EPTCTLENB EQU (0xFFF78184) ;- (UDPHS_EPT_4) UDPHS Endpoint Control Enable Register
AT91C_UDPHS_EPT_4_EPTSTA  EQU (0xFFF7819C) ;- (UDPHS_EPT_4) UDPHS Endpoint Status Register
AT91C_UDPHS_EPT_4_EPTSETSTA EQU (0xFFF78194) ;- (UDPHS_EPT_4) UDPHS Endpoint Set Status Register
AT91C_UDPHS_EPT_4_EPTCFG  EQU (0xFFF78180) ;- (UDPHS_EPT_4) UDPHS Endpoint Config Register
AT91C_UDPHS_EPT_4_EPTCTLDIS EQU (0xFFF78188) ;- (UDPHS_EPT_4) UDPHS Endpoint Control Disable Register
/* - ========== Register definition for UDPHS_EPT_5 peripheral ========== */
AT91C_UDPHS_EPT_5_EPTSTA  EQU (0xFFF781BC) ;- (UDPHS_EPT_5) UDPHS Endpoint Status Register
AT91C_UDPHS_EPT_5_EPTCLRSTA EQU (0xFFF781B8) ;- (UDPHS_EPT_5) UDPHS Endpoint Clear Status Register
AT91C_UDPHS_EPT_5_EPTCTLENB EQU (0xFFF781A4) ;- (UDPHS_EPT_5) UDPHS Endpoint Control Enable Register
AT91C_UDPHS_EPT_5_EPTSETSTA EQU (0xFFF781B4) ;- (UDPHS_EPT_5) UDPHS Endpoint Set Status Register
AT91C_UDPHS_EPT_5_EPTCTLDIS EQU (0xFFF781A8) ;- (UDPHS_EPT_5) UDPHS Endpoint Control Disable Register
AT91C_UDPHS_EPT_5_EPTCFG  EQU (0xFFF781A0) ;- (UDPHS_EPT_5) UDPHS Endpoint Config Register
AT91C_UDPHS_EPT_5_EPTCTL  EQU (0xFFF781AC) ;- (UDPHS_EPT_5) UDPHS Endpoint Control Register
/* - ========== Register definition for UDPHS_EPT_6 peripheral ========== */
AT91C_UDPHS_EPT_6_EPTCLRSTA EQU (0xFFF781D8) ;- (UDPHS_EPT_6) UDPHS Endpoint Clear Status Register
AT91C_UDPHS_EPT_6_EPTCTLENB EQU (0xFFF781C4) ;- (UDPHS_EPT_6) UDPHS Endpoint Control Enable Register
AT91C_UDPHS_EPT_6_EPTCTL  EQU (0xFFF781CC) ;- (UDPHS_EPT_6) UDPHS Endpoint Control Register
AT91C_UDPHS_EPT_6_EPTSETSTA EQU (0xFFF781D4) ;- (UDPHS_EPT_6) UDPHS Endpoint Set Status Register
AT91C_UDPHS_EPT_6_EPTCTLDIS EQU (0xFFF781C8) ;- (UDPHS_EPT_6) UDPHS Endpoint Control Disable Register
AT91C_UDPHS_EPT_6_EPTSTA  EQU (0xFFF781DC) ;- (UDPHS_EPT_6) UDPHS Endpoint Status Register
AT91C_UDPHS_EPT_6_EPTCFG  EQU (0xFFF781C0) ;- (UDPHS_EPT_6) UDPHS Endpoint Config Register
/* - ========== Register definition for UDPHS_EPT_7 peripheral ========== */
AT91C_UDPHS_EPT_7_EPTSETSTA EQU (0xFFF781F4) ;- (UDPHS_EPT_7) UDPHS Endpoint Set Status Register
AT91C_UDPHS_EPT_7_EPTCFG  EQU (0xFFF781E0) ;- (UDPHS_EPT_7) UDPHS Endpoint Config Register
AT91C_UDPHS_EPT_7_EPTSTA  EQU (0xFFF781FC) ;- (UDPHS_EPT_7) UDPHS Endpoint Status Register
AT91C_UDPHS_EPT_7_EPTCLRSTA EQU (0xFFF781F8) ;- (UDPHS_EPT_7) UDPHS Endpoint Clear Status Register
AT91C_UDPHS_EPT_7_EPTCTL  EQU (0xFFF781EC) ;- (UDPHS_EPT_7) UDPHS Endpoint Control Register
AT91C_UDPHS_EPT_7_EPTCTLDIS EQU (0xFFF781E8) ;- (UDPHS_EPT_7) UDPHS Endpoint Control Disable Register
AT91C_UDPHS_EPT_7_EPTCTLENB EQU (0xFFF781E4) ;- (UDPHS_EPT_7) UDPHS Endpoint Control Enable Register
/* - ========== Register definition for UDPHS_DMA_1 peripheral ========== */
AT91C_UDPHS_DMA_1_DMASTATUS EQU (0xFFF7831C) ;- (UDPHS_DMA_1) UDPHS DMA Channel Status Register
AT91C_UDPHS_DMA_1_DMANXTDSC EQU (0xFFF78310) ;- (UDPHS_DMA_1) UDPHS DMA Channel Next Descriptor Address
AT91C_UDPHS_DMA_1_DMACONTROL EQU (0xFFF78318) ;- (UDPHS_DMA_1) UDPHS DMA Channel Control Register
AT91C_UDPHS_DMA_1_DMAADDRESS EQU (0xFFF78314) ;- (UDPHS_DMA_1) UDPHS DMA Channel Address Register
/* - ========== Register definition for UDPHS_DMA_2 peripheral ========== */
AT91C_UDPHS_DMA_2_DMACONTROL EQU (0xFFF78328) ;- (UDPHS_DMA_2) UDPHS DMA Channel Control Register
AT91C_UDPHS_DMA_2_DMASTATUS EQU (0xFFF7832C) ;- (UDPHS_DMA_2) UDPHS DMA Channel Status Register
AT91C_UDPHS_DMA_2_DMAADDRESS EQU (0xFFF78324) ;- (UDPHS_DMA_2) UDPHS DMA Channel Address Register
AT91C_UDPHS_DMA_2_DMANXTDSC EQU (0xFFF78320) ;- (UDPHS_DMA_2) UDPHS DMA Channel Next Descriptor Address
/* - ========== Register definition for UDPHS_DMA_3 peripheral ========== */
AT91C_UDPHS_DMA_3_DMAADDRESS EQU (0xFFF78334) ;- (UDPHS_DMA_3) UDPHS DMA Channel Address Register
AT91C_UDPHS_DMA_3_DMANXTDSC EQU (0xFFF78330) ;- (UDPHS_DMA_3) UDPHS DMA Channel Next Descriptor Address
AT91C_UDPHS_DMA_3_DMACONTROL EQU (0xFFF78338) ;- (UDPHS_DMA_3) UDPHS DMA Channel Control Register
AT91C_UDPHS_DMA_3_DMASTATUS EQU (0xFFF7833C) ;- (UDPHS_DMA_3) UDPHS DMA Channel Status Register
/* - ========== Register definition for UDPHS_DMA_4 peripheral ========== */
AT91C_UDPHS_DMA_4_DMANXTDSC EQU (0xFFF78340) ;- (UDPHS_DMA_4) UDPHS DMA Channel Next Descriptor Address
AT91C_UDPHS_DMA_4_DMAADDRESS EQU (0xFFF78344) ;- (UDPHS_DMA_4) UDPHS DMA Channel Address Register
AT91C_UDPHS_DMA_4_DMACONTROL EQU (0xFFF78348) ;- (UDPHS_DMA_4) UDPHS DMA Channel Control Register
AT91C_UDPHS_DMA_4_DMASTATUS EQU (0xFFF7834C) ;- (UDPHS_DMA_4) UDPHS DMA Channel Status Register
/* - ========== Register definition for UDPHS_DMA_5 peripheral ========== */
AT91C_UDPHS_DMA_5_DMASTATUS EQU (0xFFF7835C) ;- (UDPHS_DMA_5) UDPHS DMA Channel Status Register
AT91C_UDPHS_DMA_5_DMACONTROL EQU (0xFFF78358) ;- (UDPHS_DMA_5) UDPHS DMA Channel Control Register
AT91C_UDPHS_DMA_5_DMANXTDSC EQU (0xFFF78350) ;- (UDPHS_DMA_5) UDPHS DMA Channel Next Descriptor Address
AT91C_UDPHS_DMA_5_DMAADDRESS EQU (0xFFF78354) ;- (UDPHS_DMA_5) UDPHS DMA Channel Address Register
/* - ========== Register definition for UDPHS_DMA_6 peripheral ========== */
AT91C_UDPHS_DMA_6_DMANXTDSC EQU (0xFFF78360) ;- (UDPHS_DMA_6) UDPHS DMA Channel Next Descriptor Address
AT91C_UDPHS_DMA_6_DMACONTROL EQU (0xFFF78368) ;- (UDPHS_DMA_6) UDPHS DMA Channel Control Register
AT91C_UDPHS_DMA_6_DMASTATUS EQU (0xFFF7836C) ;- (UDPHS_DMA_6) UDPHS DMA Channel Status Register
AT91C_UDPHS_DMA_6_DMAADDRESS EQU (0xFFF78364) ;- (UDPHS_DMA_6) UDPHS DMA Channel Address Register
/* - ========== Register definition for UDPHS peripheral ========== */
AT91C_UDPHS_IEN           EQU (0xFFF78010) ;- (UDPHS) UDPHS Interrupt Enable Register
AT91C_UDPHS_TSTSOFCNT     EQU (0xFFF780D0) ;- (UDPHS) UDPHS Test SOF Counter Register
AT91C_UDPHS_IPFEATURES    EQU (0xFFF780F8) ;- (UDPHS) UDPHS Features Register
AT91C_UDPHS_TST           EQU (0xFFF780E0) ;- (UDPHS) UDPHS Test Register
AT91C_UDPHS_FNUM          EQU (0xFFF78004) ;- (UDPHS) UDPHS Frame Number Register
AT91C_UDPHS_TSTCNTB       EQU (0xFFF780D8) ;- (UDPHS) UDPHS Test B Counter Register
AT91C_UDPHS_RIPPADDRSIZE  EQU (0xFFF780EC) ;- (UDPHS) UDPHS PADDRSIZE Register
AT91C_UDPHS_INTSTA        EQU (0xFFF78014) ;- (UDPHS) UDPHS Interrupt Status Register
AT91C_UDPHS_EPTRST        EQU (0xFFF7801C) ;- (UDPHS) UDPHS Endpoints Reset Register
AT91C_UDPHS_TSTCNTA       EQU (0xFFF780D4) ;- (UDPHS) UDPHS Test A Counter Register
AT91C_UDPHS_RIPNAME2      EQU (0xFFF780F4) ;- (UDPHS) UDPHS Name2 Register
AT91C_UDPHS_RIPNAME1      EQU (0xFFF780F0) ;- (UDPHS) UDPHS Name1 Register
AT91C_UDPHS_TSTMODREG     EQU (0xFFF780DC) ;- (UDPHS) UDPHS Test Mode Register
AT91C_UDPHS_CLRINT        EQU (0xFFF78018) ;- (UDPHS) UDPHS Clear Interrupt Register
AT91C_UDPHS_IPVERSION     EQU (0xFFF780FC) ;- (UDPHS) UDPHS Version Register
AT91C_UDPHS_CTRL          EQU (0xFFF78000) ;- (UDPHS) UDPHS Control Register
/* - ========== Register definition for TC0 peripheral ========== */
AT91C_TC0_IER             EQU (0xFFF7C024) ;- (TC0) Interrupt Enable Register
AT91C_TC0_IMR             EQU (0xFFF7C02C) ;- (TC0) Interrupt Mask Register
AT91C_TC0_CCR             EQU (0xFFF7C000) ;- (TC0) Channel Control Register
AT91C_TC0_RB              EQU (0xFFF7C018) ;- (TC0) Register B
AT91C_TC0_CV              EQU (0xFFF7C010) ;- (TC0) Counter Value
AT91C_TC0_SR              EQU (0xFFF7C020) ;- (TC0) Status Register
AT91C_TC0_CMR             EQU (0xFFF7C004) ;- (TC0) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC0_RA              EQU (0xFFF7C014) ;- (TC0) Register A
AT91C_TC0_RC              EQU (0xFFF7C01C) ;- (TC0) Register C
AT91C_TC0_IDR             EQU (0xFFF7C028) ;- (TC0) Interrupt Disable Register
/* - ========== Register definition for TC1 peripheral ========== */
AT91C_TC1_IER             EQU (0xFFF7C064) ;- (TC1) Interrupt Enable Register
AT91C_TC1_SR              EQU (0xFFF7C060) ;- (TC1) Status Register
AT91C_TC1_RC              EQU (0xFFF7C05C) ;- (TC1) Register C
AT91C_TC1_CV              EQU (0xFFF7C050) ;- (TC1) Counter Value
AT91C_TC1_RA              EQU (0xFFF7C054) ;- (TC1) Register A
AT91C_TC1_CMR             EQU (0xFFF7C044) ;- (TC1) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC1_IDR             EQU (0xFFF7C068) ;- (TC1) Interrupt Disable Register
AT91C_TC1_RB              EQU (0xFFF7C058) ;- (TC1) Register B
AT91C_TC1_IMR             EQU (0xFFF7C06C) ;- (TC1) Interrupt Mask Register
AT91C_TC1_CCR             EQU (0xFFF7C040) ;- (TC1) Channel Control Register
/* - ========== Register definition for TC2 peripheral ========== */
AT91C_TC2_SR              EQU (0xFFF7C0A0) ;- (TC2) Status Register
AT91C_TC2_IMR             EQU (0xFFF7C0AC) ;- (TC2) Interrupt Mask Register
AT91C_TC2_IER             EQU (0xFFF7C0A4) ;- (TC2) Interrupt Enable Register
AT91C_TC2_CV              EQU (0xFFF7C090) ;- (TC2) Counter Value
AT91C_TC2_RB              EQU (0xFFF7C098) ;- (TC2) Register B
AT91C_TC2_CCR             EQU (0xFFF7C080) ;- (TC2) Channel Control Register
AT91C_TC2_CMR             EQU (0xFFF7C084) ;- (TC2) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC2_RA              EQU (0xFFF7C094) ;- (TC2) Register A
AT91C_TC2_IDR             EQU (0xFFF7C0A8) ;- (TC2) Interrupt Disable Register
AT91C_TC2_RC              EQU (0xFFF7C09C) ;- (TC2) Register C
/* - ========== Register definition for TCB0 peripheral ========== */
AT91C_TCB0_BCR            EQU (0xFFF7C0C0) ;- (TCB0) TC Block Control Register
AT91C_TCB0_BMR            EQU (0xFFF7C0C4) ;- (TCB0) TC Block Mode Register
/* - ========== Register definition for TCB1 peripheral ========== */
AT91C_TCB1_BMR            EQU (0xFFF7C104) ;- (TCB1) TC Block Mode Register
AT91C_TCB1_BCR            EQU (0xFFF7C100) ;- (TCB1) TC Block Control Register
/* - ========== Register definition for TCB2 peripheral ========== */
AT91C_TCB2_BCR            EQU (0xFFF7C140) ;- (TCB2) TC Block Control Register
AT91C_TCB2_BMR            EQU (0xFFF7C144) ;- (TCB2) TC Block Mode Register
/* - ========== Register definition for PDC_MCI0 peripheral ========== */
AT91C_MCI0_TCR            EQU (0xFFF8010C) ;- (PDC_MCI0) Transmit Counter Register
AT91C_MCI0_TNCR           EQU (0xFFF8011C) ;- (PDC_MCI0) Transmit Next Counter Register
AT91C_MCI0_RNPR           EQU (0xFFF80110) ;- (PDC_MCI0) Receive Next Pointer Register
AT91C_MCI0_TPR            EQU (0xFFF80108) ;- (PDC_MCI0) Transmit Pointer Register
AT91C_MCI0_TNPR           EQU (0xFFF80118) ;- (PDC_MCI0) Transmit Next Pointer Register
AT91C_MCI0_PTSR           EQU (0xFFF80124) ;- (PDC_MCI0) PDC Transfer Status Register
AT91C_MCI0_RCR            EQU (0xFFF80104) ;- (PDC_MCI0) Receive Counter Register
AT91C_MCI0_PTCR           EQU (0xFFF80120) ;- (PDC_MCI0) PDC Transfer Control Register
AT91C_MCI0_RPR            EQU (0xFFF80100) ;- (PDC_MCI0) Receive Pointer Register
AT91C_MCI0_RNCR           EQU (0xFFF80114) ;- (PDC_MCI0) Receive Next Counter Register
/* - ========== Register definition for MCI0 peripheral ========== */
AT91C_MCI0_IMR            EQU (0xFFF8004C) ;- (MCI0) MCI Interrupt Mask Register
