una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91cap9.h
AT91C_MCI0_MR             EQU (0xFFF80004) ;- (MCI0) MCI Mode Register
AT91C_MCI0_CR             EQU (0xFFF80000) ;- (MCI0) MCI Control Register
AT91C_MCI0_IER            EQU (0xFFF80044) ;- (MCI0) MCI Interrupt Enable Register
AT91C_MCI0_FIFO           EQU (0xFFF80200) ;- (MCI0) MCI FIFO Aperture Register
AT91C_MCI0_DTOR           EQU (0xFFF80008) ;- (MCI0) MCI Data Timeout Register
AT91C_MCI0_SDCR           EQU (0xFFF8000C) ;- (MCI0) MCI SD/SDIO Card Register
AT91C_MCI0_BLKR           EQU (0xFFF80018) ;- (MCI0) MCI Block Register
AT91C_MCI0_VR             EQU (0xFFF800FC) ;- (MCI0) MCI Version Register
AT91C_MCI0_WPSR           EQU (0xFFF800E8) ;- (MCI0) MCI Write Protection Status Register
AT91C_MCI0_CMDR           EQU (0xFFF80014) ;- (MCI0) MCI Command Register
AT91C_MCI0_CSTOR          EQU (0xFFF8001C) ;- (MCI0) MCI Completion Signal Timeout Register
AT91C_MCI0_DMA            EQU (0xFFF80050) ;- (MCI0) MCI DMA Configuration Register
AT91C_MCI0_RDR            EQU (0xFFF80030) ;- (MCI0) MCI Receive Data Register
AT91C_MCI0_SR             EQU (0xFFF80040) ;- (MCI0) MCI Status Register
AT91C_MCI0_TDR            EQU (0xFFF80034) ;- (MCI0) MCI Transmit Data Register
AT91C_MCI0_CFG            EQU (0xFFF80054) ;- (MCI0) MCI Configuration Register
AT91C_MCI0_ARGR           EQU (0xFFF80010) ;- (MCI0) MCI Argument Register
AT91C_MCI0_RSPR           EQU (0xFFF80020) ;- (MCI0) MCI Response Register
AT91C_MCI0_WPCR           EQU (0xFFF800E4) ;- (MCI0) MCI Write Protection Control Register
AT91C_MCI0_IDR            EQU (0xFFF80048) ;- (MCI0) MCI Interrupt Disable Register
/* - ========== Register definition for PDC_MCI1 peripheral ========== */
AT91C_MCI1_PTCR           EQU (0xFFF84120) ;- (PDC_MCI1) PDC Transfer Control Register
AT91C_MCI1_PTSR           EQU (0xFFF84124) ;- (PDC_MCI1) PDC Transfer Status Register
AT91C_MCI1_TPR            EQU (0xFFF84108) ;- (PDC_MCI1) Transmit Pointer Register
AT91C_MCI1_RPR            EQU (0xFFF84100) ;- (PDC_MCI1) Receive Pointer Register
AT91C_MCI1_TNCR           EQU (0xFFF8411C) ;- (PDC_MCI1) Transmit Next Counter Register
AT91C_MCI1_RCR            EQU (0xFFF84104) ;- (PDC_MCI1) Receive Counter Register
AT91C_MCI1_TNPR           EQU (0xFFF84118) ;- (PDC_MCI1) Transmit Next Pointer Register
AT91C_MCI1_TCR            EQU (0xFFF8410C) ;- (PDC_MCI1) Transmit Counter Register
AT91C_MCI1_RNPR           EQU (0xFFF84110) ;- (PDC_MCI1) Receive Next Pointer Register
AT91C_MCI1_RNCR           EQU (0xFFF84114) ;- (PDC_MCI1) Receive Next Counter Register
/* - ========== Register definition for MCI1 peripheral ========== */
AT91C_MCI1_RDR            EQU (0xFFF84030) ;- (MCI1) MCI Receive Data Register
AT91C_MCI1_DTOR           EQU (0xFFF84008) ;- (MCI1) MCI Data Timeout Register
AT91C_MCI1_FIFO           EQU (0xFFF84200) ;- (MCI1) MCI FIFO Aperture Register
AT91C_MCI1_WPCR           EQU (0xFFF840E4) ;- (MCI1) MCI Write Protection Control Register
AT91C_MCI1_DMA            EQU (0xFFF84050) ;- (MCI1) MCI DMA Configuration Register
AT91C_MCI1_IDR            EQU (0xFFF84048) ;- (MCI1) MCI Interrupt Disable Register
AT91C_MCI1_ARGR           EQU (0xFFF84010) ;- (MCI1) MCI Argument Register
AT91C_MCI1_TDR            EQU (0xFFF84034) ;- (MCI1) MCI Transmit Data Register
AT91C_MCI1_CR             EQU (0xFFF84000) ;- (MCI1) MCI Control Register
AT91C_MCI1_MR             EQU (0xFFF84004) ;- (MCI1) MCI Mode Register
AT91C_MCI1_CSTOR          EQU (0xFFF8401C) ;- (MCI1) MCI Completion Signal Timeout Register
AT91C_MCI1_RSPR           EQU (0xFFF84020) ;- (MCI1) MCI Response Register
AT91C_MCI1_SR             EQU (0xFFF84040) ;- (MCI1) MCI Status Register
AT91C_MCI1_CFG            EQU (0xFFF84054) ;- (MCI1) MCI Configuration Register
AT91C_MCI1_CMDR           EQU (0xFFF84014) ;- (MCI1) MCI Command Register
AT91C_MCI1_IMR            EQU (0xFFF8404C) ;- (MCI1) MCI Interrupt Mask Register
AT91C_MCI1_WPSR           EQU (0xFFF840E8) ;- (MCI1) MCI Write Protection Status Register
AT91C_MCI1_SDCR           EQU (0xFFF8400C) ;- (MCI1) MCI SD/SDIO Card Register
AT91C_MCI1_BLKR           EQU (0xFFF84018) ;- (MCI1) MCI Block Register
AT91C_MCI1_VR             EQU (0xFFF840FC) ;- (MCI1) MCI Version Register
AT91C_MCI1_IER            EQU (0xFFF84044) ;- (MCI1) MCI Interrupt Enable Register
/* - ========== Register definition for PDC_TWI peripheral ========== */
AT91C_TWI_PTSR            EQU (0xFFF88124) ;- (PDC_TWI) PDC Transfer Status Register
AT91C_TWI_RNCR            EQU (0xFFF88114) ;- (PDC_TWI) Receive Next Counter Register
AT91C_TWI_RCR             EQU (0xFFF88104) ;- (PDC_TWI) Receive Counter Register
AT91C_TWI_RNPR            EQU (0xFFF88110) ;- (PDC_TWI) Receive Next Pointer Register
AT91C_TWI_TCR             EQU (0xFFF8810C) ;- (PDC_TWI) Transmit Counter Register
AT91C_TWI_RPR             EQU (0xFFF88100) ;- (PDC_TWI) Receive Pointer Register
AT91C_TWI_PTCR            EQU (0xFFF88120) ;- (PDC_TWI) PDC Transfer Control Register
AT91C_TWI_TPR             EQU (0xFFF88108) ;- (PDC_TWI) Transmit Pointer Register
AT91C_TWI_TNPR            EQU (0xFFF88118) ;- (PDC_TWI) Transmit Next Pointer Register
AT91C_TWI_TNCR            EQU (0xFFF8811C) ;- (PDC_TWI) Transmit Next Counter Register
/* - ========== Register definition for TWI peripheral ========== */
AT91C_TWI_IDR             EQU (0xFFF88028) ;- (TWI) Interrupt Disable Register
AT91C_TWI_RHR             EQU (0xFFF88030) ;- (TWI) Receive Holding Register
AT91C_TWI_IMR             EQU (0xFFF8802C) ;- (TWI) Interrupt Mask Register
AT91C_TWI_THR             EQU (0xFFF88034) ;- (TWI) Transmit Holding Register
AT91C_TWI_IER             EQU (0xFFF88024) ;- (TWI) Interrupt Enable Register
AT91C_TWI_IADR            EQU (0xFFF8800C) ;- (TWI) Internal Address Register
AT91C_TWI_MMR             EQU (0xFFF88004) ;- (TWI) Master Mode Register
AT91C_TWI_CR              EQU (0xFFF88000) ;- (TWI) Control Register
AT91C_TWI_SR              EQU (0xFFF88020) ;- (TWI) Status Register
AT91C_TWI_CWGR            EQU (0xFFF88010) ;- (TWI) Clock Waveform Generator Register
/* - ========== Register definition for PDC_US0 peripheral ========== */
AT91C_US0_TNPR            EQU (0xFFF8C118) ;- (PDC_US0) Transmit Next Pointer Register
AT91C_US0_PTSR            EQU (0xFFF8C124) ;- (PDC_US0) PDC Transfer Status Register
AT91C_US0_PTCR            EQU (0xFFF8C120) ;- (PDC_US0) PDC Transfer Control Register
AT91C_US0_RNCR            EQU (0xFFF8C114) ;- (PDC_US0) Receive Next Counter Register
AT91C_US0_RCR             EQU (0xFFF8C104) ;- (PDC_US0) Receive Counter Register
AT91C_US0_TNCR            EQU (0xFFF8C11C) ;- (PDC_US0) Transmit Next Counter Register
AT91C_US0_TCR             EQU (0xFFF8C10C) ;- (PDC_US0) Transmit Counter Register
AT91C_US0_RNPR            EQU (0xFFF8C110) ;- (PDC_US0) Receive Next Pointer Register
AT91C_US0_RPR             EQU (0xFFF8C100) ;- (PDC_US0) Receive Pointer Register
AT91C_US0_TPR             EQU (0xFFF8C108) ;- (PDC_US0) Transmit Pointer Register
/* - ========== Register definition for US0 peripheral ========== */
AT91C_US0_RTOR            EQU (0xFFF8C024) ;- (US0) Receiver Time-out Register
AT91C_US0_MAN             EQU (0xFFF8C050) ;- (US0) Manchester Encoder Decoder Register
AT91C_US0_NER             EQU (0xFFF8C044) ;- (US0) Nb Errors Register
AT91C_US0_THR             EQU (0xFFF8C01C) ;- (US0) Transmitter Holding Register
AT91C_US0_MR              EQU (0xFFF8C004) ;- (US0) Mode Register
AT91C_US0_RHR             EQU (0xFFF8C018) ;- (US0) Receiver Holding Register
AT91C_US0_CSR             EQU (0xFFF8C014) ;- (US0) Channel Status Register
AT91C_US0_IMR             EQU (0xFFF8C010) ;- (US0) Interrupt Mask Register
AT91C_US0_IDR             EQU (0xFFF8C00C) ;- (US0) Interrupt Disable Register
AT91C_US0_FIDI            EQU (0xFFF8C040) ;- (US0) FI_DI_Ratio Register
AT91C_US0_CR              EQU (0xFFF8C000) ;- (US0) Control Register
AT91C_US0_IER             EQU (0xFFF8C008) ;- (US0) Interrupt Enable Register
AT91C_US0_TTGR            EQU (0xFFF8C028) ;- (US0) Transmitter Time-guard Register
AT91C_US0_BRGR            EQU (0xFFF8C020) ;- (US0) Baud Rate Generator Register
AT91C_US0_IF              EQU (0xFFF8C04C) ;- (US0) IRDA_FILTER Register
/* - ========== Register definition for PDC_US1 peripheral ========== */
AT91C_US1_PTCR            EQU (0xFFF90120) ;- (PDC_US1) PDC Transfer Control Register
AT91C_US1_TNCR            EQU (0xFFF9011C) ;- (PDC_US1) Transmit Next Counter Register
AT91C_US1_RCR             EQU (0xFFF90104) ;- (PDC_US1) Receive Counter Register
AT91C_US1_RPR             EQU (0xFFF90100) ;- (PDC_US1) Receive Pointer Register
AT91C_US1_TPR             EQU (0xFFF90108) ;- (PDC_US1) Transmit Pointer Register
AT91C_US1_TCR             EQU (0xFFF9010C) ;- (PDC_US1) Transmit Counter Register
AT91C_US1_RNPR            EQU (0xFFF90110) ;- (PDC_US1) Receive Next Pointer Register
AT91C_US1_TNPR            EQU (0xFFF90118) ;- (PDC_US1) Transmit Next Pointer Register
AT91C_US1_RNCR            EQU (0xFFF90114) ;- (PDC_US1) Receive Next Counter Register
AT91C_US1_PTSR            EQU (0xFFF90124) ;- (PDC_US1) PDC Transfer Status Register
/* - ========== Register definition for US1 peripheral ========== */
AT91C_US1_NER             EQU (0xFFF90044) ;- (US1) Nb Errors Register
AT91C_US1_RHR             EQU (0xFFF90018) ;- (US1) Receiver Holding Register
AT91C_US1_RTOR            EQU (0xFFF90024) ;- (US1) Receiver Time-out Register
AT91C_US1_IER             EQU (0xFFF90008) ;- (US1) Interrupt Enable Register
AT91C_US1_IF              EQU (0xFFF9004C) ;- (US1) IRDA_FILTER Register
AT91C_US1_MAN             EQU (0xFFF90050) ;- (US1) Manchester Encoder Decoder Register
AT91C_US1_CR              EQU (0xFFF90000) ;- (US1) Control Register
AT91C_US1_IMR             EQU (0xFFF90010) ;- (US1) Interrupt Mask Register
AT91C_US1_TTGR            EQU (0xFFF90028) ;- (US1) Transmitter Time-guard Register
AT91C_US1_MR              EQU (0xFFF90004) ;- (US1) Mode Register
AT91C_US1_IDR             EQU (0xFFF9000C) ;- (US1) Interrupt Disable Register
AT91C_US1_FIDI            EQU (0xFFF90040) ;- (US1) FI_DI_Ratio Register
AT91C_US1_CSR             EQU (0xFFF90014) ;- (US1) Channel Status Register
AT91C_US1_THR             EQU (0xFFF9001C) ;- (US1) Transmitter Holding Register
AT91C_US1_BRGR            EQU (0xFFF90020) ;- (US1) Baud Rate Generator Register
/* - ========== Register definition for PDC_US2 peripheral ========== */
AT91C_US2_RNCR            EQU (0xFFF94114) ;- (PDC_US2) Receive Next Counter Register
AT91C_US2_PTCR            EQU (0xFFF94120) ;- (PDC_US2) PDC Transfer Control Register
AT91C_US2_TNPR            EQU (0xFFF94118) ;- (PDC_US2) Transmit Next Pointer Register
AT91C_US2_TNCR            EQU (0xFFF9411C) ;- (PDC_US2) Transmit Next Counter Register
AT91C_US2_TPR             EQU (0xFFF94108) ;- (PDC_US2) Transmit Pointer Register
AT91C_US2_RCR             EQU (0xFFF94104) ;- (PDC_US2) Receive Counter Register
AT91C_US2_PTSR            EQU (0xFFF94124) ;- (PDC_US2) PDC Transfer Status Register
AT91C_US2_TCR             EQU (0xFFF9410C) ;- (PDC_US2) Transmit Counter Register
AT91C_US2_RPR             EQU (0xFFF94100) ;- (PDC_US2) Receive Pointer Register
AT91C_US2_RNPR            EQU (0xFFF94110) ;- (PDC_US2) Receive Next Pointer Register
/* - ========== Register definition for US2 peripheral ========== */
AT91C_US2_TTGR            EQU (0xFFF94028) ;- (US2) Transmitter Time-guard Register
AT91C_US2_RHR             EQU (0xFFF94018) ;- (US2) Receiver Holding Register
AT91C_US2_IMR             EQU (0xFFF94010) ;- (US2) Interrupt Mask Register
AT91C_US2_IER             EQU (0xFFF94008) ;- (US2) Interrupt Enable Register
AT91C_US2_NER             EQU (0xFFF94044) ;- (US2) Nb Errors Register
AT91C_US2_CR              EQU (0xFFF94000) ;- (US2) Control Register
AT91C_US2_FIDI            EQU (0xFFF94040) ;- (US2) FI_DI_Ratio Register
AT91C_US2_MR              EQU (0xFFF94004) ;- (US2) Mode Register
AT91C_US2_MAN             EQU (0xFFF94050) ;- (US2) Manchester Encoder Decoder Register
AT91C_US2_IDR             EQU (0xFFF9400C) ;- (US2) Interrupt Disable Register
AT91C_US2_THR             EQU (0xFFF9401C) ;- (US2) Transmitter Holding Register
AT91C_US2_IF              EQU (0xFFF9404C) ;- (US2) IRDA_FILTER Register
AT91C_US2_BRGR            EQU (0xFFF94020) ;- (US2) Baud Rate Generator Register
AT91C_US2_CSR             EQU (0xFFF94014) ;- (US2) Channel Status Register
AT91C_US2_RTOR            EQU (0xFFF94024) ;- (US2) Receiver Time-out Register
/* - ========== Register definition for PDC_SSC0 peripheral ========== */
AT91C_SSC0_PTSR           EQU (0xFFF98124) ;- (PDC_SSC0) PDC Transfer Status Register
AT91C_SSC0_TCR            EQU (0xFFF9810C) ;- (PDC_SSC0) Transmit Counter Register
AT91C_SSC0_RNPR           EQU (0xFFF98110) ;- (PDC_SSC0) Receive Next Pointer Register
AT91C_SSC0_RNCR           EQU (0xFFF98114) ;- (PDC_SSC0) Receive Next Counter Register
AT91C_SSC0_TNPR           EQU (0xFFF98118) ;- (PDC_SSC0) Transmit Next Pointer Register
AT91C_SSC0_RPR            EQU (0xFFF98100) ;- (PDC_SSC0) Receive Pointer Register
AT91C_SSC0_TPR            EQU (0xFFF98108) ;- (PDC_SSC0) Transmit Pointer Register
AT91C_SSC0_RCR            EQU (0xFFF98104) ;- (PDC_SSC0) Receive Counter Register
AT91C_SSC0_TNCR           EQU (0xFFF9811C) ;- (PDC_SSC0) Transmit Next Counter Register
AT91C_SSC0_PTCR           EQU (0xFFF98120) ;- (PDC_SSC0) PDC Transfer Control Register
/* - ========== Register definition for SSC0 peripheral ========== */
AT91C_SSC0_RFMR           EQU (0xFFF98014) ;- (SSC0) Receive Frame Mode Register
AT91C_SSC0_RHR            EQU (0xFFF98020) ;- (SSC0) Receive Holding Register
AT91C_SSC0_THR            EQU (0xFFF98024) ;- (SSC0) Transmit Holding Register
AT91C_SSC0_CMR            EQU (0xFFF98004) ;- (SSC0) Clock Mode Register
AT91C_SSC0_IMR            EQU (0xFFF9804C) ;- (SSC0) Interrupt Mask Register
AT91C_SSC0_IDR            EQU (0xFFF98048) ;- (SSC0) Interrupt Disable Register
AT91C_SSC0_IER            EQU (0xFFF98044) ;- (SSC0) Interrupt Enable Register
AT91C_SSC0_TSHR           EQU (0xFFF98034) ;- (SSC0) Transmit Sync Holding Register
AT91C_SSC0_SR             EQU (0xFFF98040) ;- (SSC0) Status Register
AT91C_SSC0_CR             EQU (0xFFF98000) ;- (SSC0) Control Register
AT91C_SSC0_RCMR           EQU (0xFFF98010) ;- (SSC0) Receive Clock ModeRegister
AT91C_SSC0_TFMR           EQU (0xFFF9801C) ;- (SSC0) Transmit Frame Mode Register
AT91C_SSC0_RSHR           EQU (0xFFF98030) ;- (SSC0) Receive Sync Holding Register
AT91C_SSC0_TCMR           EQU (0xFFF98018) ;- (SSC0) Transmit Clock Mode Register
/* - ========== Register definition for PDC_SSC1 peripheral ========== */
AT91C_SSC1_TNPR           EQU (0xFFF9C118) ;- (PDC_SSC1) Transmit Next Pointer Register
AT91C_SSC1_PTSR           EQU (0xFFF9C124) ;- (PDC_SSC1) PDC Transfer Status Register
AT91C_SSC1_TNCR           EQU (0xFFF9C11C) ;- (PDC_SSC1) Transmit Next Counter Register
AT91C_SSC1_RNCR           EQU (0xFFF9C114) ;- (PDC_SSC1) Receive Next Counter Register
AT91C_SSC1_TPR            EQU (0xFFF9C108) ;- (PDC_SSC1) Transmit Pointer Register
AT91C_SSC1_RCR            EQU (0xFFF9C104) ;- (PDC_SSC1) Receive Counter Register
AT91C_SSC1_PTCR           EQU (0xFFF9C120) ;- (PDC_SSC1) PDC Transfer Control Register
AT91C_SSC1_RNPR           EQU (0xFFF9C110) ;- (PDC_SSC1) Receive Next Pointer Register
AT91C_SSC1_TCR            EQU (0xFFF9C10C) ;- (PDC_SSC1) Transmit Counter Register
AT91C_SSC1_RPR            EQU (0xFFF9C100) ;- (PDC_SSC1) Receive Pointer Register
/* - ========== Register definition for SSC1 peripheral ========== */
AT91C_SSC1_CMR            EQU (0xFFF9C004) ;- (SSC1) Clock Mode Register
AT91C_SSC1_SR             EQU (0xFFF9C040) ;- (SSC1) Status Register
AT91C_SSC1_TSHR           EQU (0xFFF9C034) ;- (SSC1) Transmit Sync Holding Register
AT91C_SSC1_TCMR           EQU (0xFFF9C018) ;- (SSC1) Transmit Clock Mode Register
AT91C_SSC1_IMR            EQU (0xFFF9C04C) ;- (SSC1) Interrupt Mask Register
AT91C_SSC1_IDR            EQU (0xFFF9C048) ;- (SSC1) Interrupt Disable Register
AT91C_SSC1_RCMR           EQU (0xFFF9C010) ;- (SSC1) Receive Clock ModeRegister
AT91C_SSC1_IER            EQU (0xFFF9C044) ;- (SSC1) Interrupt Enable Register
AT91C_SSC1_RSHR           EQU (0xFFF9C030) ;- (SSC1) Receive Sync Holding Register
AT91C_SSC1_CR             EQU (0xFFF9C000) ;- (SSC1) Control Register
AT91C_SSC1_RHR            EQU (0xFFF9C020) ;- (SSC1) Receive Holding Register
AT91C_SSC1_THR            EQU (0xFFF9C024) ;- (SSC1) Transmit Holding Register
AT91C_SSC1_RFMR           EQU (0xFFF9C014) ;- (SSC1) Receive Frame Mode Register
AT91C_SSC1_TFMR           EQU (0xFFF9C01C) ;- (SSC1) Transmit Frame Mode Register
/* - ========== Register definition for PDC_AC97C peripheral ========== */
AT91C_AC97C_RNPR          EQU (0xFFFA0110) ;- (PDC_AC97C) Receive Next Pointer Register
AT91C_AC97C_TCR           EQU (0xFFFA010C) ;- (PDC_AC97C) Transmit Counter Register
AT91C_AC97C_TNCR          EQU (0xFFFA011C) ;- (PDC_AC97C) Transmit Next Counter Register
AT91C_AC97C_RCR           EQU (0xFFFA0104) ;- (PDC_AC97C) Receive Counter Register
AT91C_AC97C_RNCR          EQU (0xFFFA0114) ;- (PDC_AC97C) Receive Next Counter Register
AT91C_AC97C_PTCR          EQU (0xFFFA0120) ;- (PDC_AC97C) PDC Transfer Control Register
AT91C_AC97C_TPR           EQU (0xFFFA0108) ;- (PDC_AC97C) Transmit Pointer Register
AT91C_AC97C_RPR           EQU (0xFFFA0100) ;- (PDC_AC97C) Receive Pointer Register
AT91C_AC97C_PTSR          EQU (0xFFFA0124) ;- (PDC_AC97C) PDC Transfer Status Register
AT91C_AC97C_TNPR          EQU (0xFFFA0118) ;- (PDC_AC97C) Transmit Next Pointer Register
/* - ========== Register definition for AC97C peripheral ========== */
AT91C_AC97C_CORHR         EQU (0xFFFA0040) ;- (AC97C) COdec Transmit Holding Register
AT91C_AC97C_MR            EQU (0xFFFA0008) ;- (AC97C) Mode Register
AT91C_AC97C_CATHR         EQU (0xFFFA0024) ;- (AC97C) Channel A Transmit Holding Register
AT91C_AC97C_IER           EQU (0xFFFA0054) ;- (AC97C) Interrupt Enable Register
AT91C_AC97C_CASR          EQU (0xFFFA0028) ;- (AC97C) Channel A Status Register
AT91C_AC97C_CBTHR         EQU (0xFFFA0034) ;- (AC97C) Channel B Transmit Holding Register (optional)
AT91C_AC97C_ICA           EQU (0xFFFA0010) ;- (AC97C) Input Channel AssignementRegister
AT91C_AC97C_IMR           EQU (0xFFFA005C) ;- (AC97C) Interrupt Mask Register
AT91C_AC97C_IDR           EQU (0xFFFA0058) ;- (AC97C) Interrupt Disable Register
AT91C_AC97C_CARHR         EQU (0xFFFA0020) ;- (AC97C) Channel A Receive Holding Register
AT91C_AC97C_VERSION       EQU (0xFFFA00FC) ;- (AC97C) Version Register
AT91C_AC97C_CBRHR         EQU (0xFFFA0030) ;- (AC97C) Channel B Receive Holding Register (optional)
AT91C_AC97C_COTHR         EQU (0xFFFA0044) ;- (AC97C) COdec Transmit Holding Register
AT91C_AC97C_OCA           EQU (0xFFFA0014) ;- (AC97C) Output Channel Assignement Register
AT91C_AC97C_CBMR          EQU (0xFFFA003C) ;- (AC97C) Channel B Mode Register
AT91C_AC97C_COMR          EQU (0xFFFA004C) ;- (AC97C) CODEC Mask Status Register
AT91C_AC97C_CBSR          EQU (0xFFFA0038) ;- (AC97C) Channel B Status Register
AT91C_AC97C_COSR          EQU (0xFFFA0048) ;- (AC97C) CODEC Status Register
AT91C_AC97C_CAMR          EQU (0xFFFA002C) ;- (AC97C) Channel A Mode Register
AT91C_AC97C_SR            EQU (0xFFFA0050) ;- (AC97C) Status Register
/* - ========== Register definition for PDC_SPI0 peripheral ========== */
AT91C_SPI0_TPR            EQU (0xFFFA4108) ;- (PDC_SPI0) Transmit Pointer Register
AT91C_SPI0_PTCR           EQU (0xFFFA4120) ;- (PDC_SPI0) PDC Transfer Control Register
AT91C_SPI0_RNPR           EQU (0xFFFA4110) ;- (PDC_SPI0) Receive Next Pointer Register
AT91C_SPI0_TNCR           EQU (0xFFFA411C) ;- (PDC_SPI0) Transmit Next Counter Register
AT91C_SPI0_TCR            EQU (0xFFFA410C) ;- (PDC_SPI0) Transmit Counter Register
AT91C_SPI0_RCR            EQU (0xFFFA4104) ;- (PDC_SPI0) Receive Counter Register
AT91C_SPI0_RNCR           EQU (0xFFFA4114) ;- (PDC_SPI0) Receive Next Counter Register
AT91C_SPI0_TNPR           EQU (0xFFFA4118) ;- (PDC_SPI0) Transmit Next Pointer Register
AT91C_SPI0_RPR            EQU (0xFFFA4100) ;- (PDC_SPI0) Receive Pointer Register
AT91C_SPI0_PTSR           EQU (0xFFFA4124) ;- (PDC_SPI0) PDC Transfer Status Register
/* - ========== Register definition for SPI0 peripheral ========== */
AT91C_SPI0_MR             EQU (0xFFFA4004) ;- (SPI0) Mode Register
AT91C_SPI0_RDR            EQU (0xFFFA4008) ;- (SPI0) Receive Data Register
AT91C_SPI0_CR             EQU (0xFFFA4000) ;- (SPI0) Control Register
AT91C_SPI0_IER            EQU (0xFFFA4014) ;- (SPI0) Interrupt Enable Register
AT91C_SPI0_TDR            EQU (0xFFFA400C) ;- (SPI0) Transmit Data Register
AT91C_SPI0_IDR            EQU (0xFFFA4018) ;- (SPI0) Interrupt Disable Register
AT91C_SPI0_CSR            EQU (0xFFFA4030) ;- (SPI0) Chip Select Register
AT91C_SPI0_SR             EQU (0xFFFA4010) ;- (SPI0) Status Register
AT91C_SPI0_IMR            EQU (0xFFFA401C) ;- (SPI0) Interrupt Mask Register
/* - ========== Register definition for PDC_SPI1 peripheral ========== */
AT91C_SPI1_RNCR           EQU (0xFFFA8114) ;- (PDC_SPI1) Receive Next Counter Register
AT91C_SPI1_TCR            EQU (0xFFFA810C) ;- (PDC_SPI1) Transmit Counter Register
AT91C_SPI1_RCR            EQU (0xFFFA8104) ;- (PDC_SPI1) Receive Counter Register
AT91C_SPI1_TNPR           EQU (0xFFFA8118) ;- (PDC_SPI1) Transmit Next Pointer Register
AT91C_SPI1_RNPR           EQU (0xFFFA8110) ;- (PDC_SPI1) Receive Next Pointer Register
AT91C_SPI1_RPR            EQU (0xFFFA8100) ;- (PDC_SPI1) Receive Pointer Register
AT91C_SPI1_TNCR           EQU (0xFFFA811C) ;- (PDC_SPI1) Transmit Next Counter Register
AT91C_SPI1_TPR            EQU (0xFFFA8108) ;- (PDC_SPI1) Transmit Pointer Register
AT91C_SPI1_PTSR           EQU (0xFFFA8124) ;- (PDC_SPI1) PDC Transfer Status Register
AT91C_SPI1_PTCR           EQU (0xFFFA8120) ;- (PDC_SPI1) PDC Transfer Control Register
/* - ========== Register definition for SPI1 peripheral ========== */
AT91C_SPI1_CSR            EQU (0xFFFA8030) ;- (SPI1) Chip Select Register
AT91C_SPI1_IER            EQU (0xFFFA8014) ;- (SPI1) Interrupt Enable Register
AT91C_SPI1_RDR            EQU (0xFFFA8008) ;- (SPI1) Receive Data Register
AT91C_SPI1_IDR            EQU (0xFFFA8018) ;- (SPI1) Interrupt Disable Register
AT91C_SPI1_MR             EQU (0xFFFA8004) ;- (SPI1) Mode Register
AT91C_SPI1_CR             EQU (0xFFFA8000) ;- (SPI1) Control Register
AT91C_SPI1_SR             EQU (0xFFFA8010) ;- (SPI1) Status Register
AT91C_SPI1_TDR            EQU (0xFFFA800C) ;- (SPI1) Transmit Data Register
AT91C_SPI1_IMR            EQU (0xFFFA801C) ;- (SPI1) Interrupt Mask Register
/* - ========== Register definition for CAN_MB0 peripheral ========== */
AT91C_CAN_MB0_MID         EQU (0xFFFAC208) ;- (CAN_MB0) MailBox ID Register
AT91C_CAN_MB0_MFID        EQU (0xFFFAC20C) ;- (CAN_MB0) MailBox Family ID Register
AT91C_CAN_MB0_MAM         EQU (0xFFFAC204) ;- (CAN_MB0) MailBox Acceptance Mask Register
AT91C_CAN_MB0_MCR         EQU (0xFFFAC21C) ;- (CAN_MB0) MailBox Control Register
AT91C_CAN_MB0_MMR         EQU (0xFFFAC200) ;- (CAN_MB0) MailBox Mode Register
AT91C_CAN_MB0_MDL         EQU (0xFFFAC214) ;- (CAN_MB0) MailBox Data Low Register
AT91C_CAN_MB0_MDH         EQU (0xFFFAC218) ;- (CAN_MB0) MailBox Data High Register
AT91C_CAN_MB0_MSR         EQU (0xFFFAC210) ;- (CAN_MB0) MailBox Status Register
/* - ========== Register definition for CAN_MB1 peripheral ========== */
AT91C_CAN_MB1_MDL         EQU (0xFFFAC234) ;- (CAN_MB1) MailBox Data Low Register
AT91C_CAN_MB1_MAM         EQU (0xFFFAC224) ;- (CAN_MB1) MailBox Acceptance Mask Register
AT91C_CAN_MB1_MID         EQU (0xFFFAC228) ;- (CAN_MB1) MailBox ID Register
