una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91cap9.h
AT91C_CAN_MB1_MMR         EQU (0xFFFAC220) ;- (CAN_MB1) MailBox Mode Register
AT91C_CAN_MB1_MCR         EQU (0xFFFAC23C) ;- (CAN_MB1) MailBox Control Register
AT91C_CAN_MB1_MFID        EQU (0xFFFAC22C) ;- (CAN_MB1) MailBox Family ID Register
AT91C_CAN_MB1_MSR         EQU (0xFFFAC230) ;- (CAN_MB1) MailBox Status Register
AT91C_CAN_MB1_MDH         EQU (0xFFFAC238) ;- (CAN_MB1) MailBox Data High Register
/* - ========== Register definition for CAN_MB2 peripheral ========== */
AT91C_CAN_MB2_MID         EQU (0xFFFAC248) ;- (CAN_MB2) MailBox ID Register
AT91C_CAN_MB2_MSR         EQU (0xFFFAC250) ;- (CAN_MB2) MailBox Status Register
AT91C_CAN_MB2_MDL         EQU (0xFFFAC254) ;- (CAN_MB2) MailBox Data Low Register
AT91C_CAN_MB2_MCR         EQU (0xFFFAC25C) ;- (CAN_MB2) MailBox Control Register
AT91C_CAN_MB2_MDH         EQU (0xFFFAC258) ;- (CAN_MB2) MailBox Data High Register
AT91C_CAN_MB2_MAM         EQU (0xFFFAC244) ;- (CAN_MB2) MailBox Acceptance Mask Register
AT91C_CAN_MB2_MMR         EQU (0xFFFAC240) ;- (CAN_MB2) MailBox Mode Register
AT91C_CAN_MB2_MFID        EQU (0xFFFAC24C) ;- (CAN_MB2) MailBox Family ID Register
/* - ========== Register definition for CAN_MB3 peripheral ========== */
AT91C_CAN_MB3_MDL         EQU (0xFFFAC274) ;- (CAN_MB3) MailBox Data Low Register
AT91C_CAN_MB3_MFID        EQU (0xFFFAC26C) ;- (CAN_MB3) MailBox Family ID Register
AT91C_CAN_MB3_MID         EQU (0xFFFAC268) ;- (CAN_MB3) MailBox ID Register
AT91C_CAN_MB3_MDH         EQU (0xFFFAC278) ;- (CAN_MB3) MailBox Data High Register
AT91C_CAN_MB3_MAM         EQU (0xFFFAC264) ;- (CAN_MB3) MailBox Acceptance Mask Register
AT91C_CAN_MB3_MMR         EQU (0xFFFAC260) ;- (CAN_MB3) MailBox Mode Register
AT91C_CAN_MB3_MCR         EQU (0xFFFAC27C) ;- (CAN_MB3) MailBox Control Register
AT91C_CAN_MB3_MSR         EQU (0xFFFAC270) ;- (CAN_MB3) MailBox Status Register
/* - ========== Register definition for CAN_MB4 peripheral ========== */
AT91C_CAN_MB4_MCR         EQU (0xFFFAC29C) ;- (CAN_MB4) MailBox Control Register
AT91C_CAN_MB4_MDH         EQU (0xFFFAC298) ;- (CAN_MB4) MailBox Data High Register
AT91C_CAN_MB4_MID         EQU (0xFFFAC288) ;- (CAN_MB4) MailBox ID Register
AT91C_CAN_MB4_MMR         EQU (0xFFFAC280) ;- (CAN_MB4) MailBox Mode Register
AT91C_CAN_MB4_MSR         EQU (0xFFFAC290) ;- (CAN_MB4) MailBox Status Register
AT91C_CAN_MB4_MFID        EQU (0xFFFAC28C) ;- (CAN_MB4) MailBox Family ID Register
AT91C_CAN_MB4_MAM         EQU (0xFFFAC284) ;- (CAN_MB4) MailBox Acceptance Mask Register
AT91C_CAN_MB4_MDL         EQU (0xFFFAC294) ;- (CAN_MB4) MailBox Data Low Register
/* - ========== Register definition for CAN_MB5 peripheral ========== */
AT91C_CAN_MB5_MDH         EQU (0xFFFAC2B8) ;- (CAN_MB5) MailBox Data High Register
AT91C_CAN_MB5_MID         EQU (0xFFFAC2A8) ;- (CAN_MB5) MailBox ID Register
AT91C_CAN_MB5_MCR         EQU (0xFFFAC2BC) ;- (CAN_MB5) MailBox Control Register
AT91C_CAN_MB5_MSR         EQU (0xFFFAC2B0) ;- (CAN_MB5) MailBox Status Register
AT91C_CAN_MB5_MDL         EQU (0xFFFAC2B4) ;- (CAN_MB5) MailBox Data Low Register
AT91C_CAN_MB5_MMR         EQU (0xFFFAC2A0) ;- (CAN_MB5) MailBox Mode Register
AT91C_CAN_MB5_MAM         EQU (0xFFFAC2A4) ;- (CAN_MB5) MailBox Acceptance Mask Register
AT91C_CAN_MB5_MFID        EQU (0xFFFAC2AC) ;- (CAN_MB5) MailBox Family ID Register
/* - ========== Register definition for CAN_MB6 peripheral ========== */
AT91C_CAN_MB6_MSR         EQU (0xFFFAC2D0) ;- (CAN_MB6) MailBox Status Register
AT91C_CAN_MB6_MMR         EQU (0xFFFAC2C0) ;- (CAN_MB6) MailBox Mode Register
AT91C_CAN_MB6_MFID        EQU (0xFFFAC2CC) ;- (CAN_MB6) MailBox Family ID Register
AT91C_CAN_MB6_MDL         EQU (0xFFFAC2D4) ;- (CAN_MB6) MailBox Data Low Register
AT91C_CAN_MB6_MID         EQU (0xFFFAC2C8) ;- (CAN_MB6) MailBox ID Register
AT91C_CAN_MB6_MCR         EQU (0xFFFAC2DC) ;- (CAN_MB6) MailBox Control Register
AT91C_CAN_MB6_MAM         EQU (0xFFFAC2C4) ;- (CAN_MB6) MailBox Acceptance Mask Register
AT91C_CAN_MB6_MDH         EQU (0xFFFAC2D8) ;- (CAN_MB6) MailBox Data High Register
/* - ========== Register definition for CAN_MB7 peripheral ========== */
AT91C_CAN_MB7_MAM         EQU (0xFFFAC2E4) ;- (CAN_MB7) MailBox Acceptance Mask Register
AT91C_CAN_MB7_MDH         EQU (0xFFFAC2F8) ;- (CAN_MB7) MailBox Data High Register
AT91C_CAN_MB7_MID         EQU (0xFFFAC2E8) ;- (CAN_MB7) MailBox ID Register
AT91C_CAN_MB7_MSR         EQU (0xFFFAC2F0) ;- (CAN_MB7) MailBox Status Register
AT91C_CAN_MB7_MMR         EQU (0xFFFAC2E0) ;- (CAN_MB7) MailBox Mode Register
AT91C_CAN_MB7_MCR         EQU (0xFFFAC2FC) ;- (CAN_MB7) MailBox Control Register
AT91C_CAN_MB7_MFID        EQU (0xFFFAC2EC) ;- (CAN_MB7) MailBox Family ID Register
AT91C_CAN_MB7_MDL         EQU (0xFFFAC2F4) ;- (CAN_MB7) MailBox Data Low Register
/* - ========== Register definition for CAN_MB8 peripheral ========== */
AT91C_CAN_MB8_MDH         EQU (0xFFFAC318) ;- (CAN_MB8) MailBox Data High Register
AT91C_CAN_MB8_MMR         EQU (0xFFFAC300) ;- (CAN_MB8) MailBox Mode Register
AT91C_CAN_MB8_MCR         EQU (0xFFFAC31C) ;- (CAN_MB8) MailBox Control Register
AT91C_CAN_MB8_MSR         EQU (0xFFFAC310) ;- (CAN_MB8) MailBox Status Register
AT91C_CAN_MB8_MAM         EQU (0xFFFAC304) ;- (CAN_MB8) MailBox Acceptance Mask Register
AT91C_CAN_MB8_MFID        EQU (0xFFFAC30C) ;- (CAN_MB8) MailBox Family ID Register
AT91C_CAN_MB8_MID         EQU (0xFFFAC308) ;- (CAN_MB8) MailBox ID Register
AT91C_CAN_MB8_MDL         EQU (0xFFFAC314) ;- (CAN_MB8) MailBox Data Low Register
/* - ========== Register definition for CAN_MB9 peripheral ========== */
AT91C_CAN_MB9_MID         EQU (0xFFFAC328) ;- (CAN_MB9) MailBox ID Register
AT91C_CAN_MB9_MMR         EQU (0xFFFAC320) ;- (CAN_MB9) MailBox Mode Register
AT91C_CAN_MB9_MDH         EQU (0xFFFAC338) ;- (CAN_MB9) MailBox Data High Register
AT91C_CAN_MB9_MSR         EQU (0xFFFAC330) ;- (CAN_MB9) MailBox Status Register
AT91C_CAN_MB9_MAM         EQU (0xFFFAC324) ;- (CAN_MB9) MailBox Acceptance Mask Register
AT91C_CAN_MB9_MDL         EQU (0xFFFAC334) ;- (CAN_MB9) MailBox Data Low Register
AT91C_CAN_MB9_MFID        EQU (0xFFFAC32C) ;- (CAN_MB9) MailBox Family ID Register
AT91C_CAN_MB9_MCR         EQU (0xFFFAC33C) ;- (CAN_MB9) MailBox Control Register
/* - ========== Register definition for CAN_MB10 peripheral ========== */
AT91C_CAN_MB10_MCR        EQU (0xFFFAC35C) ;- (CAN_MB10) MailBox Control Register
AT91C_CAN_MB10_MDH        EQU (0xFFFAC358) ;- (CAN_MB10) MailBox Data High Register
AT91C_CAN_MB10_MAM        EQU (0xFFFAC344) ;- (CAN_MB10) MailBox Acceptance Mask Register
AT91C_CAN_MB10_MID        EQU (0xFFFAC348) ;- (CAN_MB10) MailBox ID Register
AT91C_CAN_MB10_MDL        EQU (0xFFFAC354) ;- (CAN_MB10) MailBox Data Low Register
AT91C_CAN_MB10_MSR        EQU (0xFFFAC350) ;- (CAN_MB10) MailBox Status Register
AT91C_CAN_MB10_MMR        EQU (0xFFFAC340) ;- (CAN_MB10) MailBox Mode Register
AT91C_CAN_MB10_MFID       EQU (0xFFFAC34C) ;- (CAN_MB10) MailBox Family ID Register
/* - ========== Register definition for CAN_MB11 peripheral ========== */
AT91C_CAN_MB11_MSR        EQU (0xFFFAC370) ;- (CAN_MB11) MailBox Status Register
AT91C_CAN_MB11_MFID       EQU (0xFFFAC36C) ;- (CAN_MB11) MailBox Family ID Register
AT91C_CAN_MB11_MDL        EQU (0xFFFAC374) ;- (CAN_MB11) MailBox Data Low Register
AT91C_CAN_MB11_MDH        EQU (0xFFFAC378) ;- (CAN_MB11) MailBox Data High Register
AT91C_CAN_MB11_MID        EQU (0xFFFAC368) ;- (CAN_MB11) MailBox ID Register
AT91C_CAN_MB11_MCR        EQU (0xFFFAC37C) ;- (CAN_MB11) MailBox Control Register
AT91C_CAN_MB11_MMR        EQU (0xFFFAC360) ;- (CAN_MB11) MailBox Mode Register
AT91C_CAN_MB11_MAM        EQU (0xFFFAC364) ;- (CAN_MB11) MailBox Acceptance Mask Register
/* - ========== Register definition for CAN_MB12 peripheral ========== */
AT91C_CAN_MB12_MAM        EQU (0xFFFAC384) ;- (CAN_MB12) MailBox Acceptance Mask Register
AT91C_CAN_MB12_MDH        EQU (0xFFFAC398) ;- (CAN_MB12) MailBox Data High Register
AT91C_CAN_MB12_MMR        EQU (0xFFFAC380) ;- (CAN_MB12) MailBox Mode Register
AT91C_CAN_MB12_MSR        EQU (0xFFFAC390) ;- (CAN_MB12) MailBox Status Register
AT91C_CAN_MB12_MFID       EQU (0xFFFAC38C) ;- (CAN_MB12) MailBox Family ID Register
AT91C_CAN_MB12_MID        EQU (0xFFFAC388) ;- (CAN_MB12) MailBox ID Register
AT91C_CAN_MB12_MCR        EQU (0xFFFAC39C) ;- (CAN_MB12) MailBox Control Register
AT91C_CAN_MB12_MDL        EQU (0xFFFAC394) ;- (CAN_MB12) MailBox Data Low Register
/* - ========== Register definition for CAN_MB13 peripheral ========== */
AT91C_CAN_MB13_MDH        EQU (0xFFFAC3B8) ;- (CAN_MB13) MailBox Data High Register
AT91C_CAN_MB13_MFID       EQU (0xFFFAC3AC) ;- (CAN_MB13) MailBox Family ID Register
AT91C_CAN_MB13_MSR        EQU (0xFFFAC3B0) ;- (CAN_MB13) MailBox Status Register
AT91C_CAN_MB13_MID        EQU (0xFFFAC3A8) ;- (CAN_MB13) MailBox ID Register
AT91C_CAN_MB13_MAM        EQU (0xFFFAC3A4) ;- (CAN_MB13) MailBox Acceptance Mask Register
AT91C_CAN_MB13_MMR        EQU (0xFFFAC3A0) ;- (CAN_MB13) MailBox Mode Register
AT91C_CAN_MB13_MCR        EQU (0xFFFAC3BC) ;- (CAN_MB13) MailBox Control Register
AT91C_CAN_MB13_MDL        EQU (0xFFFAC3B4) ;- (CAN_MB13) MailBox Data Low Register
/* - ========== Register definition for CAN_MB14 peripheral ========== */
AT91C_CAN_MB14_MDL        EQU (0xFFFAC3D4) ;- (CAN_MB14) MailBox Data Low Register
AT91C_CAN_MB14_MMR        EQU (0xFFFAC3C0) ;- (CAN_MB14) MailBox Mode Register
AT91C_CAN_MB14_MFID       EQU (0xFFFAC3CC) ;- (CAN_MB14) MailBox Family ID Register
AT91C_CAN_MB14_MCR        EQU (0xFFFAC3DC) ;- (CAN_MB14) MailBox Control Register
AT91C_CAN_MB14_MID        EQU (0xFFFAC3C8) ;- (CAN_MB14) MailBox ID Register
AT91C_CAN_MB14_MDH        EQU (0xFFFAC3D8) ;- (CAN_MB14) MailBox Data High Register
AT91C_CAN_MB14_MSR        EQU (0xFFFAC3D0) ;- (CAN_MB14) MailBox Status Register
AT91C_CAN_MB14_MAM        EQU (0xFFFAC3C4) ;- (CAN_MB14) MailBox Acceptance Mask Register
/* - ========== Register definition for CAN_MB15 peripheral ========== */
AT91C_CAN_MB15_MDL        EQU (0xFFFAC3F4) ;- (CAN_MB15) MailBox Data Low Register
AT91C_CAN_MB15_MSR        EQU (0xFFFAC3F0) ;- (CAN_MB15) MailBox Status Register
AT91C_CAN_MB15_MID        EQU (0xFFFAC3E8) ;- (CAN_MB15) MailBox ID Register
AT91C_CAN_MB15_MAM        EQU (0xFFFAC3E4) ;- (CAN_MB15) MailBox Acceptance Mask Register
AT91C_CAN_MB15_MCR        EQU (0xFFFAC3FC) ;- (CAN_MB15) MailBox Control Register
AT91C_CAN_MB15_MFID       EQU (0xFFFAC3EC) ;- (CAN_MB15) MailBox Family ID Register
AT91C_CAN_MB15_MMR        EQU (0xFFFAC3E0) ;- (CAN_MB15) MailBox Mode Register
AT91C_CAN_MB15_MDH        EQU (0xFFFAC3F8) ;- (CAN_MB15) MailBox Data High Register
/* - ========== Register definition for CAN peripheral ========== */
AT91C_CAN_ACR             EQU (0xFFFAC028) ;- (CAN) Abort Command Register
AT91C_CAN_BR              EQU (0xFFFAC014) ;- (CAN) Baudrate Register
AT91C_CAN_IDR             EQU (0xFFFAC008) ;- (CAN) Interrupt Disable Register
AT91C_CAN_TIMESTP         EQU (0xFFFAC01C) ;- (CAN) Time Stamp Register
AT91C_CAN_SR              EQU (0xFFFAC010) ;- (CAN) Status Register
AT91C_CAN_IMR             EQU (0xFFFAC00C) ;- (CAN) Interrupt Mask Register
AT91C_CAN_TCR             EQU (0xFFFAC024) ;- (CAN) Transfer Command Register
AT91C_CAN_TIM             EQU (0xFFFAC018) ;- (CAN) Timer Register
AT91C_CAN_IER             EQU (0xFFFAC004) ;- (CAN) Interrupt Enable Register
AT91C_CAN_ECR             EQU (0xFFFAC020) ;- (CAN) Error Counter Register
AT91C_CAN_VR              EQU (0xFFFAC0FC) ;- (CAN) Version Register
AT91C_CAN_MR              EQU (0xFFFAC000) ;- (CAN) Mode Register
/* - ========== Register definition for PDC_AES peripheral ========== */
AT91C_AES_TCR             EQU (0xFFFB010C) ;- (PDC_AES) Transmit Counter Register
AT91C_AES_PTCR            EQU (0xFFFB0120) ;- (PDC_AES) PDC Transfer Control Register
AT91C_AES_RNCR            EQU (0xFFFB0114) ;- (PDC_AES) Receive Next Counter Register
AT91C_AES_PTSR            EQU (0xFFFB0124) ;- (PDC_AES) PDC Transfer Status Register
AT91C_AES_TNCR            EQU (0xFFFB011C) ;- (PDC_AES) Transmit Next Counter Register
AT91C_AES_RNPR            EQU (0xFFFB0110) ;- (PDC_AES) Receive Next Pointer Register
AT91C_AES_RCR             EQU (0xFFFB0104) ;- (PDC_AES) Receive Counter Register
AT91C_AES_TPR             EQU (0xFFFB0108) ;- (PDC_AES) Transmit Pointer Register
AT91C_AES_TNPR            EQU (0xFFFB0118) ;- (PDC_AES) Transmit Next Pointer Register
AT91C_AES_RPR             EQU (0xFFFB0100) ;- (PDC_AES) Receive Pointer Register
/* - ========== Register definition for AES peripheral ========== */
AT91C_AES_VR              EQU (0xFFFB00FC) ;- (AES) AES Version Register
AT91C_AES_IMR             EQU (0xFFFB0018) ;- (AES) Interrupt Mask Register
AT91C_AES_CR              EQU (0xFFFB0000) ;- (AES) Control Register
AT91C_AES_ODATAxR         EQU (0xFFFB0050) ;- (AES) Output Data x Register
AT91C_AES_ISR             EQU (0xFFFB001C) ;- (AES) Interrupt Status Register
AT91C_AES_IDR             EQU (0xFFFB0014) ;- (AES) Interrupt Disable Register
AT91C_AES_KEYWxR          EQU (0xFFFB0020) ;- (AES) Key Word x Register
AT91C_AES_IVxR            EQU (0xFFFB0060) ;- (AES) Initialization Vector x Register
AT91C_AES_MR              EQU (0xFFFB0004) ;- (AES) Mode Register
AT91C_AES_IDATAxR         EQU (0xFFFB0040) ;- (AES) Input Data x Register
AT91C_AES_IER             EQU (0xFFFB0010) ;- (AES) Interrupt Enable Register
/* - ========== Register definition for PDC_TDES peripheral ========== */
AT91C_TDES_TCR            EQU (0xFFFB010C) ;- (PDC_TDES) Transmit Counter Register
AT91C_TDES_PTCR           EQU (0xFFFB0120) ;- (PDC_TDES) PDC Transfer Control Register
AT91C_TDES_RNCR           EQU (0xFFFB0114) ;- (PDC_TDES) Receive Next Counter Register
AT91C_TDES_PTSR           EQU (0xFFFB0124) ;- (PDC_TDES) PDC Transfer Status Register
AT91C_TDES_TNCR           EQU (0xFFFB011C) ;- (PDC_TDES) Transmit Next Counter Register
AT91C_TDES_RNPR           EQU (0xFFFB0110) ;- (PDC_TDES) Receive Next Pointer Register
AT91C_TDES_RCR            EQU (0xFFFB0104) ;- (PDC_TDES) Receive Counter Register
AT91C_TDES_TPR            EQU (0xFFFB0108) ;- (PDC_TDES) Transmit Pointer Register
AT91C_TDES_TNPR           EQU (0xFFFB0118) ;- (PDC_TDES) Transmit Next Pointer Register
AT91C_TDES_RPR            EQU (0xFFFB0100) ;- (PDC_TDES) Receive Pointer Register
/* - ========== Register definition for TDES peripheral ========== */
AT91C_TDES_VR             EQU (0xFFFB00FC) ;- (TDES) TDES Version Register
AT91C_TDES_IMR            EQU (0xFFFB0018) ;- (TDES) Interrupt Mask Register
AT91C_TDES_CR             EQU (0xFFFB0000) ;- (TDES) Control Register
AT91C_TDES_ODATAxR        EQU (0xFFFB0050) ;- (TDES) Output Data x Register
AT91C_TDES_ISR            EQU (0xFFFB001C) ;- (TDES) Interrupt Status Register
AT91C_TDES_KEY3WxR        EQU (0xFFFB0030) ;- (TDES) Key 3 Word x Register
AT91C_TDES_IDR            EQU (0xFFFB0014) ;- (TDES) Interrupt Disable Register
AT91C_TDES_KEY1WxR        EQU (0xFFFB0020) ;- (TDES) Key 1 Word x Register
AT91C_TDES_KEY2WxR        EQU (0xFFFB0028) ;- (TDES) Key 2 Word x Register
AT91C_TDES_IVxR           EQU (0xFFFB0060) ;- (TDES) Initialization Vector x Register
AT91C_TDES_MR             EQU (0xFFFB0004) ;- (TDES) Mode Register
AT91C_TDES_IDATAxR        EQU (0xFFFB0040) ;- (TDES) Input Data x Register
AT91C_TDES_IER            EQU (0xFFFB0010) ;- (TDES) Interrupt Enable Register
/* - ========== Register definition for PWMC_CH0 peripheral ========== */
AT91C_PWMC_CH0_CCNTR      EQU (0xFFFB820C) ;- (PWMC_CH0) Channel Counter Register
AT91C_PWMC_CH0_CPRDR      EQU (0xFFFB8208) ;- (PWMC_CH0) Channel Period Register
AT91C_PWMC_CH0_CUPDR      EQU (0xFFFB8210) ;- (PWMC_CH0) Channel Update Register
AT91C_PWMC_CH0_CDTYR      EQU (0xFFFB8204) ;- (PWMC_CH0) Channel Duty Cycle Register
AT91C_PWMC_CH0_CMR        EQU (0xFFFB8200) ;- (PWMC_CH0) Channel Mode Register
AT91C_PWMC_CH0_Reserved   EQU (0xFFFB8214) ;- (PWMC_CH0) Reserved
/* - ========== Register definition for PWMC_CH1 peripheral ========== */
AT91C_PWMC_CH1_CCNTR      EQU (0xFFFB822C) ;- (PWMC_CH1) Channel Counter Register
AT91C_PWMC_CH1_CDTYR      EQU (0xFFFB8224) ;- (PWMC_CH1) Channel Duty Cycle Register
AT91C_PWMC_CH1_CMR        EQU (0xFFFB8220) ;- (PWMC_CH1) Channel Mode Register
AT91C_PWMC_CH1_CPRDR      EQU (0xFFFB8228) ;- (PWMC_CH1) Channel Period Register
AT91C_PWMC_CH1_Reserved   EQU (0xFFFB8234) ;- (PWMC_CH1) Reserved
AT91C_PWMC_CH1_CUPDR      EQU (0xFFFB8230) ;- (PWMC_CH1) Channel Update Register
/* - ========== Register definition for PWMC_CH2 peripheral ========== */
AT91C_PWMC_CH2_CUPDR      EQU (0xFFFB8250) ;- (PWMC_CH2) Channel Update Register
AT91C_PWMC_CH2_CMR        EQU (0xFFFB8240) ;- (PWMC_CH2) Channel Mode Register
AT91C_PWMC_CH2_Reserved   EQU (0xFFFB8254) ;- (PWMC_CH2) Reserved
AT91C_PWMC_CH2_CPRDR      EQU (0xFFFB8248) ;- (PWMC_CH2) Channel Period Register
AT91C_PWMC_CH2_CDTYR      EQU (0xFFFB8244) ;- (PWMC_CH2) Channel Duty Cycle Register
AT91C_PWMC_CH2_CCNTR      EQU (0xFFFB824C) ;- (PWMC_CH2) Channel Counter Register
/* - ========== Register definition for PWMC_CH3 peripheral ========== */
AT91C_PWMC_CH3_CPRDR      EQU (0xFFFB8268) ;- (PWMC_CH3) Channel Period Register
AT91C_PWMC_CH3_Reserved   EQU (0xFFFB8274) ;- (PWMC_CH3) Reserved
AT91C_PWMC_CH3_CUPDR      EQU (0xFFFB8270) ;- (PWMC_CH3) Channel Update Register
AT91C_PWMC_CH3_CDTYR      EQU (0xFFFB8264) ;- (PWMC_CH3) Channel Duty Cycle Register
AT91C_PWMC_CH3_CCNTR      EQU (0xFFFB826C) ;- (PWMC_CH3) Channel Counter Register
AT91C_PWMC_CH3_CMR        EQU (0xFFFB8260) ;- (PWMC_CH3) Channel Mode Register
/* - ========== Register definition for PWMC peripheral ========== */
AT91C_PWMC_IDR            EQU (0xFFFB8014) ;- (PWMC) PWMC Interrupt Disable Register
AT91C_PWMC_MR             EQU (0xFFFB8000) ;- (PWMC) PWMC Mode Register
AT91C_PWMC_VR             EQU (0xFFFB80FC) ;- (PWMC) PWMC Version Register
AT91C_PWMC_IMR            EQU (0xFFFB8018) ;- (PWMC) PWMC Interrupt Mask Register
AT91C_PWMC_SR             EQU (0xFFFB800C) ;- (PWMC) PWMC Status Register
AT91C_PWMC_ISR            EQU (0xFFFB801C) ;- (PWMC) PWMC Interrupt Status Register
AT91C_PWMC_ENA            EQU (0xFFFB8004) ;- (PWMC) PWMC Enable Register
AT91C_PWMC_IER            EQU (0xFFFB8010) ;- (PWMC) PWMC Interrupt Enable Register
AT91C_PWMC_DIS            EQU (0xFFFB8008) ;- (PWMC) PWMC Disable Register
/* - ========== Register definition for MACB peripheral ========== */
AT91C_MACB_ALE            EQU (0xFFFBC054) ;- (MACB) Alignment Error Register
AT91C_MACB_RRE            EQU (0xFFFBC06C) ;- (MACB) Receive Ressource Error Register
AT91C_MACB_SA4H           EQU (0xFFFBC0B4) ;- (MACB) Specific Address 4 Top, Last 2 bytes
AT91C_MACB_TPQ            EQU (0xFFFBC0BC) ;- (MACB) Transmit Pause Quantum Register
AT91C_MACB_RJA            EQU (0xFFFBC07C) ;- (MACB) Receive Jabbers Register
AT91C_MACB_SA2H           EQU (0xFFFBC0A4) ;- (MACB) Specific Address 2 Top, Last 2 bytes
AT91C_MACB_TPF            EQU (0xFFFBC08C) ;- (MACB) Transmitted Pause Frames Register
AT91C_MACB_ROV            EQU (0xFFFBC070) ;- (MACB) Receive Overrun Errors Register
AT91C_MACB_SA4L           EQU (0xFFFBC0B0) ;- (MACB) Specific Address 4 Bottom, First 4 bytes
AT91C_MACB_MAN            EQU (0xFFFBC034) ;- (MACB) PHY Maintenance Register
AT91C_MACB_TID            EQU (0xFFFBC0B8) ;- (MACB) Type ID Checking Register
AT91C_MACB_TBQP           EQU (0xFFFBC01C) ;- (MACB) Transmit Buffer Queue Pointer
AT91C_MACB_SA3L           EQU (0xFFFBC0A8) ;- (MACB) Specific Address 3 Bottom, First 4 bytes
AT91C_MACB_DTF            EQU (0xFFFBC058) ;- (MACB) Deferred Transmission Frame Register
AT91C_MACB_PTR            EQU (0xFFFBC038) ;- (MACB) Pause Time Register
AT91C_MACB_CSE            EQU (0xFFFBC068) ;- (MACB) Carrier Sense Error Register
AT91C_MACB_ECOL           EQU (0xFFFBC060) ;- (MACB) Excessive Collision Register
AT91C_MACB_STE            EQU (0xFFFBC084) ;- (MACB) SQE Test Error Register
AT91C_MACB_MCF            EQU (0xFFFBC048) ;- (MACB) Multiple Collision Frame Register
AT91C_MACB_IER            EQU (0xFFFBC028) ;- (MACB) Interrupt Enable Register
AT91C_MACB_ELE            EQU (0xFFFBC078) ;- (MACB) Excessive Length Errors Register
AT91C_MACB_USRIO          EQU (0xFFFBC0C0) ;- (MACB) USER Input/Output Register
AT91C_MACB_PFR            EQU (0xFFFBC03C) ;- (MACB) Pause Frames received Register
AT91C_MACB_FCSE           EQU (0xFFFBC050) ;- (MACB) Frame Check Sequence Error Register
AT91C_MACB_SA1L           EQU (0xFFFBC098) ;- (MACB) Specific Address 1 Bottom, First 4 bytes
AT91C_MACB_NCR            EQU (0xFFFBC000) ;- (MACB) Network Control Register
AT91C_MACB_HRT            EQU (0xFFFBC094) ;- (MACB) Hash Address Top[63:32]
AT91C_MACB_NCFGR          EQU (0xFFFBC004) ;- (MACB) Network Configuration Register
AT91C_MACB_SCF            EQU (0xFFFBC044) ;- (MACB) Single Collision Frame Register
AT91C_MACB_LCOL           EQU (0xFFFBC05C) ;- (MACB) Late Collision Register
AT91C_MACB_SA3H           EQU (0xFFFBC0AC) ;- (MACB) Specific Address 3 Top, Last 2 bytes
AT91C_MACB_HRB            EQU (0xFFFBC090) ;- (MACB) Hash Address Bottom[31:0]
AT91C_MACB_ISR            EQU (0xFFFBC024) ;- (MACB) Interrupt Status Register
AT91C_MACB_IMR            EQU (0xFFFBC030) ;- (MACB) Interrupt Mask Register
AT91C_MACB_WOL            EQU (0xFFFBC0C4) ;- (MACB) Wake On LAN Register
AT91C_MACB_USF            EQU (0xFFFBC080) ;- (MACB) Undersize Frames Register
AT91C_MACB_TSR            EQU (0xFFFBC014) ;- (MACB) Transmit Status Register
AT91C_MACB_FRO            EQU (0xFFFBC04C) ;- (MACB) Frames Received OK Register
AT91C_MACB_IDR            EQU (0xFFFBC02C) ;- (MACB) Interrupt Disable Register
AT91C_MACB_SA1H           EQU (0xFFFBC09C) ;- (MACB) Specific Address 1 Top, Last 2 bytes
AT91C_MACB_RLE            EQU (0xFFFBC088) ;- (MACB) Receive Length Field Mismatch Register
AT91C_MACB_TUND           EQU (0xFFFBC064) ;- (MACB) Transmit Underrun Error Register
AT91C_MACB_RSR            EQU (0xFFFBC020) ;- (MACB) Receive Status Register
AT91C_MACB_SA2L           EQU (0xFFFBC0A0) ;- (MACB) Specific Address 2 Bottom, First 4 bytes
AT91C_MACB_FTO            EQU (0xFFFBC040) ;- (MACB) Frames Transmitted OK Register
AT91C_MACB_RSE            EQU (0xFFFBC074) ;- (MACB) Receive Symbol Errors Register
AT91C_MACB_NSR            EQU (0xFFFBC008) ;- (MACB) Network Status Register
AT91C_MACB_RBQP           EQU (0xFFFBC018) ;- (MACB) Receive Buffer Queue Pointer
AT91C_MACB_REV            EQU (0xFFFBC0FC) ;- (MACB) Revision Register
/* - ========== Register definition for PDC_ADC peripheral ========== */
AT91C_ADC_TNPR            EQU (0xFFFC0118) ;- (PDC_ADC) Transmit Next Pointer Register
AT91C_ADC_RNPR            EQU (0xFFFC0110) ;- (PDC_ADC) Receive Next Pointer Register
AT91C_ADC_TCR             EQU (0xFFFC010C) ;- (PDC_ADC) Transmit Counter Register
AT91C_ADC_PTCR            EQU (0xFFFC0120) ;- (PDC_ADC) PDC Transfer Control Register
AT91C_ADC_PTSR            EQU (0xFFFC0124) ;- (PDC_ADC) PDC Transfer Status Register
AT91C_ADC_TNCR            EQU (0xFFFC011C) ;- (PDC_ADC) Transmit Next Counter Register
AT91C_ADC_TPR             EQU (0xFFFC0108) ;- (PDC_ADC) Transmit Pointer Register
AT91C_ADC_RCR             EQU (0xFFFC0104) ;- (PDC_ADC) Receive Counter Register
AT91C_ADC_RPR             EQU (0xFFFC0100) ;- (PDC_ADC) Receive Pointer Register
AT91C_ADC_RNCR            EQU (0xFFFC0114) ;- (PDC_ADC) Receive Next Counter Register
/* - ========== Register definition for ADC peripheral ========== */
AT91C_ADC_CDR6            EQU (0xFFFC0048) ;- (ADC) ADC Channel Data Register 6
AT91C_ADC_IMR             EQU (0xFFFC002C) ;- (ADC) ADC Interrupt Mask Register
AT91C_ADC_CHER            EQU (0xFFFC0010) ;- (ADC) ADC Channel Enable Register
