una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91cap9.h
AT91C_ADC_CDR4            EQU (0xFFFC0040) ;- (ADC) ADC Channel Data Register 4
AT91C_ADC_CDR1            EQU (0xFFFC0034) ;- (ADC) ADC Channel Data Register 1
AT91C_ADC_IER             EQU (0xFFFC0024) ;- (ADC) ADC Interrupt Enable Register
AT91C_ADC_CHDR            EQU (0xFFFC0014) ;- (ADC) ADC Channel Disable Register
AT91C_ADC_CDR2            EQU (0xFFFC0038) ;- (ADC) ADC Channel Data Register 2
AT91C_ADC_LCDR            EQU (0xFFFC0020) ;- (ADC) ADC Last Converted Data Register
AT91C_ADC_CR              EQU (0xFFFC0000) ;- (ADC) ADC Control Register
AT91C_ADC_CDR5            EQU (0xFFFC0044) ;- (ADC) ADC Channel Data Register 5
AT91C_ADC_CDR3            EQU (0xFFFC003C) ;- (ADC) ADC Channel Data Register 3
AT91C_ADC_MR              EQU (0xFFFC0004) ;- (ADC) ADC Mode Register
AT91C_ADC_IDR             EQU (0xFFFC0028) ;- (ADC) ADC Interrupt Disable Register
AT91C_ADC_CDR0            EQU (0xFFFC0030) ;- (ADC) ADC Channel Data Register 0
AT91C_ADC_CHSR            EQU (0xFFFC0018) ;- (ADC) ADC Channel Status Register
AT91C_ADC_SR              EQU (0xFFFC001C) ;- (ADC) ADC Status Register
AT91C_ADC_CDR7            EQU (0xFFFC004C) ;- (ADC) ADC Channel Data Register 7
/* - ========== Register definition for HISI peripheral ========== */
AT91C_HISI_DMAPADDR       EQU (0xFFFC4044) ;- (HISI) DMA Preview Base Address Register
AT91C_HISI_WPCR           EQU (0xFFFC40E4) ;- (HISI) Write Protection Control Register
AT91C_HISI_R2YSET1        EQU (0xFFFC401C) ;- (HISI) Color Space Conversion RGB to YCrCb Register
AT91C_HISI_IDR            EQU (0xFFFC4030) ;- (HISI) Interrupt Disable Register
AT91C_HISI_SR             EQU (0xFFFC4028) ;- (HISI) Status Register
AT91C_HISI_WPSR           EQU (0xFFFC40E8) ;- (HISI) Write Protection Status Register
AT91C_HISI_VER            EQU (0xFFFC40FC) ;- (HISI) Version Register
AT91C_HISI_DMACCTRL       EQU (0xFFFC4054) ;- (HISI) DMA Codec Control Register
AT91C_HISI_DMACHSR        EQU (0xFFFC4040) ;- (HISI) DMA Channel Status Register
AT91C_HISI_CFG1           EQU (0xFFFC4000) ;- (HISI) Configuration Register 1
AT91C_HISI_DMACDSCR       EQU (0xFFFC4058) ;- (HISI) DMA Codec Descriptor Address Register
AT91C_HISI_DMACADDR       EQU (0xFFFC4050) ;- (HISI) DMA Codec Base Address Register
AT91C_HISI_DMACHDR        EQU (0xFFFC403C) ;- (HISI) DMA Channel Disable Register
AT91C_HISI_DMAPDSCR       EQU (0xFFFC404C) ;- (HISI) DMA Preview Descriptor Address Register
AT91C_HISI_CTRL           EQU (0xFFFC4024) ;- (HISI) Control Register
AT91C_HISI_IER            EQU (0xFFFC402C) ;- (HISI) Interrupt Enable Register
AT91C_HISI_Y2RSET1        EQU (0xFFFC4014) ;- (HISI) Color Space Conversion YCrCb to RGB Register
AT91C_HISI_PDECF          EQU (0xFFFC400C) ;- (HISI) Preview Decimation Factor Register
AT91C_HISI_PSIZE          EQU (0xFFFC4008) ;- (HISI) Preview Size Register
AT91C_HISI_DMAPCTRL       EQU (0xFFFC4048) ;- (HISI) DMA Preview Control Register
AT91C_HISI_R2YSET2        EQU (0xFFFC4020) ;- (HISI) Color Space Conversion RGB to YCrCb Register
AT91C_HISI_R2YSET0        EQU (0xFFFC4018) ;- (HISI) Color Space Conversion RGB to YCrCb Register
AT91C_HISI_Y2RSET0        EQU (0xFFFC4010) ;- (HISI) Color Space Conversion YCrCb to RGB Register
AT91C_HISI_DMACHER        EQU (0xFFFC4038) ;- (HISI) DMA Channel Enable Register
AT91C_HISI_CFG2           EQU (0xFFFC4004) ;- (HISI) Configuration Register 2
AT91C_HISI_IMR            EQU (0xFFFC4034) ;- (HISI) Interrupt Mask Register
/* - ========== Register definition for LCDC peripheral ========== */
AT91C_LCDC_MVAL           EQU (0x00500818) ;- (LCDC) LCD Mode Toggle Rate Value Register
AT91C_LCDC_PWRCON         EQU (0x0050083C) ;- (LCDC) Power Control Register
AT91C_LCDC_ISR            EQU (0x00500854) ;- (LCDC) Interrupt Enable Register
AT91C_LCDC_FRMP1          EQU (0x00500008) ;- (LCDC) DMA Frame Pointer Register 1
AT91C_LCDC_CTRSTVAL       EQU (0x00500844) ;- (LCDC) Contrast Value Register
AT91C_LCDC_ICR            EQU (0x00500858) ;- (LCDC) Interrupt Clear Register
AT91C_LCDC_TIM1           EQU (0x00500808) ;- (LCDC) LCD Timing Config 1 Register
AT91C_LCDC_DMACON         EQU (0x0050001C) ;- (LCDC) DMA Control Register
AT91C_LCDC_ITR            EQU (0x00500860) ;- (LCDC) Interrupts Test Register
AT91C_LCDC_IDR            EQU (0x0050084C) ;- (LCDC) Interrupt Disable Register
AT91C_LCDC_DP4_7          EQU (0x00500820) ;- (LCDC) Dithering Pattern DP4_7 Register
AT91C_LCDC_DP5_7          EQU (0x0050082C) ;- (LCDC) Dithering Pattern DP5_7 Register
AT91C_LCDC_IRR            EQU (0x00500864) ;- (LCDC) Interrupts Raw Status Register
AT91C_LCDC_DP3_4          EQU (0x00500830) ;- (LCDC) Dithering Pattern DP3_4 Register
AT91C_LCDC_IMR            EQU (0x00500850) ;- (LCDC) Interrupt Mask Register
AT91C_LCDC_LCDFRCFG       EQU (0x00500810) ;- (LCDC) LCD Frame Config Register
AT91C_LCDC_CTRSTCON       EQU (0x00500840) ;- (LCDC) Contrast Control Register
AT91C_LCDC_DP1_2          EQU (0x0050081C) ;- (LCDC) Dithering Pattern DP1_2 Register
AT91C_LCDC_FRMP2          EQU (0x0050000C) ;- (LCDC) DMA Frame Pointer Register 2
AT91C_LCDC_LCDCON1        EQU (0x00500800) ;- (LCDC) LCD Control 1 Register
AT91C_LCDC_DP4_5          EQU (0x00500834) ;- (LCDC) Dithering Pattern DP4_5 Register
AT91C_LCDC_FRMA2          EQU (0x00500014) ;- (LCDC) DMA Frame Address Register 2
AT91C_LCDC_BA1            EQU (0x00500000) ;- (LCDC) DMA Base Address Register 1
AT91C_LCDC_DMA2DCFG       EQU (0x00500020) ;- (LCDC) DMA 2D addressing configuration
AT91C_LCDC_LUT_ENTRY      EQU (0x00500C00) ;- (LCDC) LUT Entries Register
AT91C_LCDC_DP6_7          EQU (0x00500838) ;- (LCDC) Dithering Pattern DP6_7 Register
AT91C_LCDC_FRMCFG         EQU (0x00500018) ;- (LCDC) DMA Frame Configuration Register
AT91C_LCDC_TIM2           EQU (0x0050080C) ;- (LCDC) LCD Timing Config 2 Register
AT91C_LCDC_DP3_5          EQU (0x00500824) ;- (LCDC) Dithering Pattern DP3_5 Register
AT91C_LCDC_FRMA1          EQU (0x00500010) ;- (LCDC) DMA Frame Address Register 1
AT91C_LCDC_IER            EQU (0x00500848) ;- (LCDC) Interrupt Enable Register
AT91C_LCDC_DP2_3          EQU (0x00500828) ;- (LCDC) Dithering Pattern DP2_3 Register
AT91C_LCDC_FIFO           EQU (0x00500814) ;- (LCDC) LCD FIFO Register
AT91C_LCDC_BA2            EQU (0x00500004) ;- (LCDC) DMA Base Address Register 2
AT91C_LCDC_LCDCON2        EQU (0x00500804) ;- (LCDC) LCD Control 2 Register
AT91C_LCDC_GPR            EQU (0x0050085C) ;- (LCDC) General Purpose Register
/* - ========== Register definition for HDMA_CH_0 peripheral ========== */
AT91C_HDMA_CH_0_DADDR     EQU (0xFFFFEC40) ;- (HDMA_CH_0) HDMA Channel Destination Address Register
AT91C_HDMA_CH_0_DPIP      EQU (0xFFFFEC58) ;- (HDMA_CH_0) HDMA Channel Destination Picture in Picture Configuration Register
AT91C_HDMA_CH_0_DSCR      EQU (0xFFFFEC44) ;- (HDMA_CH_0) HDMA Channel Descriptor Address Register
AT91C_HDMA_CH_0_CFG       EQU (0xFFFFEC50) ;- (HDMA_CH_0) HDMA Channel Configuration Register
AT91C_HDMA_CH_0_SPIP      EQU (0xFFFFEC54) ;- (HDMA_CH_0) HDMA Channel Source Picture in Picture Configuration Register
AT91C_HDMA_CH_0_CTRLA     EQU (0xFFFFEC48) ;- (HDMA_CH_0) HDMA Channel Control A Register
AT91C_HDMA_CH_0_CTRLB     EQU (0xFFFFEC4C) ;- (HDMA_CH_0) HDMA Channel Control B Register
AT91C_HDMA_CH_0_SADDR     EQU (0xFFFFEC3C) ;- (HDMA_CH_0) HDMA Channel Source Address Register
/* - ========== Register definition for HDMA_CH_1 peripheral ========== */
AT91C_HDMA_CH_1_DPIP      EQU (0xFFFFEC80) ;- (HDMA_CH_1) HDMA Channel Destination Picture in Picture Configuration Register
AT91C_HDMA_CH_1_CTRLB     EQU (0xFFFFEC74) ;- (HDMA_CH_1) HDMA Channel Control B Register
AT91C_HDMA_CH_1_SADDR     EQU (0xFFFFEC64) ;- (HDMA_CH_1) HDMA Channel Source Address Register
AT91C_HDMA_CH_1_CFG       EQU (0xFFFFEC78) ;- (HDMA_CH_1) HDMA Channel Configuration Register
AT91C_HDMA_CH_1_DSCR      EQU (0xFFFFEC6C) ;- (HDMA_CH_1) HDMA Channel Descriptor Address Register
AT91C_HDMA_CH_1_DADDR     EQU (0xFFFFEC68) ;- (HDMA_CH_1) HDMA Channel Destination Address Register
AT91C_HDMA_CH_1_CTRLA     EQU (0xFFFFEC70) ;- (HDMA_CH_1) HDMA Channel Control A Register
AT91C_HDMA_CH_1_SPIP      EQU (0xFFFFEC7C) ;- (HDMA_CH_1) HDMA Channel Source Picture in Picture Configuration Register
/* - ========== Register definition for HDMA_CH_2 peripheral ========== */
AT91C_HDMA_CH_2_DSCR      EQU (0xFFFFEC94) ;- (HDMA_CH_2) HDMA Channel Descriptor Address Register
AT91C_HDMA_CH_2_CTRLA     EQU (0xFFFFEC98) ;- (HDMA_CH_2) HDMA Channel Control A Register
AT91C_HDMA_CH_2_SADDR     EQU (0xFFFFEC8C) ;- (HDMA_CH_2) HDMA Channel Source Address Register
AT91C_HDMA_CH_2_CFG       EQU (0xFFFFECA0) ;- (HDMA_CH_2) HDMA Channel Configuration Register
AT91C_HDMA_CH_2_DPIP      EQU (0xFFFFECA8) ;- (HDMA_CH_2) HDMA Channel Destination Picture in Picture Configuration Register
AT91C_HDMA_CH_2_SPIP      EQU (0xFFFFECA4) ;- (HDMA_CH_2) HDMA Channel Source Picture in Picture Configuration Register
AT91C_HDMA_CH_2_CTRLB     EQU (0xFFFFEC9C) ;- (HDMA_CH_2) HDMA Channel Control B Register
AT91C_HDMA_CH_2_DADDR     EQU (0xFFFFEC90) ;- (HDMA_CH_2) HDMA Channel Destination Address Register
/* - ========== Register definition for HDMA_CH_3 peripheral ========== */
AT91C_HDMA_CH_3_SPIP      EQU (0xFFFFECCC) ;- (HDMA_CH_3) HDMA Channel Source Picture in Picture Configuration Register
AT91C_HDMA_CH_3_CTRLA     EQU (0xFFFFECC0) ;- (HDMA_CH_3) HDMA Channel Control A Register
AT91C_HDMA_CH_3_DPIP      EQU (0xFFFFECD0) ;- (HDMA_CH_3) HDMA Channel Destination Picture in Picture Configuration Register
AT91C_HDMA_CH_3_CTRLB     EQU (0xFFFFECC4) ;- (HDMA_CH_3) HDMA Channel Control B Register
AT91C_HDMA_CH_3_DSCR      EQU (0xFFFFECBC) ;- (HDMA_CH_3) HDMA Channel Descriptor Address Register
AT91C_HDMA_CH_3_CFG       EQU (0xFFFFECC8) ;- (HDMA_CH_3) HDMA Channel Configuration Register
AT91C_HDMA_CH_3_DADDR     EQU (0xFFFFECB8) ;- (HDMA_CH_3) HDMA Channel Destination Address Register
AT91C_HDMA_CH_3_SADDR     EQU (0xFFFFECB4) ;- (HDMA_CH_3) HDMA Channel Source Address Register
/* - ========== Register definition for HDMA peripheral ========== */
AT91C_HDMA_EBCIDR         EQU (0xFFFFEC1C) ;- (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Interrupt Disable register
AT91C_HDMA_LAST           EQU (0xFFFFEC10) ;- (HDMA) HDMA Software Last Transfer Flag Register
AT91C_HDMA_SREQ           EQU (0xFFFFEC08) ;- (HDMA) HDMA Software Single Request Register
AT91C_HDMA_EBCIER         EQU (0xFFFFEC18) ;- (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Interrupt Enable register
AT91C_HDMA_GCFG           EQU (0xFFFFEC00) ;- (HDMA) HDMA Global Configuration Register
AT91C_HDMA_CHER           EQU (0xFFFFEC28) ;- (HDMA) HDMA Channel Handler Enable Register
AT91C_HDMA_CHDR           EQU (0xFFFFEC2C) ;- (HDMA) HDMA Channel Handler Disable Register
AT91C_HDMA_EBCIMR         EQU (0xFFFFEC20) ;- (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Mask Register
AT91C_HDMA_BREQ           EQU (0xFFFFEC0C) ;- (HDMA) HDMA Software Chunk Transfer Request Register
AT91C_HDMA_SYNC           EQU (0xFFFFEC14) ;- (HDMA) HDMA Request Synchronization Register
AT91C_HDMA_EN             EQU (0xFFFFEC04) ;- (HDMA) HDMA Controller Enable Register
AT91C_HDMA_EBCISR         EQU (0xFFFFEC24) ;- (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Status Register
AT91C_HDMA_CHSR           EQU (0xFFFFEC30) ;- (HDMA) HDMA Channel Handler Status Register
/* - ========== Register definition for SYS peripheral ========== */
AT91C_SYS_SLCKSEL         EQU (0xFFFFFD50) ;- (SYS) Slow Clock Selection Register
AT91C_SYS_GPBR            EQU (0xFFFFFD60) ;- (SYS) General Purpose Register
/* - ========== Register definition for UHP peripheral ========== */
AT91C_UHP_HcRhPortStatus  EQU (0x00700054) ;- (UHP) Root Hub Port Status Register
AT91C_UHP_HcFmRemaining   EQU (0x00700038) ;- (UHP) Bit time remaining in the current Frame
AT91C_UHP_HcInterruptEnable EQU (0x00700010) ;- (UHP) Interrupt Enable Register
AT91C_UHP_HcControl       EQU (0x00700004) ;- (UHP) Operating modes for the Host Controller
AT91C_UHP_HcPeriodicStart EQU (0x00700040) ;- (UHP) Periodic Start
AT91C_UHP_HcInterruptStatus EQU (0x0070000C) ;- (UHP) Interrupt Status Register
AT91C_UHP_HcRhDescriptorB EQU (0x0070004C) ;- (UHP) Root Hub characteristics B
AT91C_UHP_HcInterruptDisable EQU (0x00700014) ;- (UHP) Interrupt Disable Register
AT91C_UHP_HcPeriodCurrentED EQU (0x0070001C) ;- (UHP) Current Isochronous or Interrupt Endpoint Descriptor
AT91C_UHP_HcRhDescriptorA EQU (0x00700048) ;- (UHP) Root Hub characteristics A
AT91C_UHP_HcRhStatus      EQU (0x00700050) ;- (UHP) Root Hub Status register
AT91C_UHP_HcBulkCurrentED EQU (0x0070002C) ;- (UHP) Current endpoint of the Bulk list
AT91C_UHP_HcControlHeadED EQU (0x00700020) ;- (UHP) First Endpoint Descriptor of the Control list
AT91C_UHP_HcLSThreshold   EQU (0x00700044) ;- (UHP) LS Threshold
AT91C_UHP_HcRevision      EQU (0x00700000) ;- (UHP) Revision
AT91C_UHP_HcBulkDoneHead  EQU (0x00700030) ;- (UHP) Last completed transfer descriptor
AT91C_UHP_HcFmNumber      EQU (0x0070003C) ;- (UHP) Frame number
AT91C_UHP_HcFmInterval    EQU (0x00700034) ;- (UHP) Bit time between 2 consecutive SOFs
AT91C_UHP_HcBulkHeadED    EQU (0x00700028) ;- (UHP) First endpoint register of the Bulk list
AT91C_UHP_HcHCCA          EQU (0x00700018) ;- (UHP) Pointer to the Host Controller Communication Area
AT91C_UHP_HcCommandStatus EQU (0x00700008) ;- (UHP) Command & status Register
AT91C_UHP_HcControlCurrentED EQU (0x00700024) ;- (UHP) Endpoint Control and Status Register

