una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91cap9.h
/* - ******************************************************************************/
/* -               PERIPHERAL ID DEFINITIONS FOR AT91CAP9_UMC*/
/* - ******************************************************************************/
AT91C_ID_FIQ              EQU ( 0) ;- Advanced Interrupt Controller (FIQ)
AT91C_ID_SYS              EQU ( 1) ;- System Controller
AT91C_ID_PIOABCD          EQU ( 2) ;- Parallel IO Controller A, Parallel IO Controller B, Parallel IO Controller C, Parallel IO Controller D
AT91C_ID_MPB0             EQU ( 3) ;- MP Block Peripheral 0
AT91C_ID_MPB1             EQU ( 4) ;- MP Block Peripheral 1
AT91C_ID_MPB2             EQU ( 5) ;- MP Block Peripheral 2
AT91C_ID_MPB3             EQU ( 6) ;- MP Block Peripheral 3
AT91C_ID_MPB4             EQU ( 7) ;- MP Block Peripheral 4
AT91C_ID_US0              EQU ( 8) ;- USART 0
AT91C_ID_US1              EQU ( 9) ;- USART 1
AT91C_ID_US2              EQU (10) ;- USART 2
AT91C_ID_MCI0             EQU (11) ;- Multimedia Card Interface 0
AT91C_ID_MCI1             EQU (12) ;- Multimedia Card Interface 1
AT91C_ID_CAN              EQU (13) ;- CAN Controller
AT91C_ID_TWI              EQU (14) ;- Two-Wire Interface
AT91C_ID_SPI0             EQU (15) ;- Serial Peripheral Interface 0
AT91C_ID_SPI1             EQU (16) ;- Serial Peripheral Interface 1
AT91C_ID_SSC0             EQU (17) ;- Serial Synchronous Controller 0
AT91C_ID_SSC1             EQU (18) ;- Serial Synchronous Controller 1
AT91C_ID_AC97C            EQU (19) ;- AC97 Controller
AT91C_ID_TC012            EQU (20) ;- Timer Counter 0, Timer Counter 1, Timer Counter 2
AT91C_ID_PWMC             EQU (21) ;- PWM Controller
AT91C_ID_EMAC             EQU (22) ;- Ethernet Mac
AT91C_ID_AESTDES          EQU (23) ;- Advanced Encryption Standard, Triple DES
AT91C_ID_ADC              EQU (24) ;- ADC Controller
AT91C_ID_HISI             EQU (25) ;- Image Sensor Interface
AT91C_ID_LCDC             EQU (26) ;- LCD Controller
AT91C_ID_HDMA             EQU (27) ;- HDMA Controller
AT91C_ID_UDPHS            EQU (28) ;- USB High Speed Device Port
AT91C_ID_UHP              EQU (29) ;- USB Host Port
AT91C_ID_IRQ0             EQU (30) ;- Advanced Interrupt Controller (IRQ0)
AT91C_ID_IRQ1             EQU (31) ;- Advanced Interrupt Controller (IRQ1)
AT91C_ALL_INT             EQU (0xFFFFFFFF) ;- ALL VALID INTERRUPTS

/* - ******************************************************************************/
/* -               BASE ADDRESS DEFINITIONS FOR AT91CAP9_UMC*/
/* - ******************************************************************************/
AT91C_BASE_HECC           EQU (0xFFFFE200) ;- (HECC) Base Address
AT91C_BASE_BCRAMC         EQU (0xFFFFE400) ;- (BCRAMC) Base Address
AT91C_BASE_SDDRC          EQU (0xFFFFE600) ;- (SDDRC) Base Address
AT91C_BASE_SMC            EQU (0xFFFFE800) ;- (SMC) Base Address
AT91C_BASE_MATRIX_PRS     EQU (0xFFFFEA80) ;- (MATRIX_PRS) Base Address
AT91C_BASE_MATRIX         EQU (0xFFFFEA00) ;- (MATRIX) Base Address
AT91C_BASE_CCFG           EQU (0xFFFFEB10) ;- (CCFG) Base Address
AT91C_BASE_PDC_DBGU       EQU (0xFFFFEF00) ;- (PDC_DBGU) Base Address
AT91C_BASE_DBGU           EQU (0xFFFFEE00) ;- (DBGU) Base Address
AT91C_BASE_AIC            EQU (0xFFFFF000) ;- (AIC) Base Address
AT91C_BASE_PIOA           EQU (0xFFFFF200) ;- (PIOA) Base Address
AT91C_BASE_PIOB           EQU (0xFFFFF400) ;- (PIOB) Base Address
AT91C_BASE_PIOC           EQU (0xFFFFF600) ;- (PIOC) Base Address
AT91C_BASE_PIOD           EQU (0xFFFFF800) ;- (PIOD) Base Address
AT91C_BASE_CKGR           EQU (0xFFFFFC1C) ;- (CKGR) Base Address
AT91C_BASE_PMC            EQU (0xFFFFFC00) ;- (PMC) Base Address
AT91C_BASE_RSTC           EQU (0xFFFFFD00) ;- (RSTC) Base Address
AT91C_BASE_SHDWC          EQU (0xFFFFFD10) ;- (SHDWC) Base Address
AT91C_BASE_RTTC           EQU (0xFFFFFD20) ;- (RTTC) Base Address
AT91C_BASE_PITC           EQU (0xFFFFFD30) ;- (PITC) Base Address
AT91C_BASE_WDTC           EQU (0xFFFFFD40) ;- (WDTC) Base Address
AT91C_BASE_UDP            EQU (0xFFF78000) ;- (UDP) Base Address
AT91C_BASE_UDPHS_EPTFIFO  EQU (0x00600000) ;- (UDPHS_EPTFIFO) Base Address
AT91C_BASE_UDPHS_EPT_0    EQU (0xFFF78100) ;- (UDPHS_EPT_0) Base Address
AT91C_BASE_UDPHS_EPT_1    EQU (0xFFF78120) ;- (UDPHS_EPT_1) Base Address
AT91C_BASE_UDPHS_EPT_2    EQU (0xFFF78140) ;- (UDPHS_EPT_2) Base Address
AT91C_BASE_UDPHS_EPT_3    EQU (0xFFF78160) ;- (UDPHS_EPT_3) Base Address
AT91C_BASE_UDPHS_EPT_4    EQU (0xFFF78180) ;- (UDPHS_EPT_4) Base Address
AT91C_BASE_UDPHS_EPT_5    EQU (0xFFF781A0) ;- (UDPHS_EPT_5) Base Address
AT91C_BASE_UDPHS_EPT_6    EQU (0xFFF781C0) ;- (UDPHS_EPT_6) Base Address
AT91C_BASE_UDPHS_EPT_7    EQU (0xFFF781E0) ;- (UDPHS_EPT_7) Base Address
AT91C_BASE_UDPHS_DMA_1    EQU (0xFFF78310) ;- (UDPHS_DMA_1) Base Address
AT91C_BASE_UDPHS_DMA_2    EQU (0xFFF78320) ;- (UDPHS_DMA_2) Base Address
AT91C_BASE_UDPHS_DMA_3    EQU (0xFFF78330) ;- (UDPHS_DMA_3) Base Address
AT91C_BASE_UDPHS_DMA_4    EQU (0xFFF78340) ;- (UDPHS_DMA_4) Base Address
AT91C_BASE_UDPHS_DMA_5    EQU (0xFFF78350) ;- (UDPHS_DMA_5) Base Address
AT91C_BASE_UDPHS_DMA_6    EQU (0xFFF78360) ;- (UDPHS_DMA_6) Base Address
AT91C_BASE_UDPHS          EQU (0xFFF78000) ;- (UDPHS) Base Address
AT91C_BASE_TC0            EQU (0xFFF7C000) ;- (TC0) Base Address
AT91C_BASE_TC1            EQU (0xFFF7C040) ;- (TC1) Base Address
AT91C_BASE_TC2            EQU (0xFFF7C080) ;- (TC2) Base Address
AT91C_BASE_TCB0           EQU (0xFFF7C000) ;- (TCB0) Base Address
AT91C_BASE_TCB1           EQU (0xFFF7C040) ;- (TCB1) Base Address
AT91C_BASE_TCB2           EQU (0xFFF7C080) ;- (TCB2) Base Address
AT91C_BASE_PDC_MCI0       EQU (0xFFF80100) ;- (PDC_MCI0) Base Address
AT91C_BASE_MCI0           EQU (0xFFF80000) ;- (MCI0) Base Address
AT91C_BASE_PDC_MCI1       EQU (0xFFF84100) ;- (PDC_MCI1) Base Address
AT91C_BASE_MCI1           EQU (0xFFF84000) ;- (MCI1) Base Address
AT91C_BASE_PDC_TWI        EQU (0xFFF88100) ;- (PDC_TWI) Base Address
AT91C_BASE_TWI            EQU (0xFFF88000) ;- (TWI) Base Address
AT91C_BASE_PDC_US0        EQU (0xFFF8C100) ;- (PDC_US0) Base Address
AT91C_BASE_US0            EQU (0xFFF8C000) ;- (US0) Base Address
AT91C_BASE_PDC_US1        EQU (0xFFF90100) ;- (PDC_US1) Base Address
AT91C_BASE_US1            EQU (0xFFF90000) ;- (US1) Base Address
AT91C_BASE_PDC_US2        EQU (0xFFF94100) ;- (PDC_US2) Base Address
AT91C_BASE_US2            EQU (0xFFF94000) ;- (US2) Base Address
AT91C_BASE_PDC_SSC0       EQU (0xFFF98100) ;- (PDC_SSC0) Base Address
AT91C_BASE_SSC0           EQU (0xFFF98000) ;- (SSC0) Base Address
AT91C_BASE_PDC_SSC1       EQU (0xFFF9C100) ;- (PDC_SSC1) Base Address
AT91C_BASE_SSC1           EQU (0xFFF9C000) ;- (SSC1) Base Address
AT91C_BASE_PDC_AC97C      EQU (0xFFFA0100) ;- (PDC_AC97C) Base Address
AT91C_BASE_AC97C          EQU (0xFFFA0000) ;- (AC97C) Base Address
AT91C_BASE_PDC_SPI0       EQU (0xFFFA4100) ;- (PDC_SPI0) Base Address
AT91C_BASE_SPI0           EQU (0xFFFA4000) ;- (SPI0) Base Address
AT91C_BASE_PDC_SPI1       EQU (0xFFFA8100) ;- (PDC_SPI1) Base Address
AT91C_BASE_SPI1           EQU (0xFFFA8000) ;- (SPI1) Base Address
AT91C_BASE_CAN_MB0        EQU (0xFFFAC200) ;- (CAN_MB0) Base Address
AT91C_BASE_CAN_MB1        EQU (0xFFFAC220) ;- (CAN_MB1) Base Address
AT91C_BASE_CAN_MB2        EQU (0xFFFAC240) ;- (CAN_MB2) Base Address
AT91C_BASE_CAN_MB3        EQU (0xFFFAC260) ;- (CAN_MB3) Base Address
AT91C_BASE_CAN_MB4        EQU (0xFFFAC280) ;- (CAN_MB4) Base Address
AT91C_BASE_CAN_MB5        EQU (0xFFFAC2A0) ;- (CAN_MB5) Base Address
AT91C_BASE_CAN_MB6        EQU (0xFFFAC2C0) ;- (CAN_MB6) Base Address
AT91C_BASE_CAN_MB7        EQU (0xFFFAC2E0) ;- (CAN_MB7) Base Address
AT91C_BASE_CAN_MB8        EQU (0xFFFAC300) ;- (CAN_MB8) Base Address
AT91C_BASE_CAN_MB9        EQU (0xFFFAC320) ;- (CAN_MB9) Base Address
AT91C_BASE_CAN_MB10       EQU (0xFFFAC340) ;- (CAN_MB10) Base Address
AT91C_BASE_CAN_MB11       EQU (0xFFFAC360) ;- (CAN_MB11) Base Address
AT91C_BASE_CAN_MB12       EQU (0xFFFAC380) ;- (CAN_MB12) Base Address
AT91C_BASE_CAN_MB13       EQU (0xFFFAC3A0) ;- (CAN_MB13) Base Address
AT91C_BASE_CAN_MB14       EQU (0xFFFAC3C0) ;- (CAN_MB14) Base Address
AT91C_BASE_CAN_MB15       EQU (0xFFFAC3E0) ;- (CAN_MB15) Base Address
AT91C_BASE_CAN            EQU (0xFFFAC000) ;- (CAN) Base Address
AT91C_BASE_PDC_AES        EQU (0xFFFB0100) ;- (PDC_AES) Base Address
AT91C_BASE_AES            EQU (0xFFFB0000) ;- (AES) Base Address
AT91C_BASE_PDC_TDES       EQU (0xFFFB0100) ;- (PDC_TDES) Base Address
AT91C_BASE_TDES           EQU (0xFFFB0000) ;- (TDES) Base Address
AT91C_BASE_PWMC_CH0       EQU (0xFFFB8200) ;- (PWMC_CH0) Base Address
AT91C_BASE_PWMC_CH1       EQU (0xFFFB8220) ;- (PWMC_CH1) Base Address
AT91C_BASE_PWMC_CH2       EQU (0xFFFB8240) ;- (PWMC_CH2) Base Address
AT91C_BASE_PWMC_CH3       EQU (0xFFFB8260) ;- (PWMC_CH3) Base Address
AT91C_BASE_PWMC           EQU (0xFFFB8000) ;- (PWMC) Base Address
AT91C_BASE_MACB           EQU (0xFFFBC000) ;- (MACB) Base Address
AT91C_BASE_PDC_ADC        EQU (0xFFFC0100) ;- (PDC_ADC) Base Address
AT91C_BASE_ADC            EQU (0xFFFC0000) ;- (ADC) Base Address
AT91C_BASE_HISI           EQU (0xFFFC4000) ;- (HISI) Base Address
AT91C_BASE_LCDC           EQU (0x00500000) ;- (LCDC) Base Address
AT91C_BASE_HDMA_CH_0      EQU (0xFFFFEC3C) ;- (HDMA_CH_0) Base Address
AT91C_BASE_HDMA_CH_1      EQU (0xFFFFEC64) ;- (HDMA_CH_1) Base Address
AT91C_BASE_HDMA_CH_2      EQU (0xFFFFEC8C) ;- (HDMA_CH_2) Base Address
AT91C_BASE_HDMA_CH_3      EQU (0xFFFFECB4) ;- (HDMA_CH_3) Base Address
AT91C_BASE_HDMA           EQU (0xFFFFEC00) ;- (HDMA) Base Address
AT91C_BASE_SYS            EQU (0xFFFFE200) ;- (SYS) Base Address
AT91C_BASE_UHP            EQU (0x00700000) ;- (UHP) Base Address

