una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91cap9.h
/* - ******************************************************************************/
/* -               MEMORY MAPPING DEFINITIONS FOR AT91CAP9_UMC*/
/* - ******************************************************************************/
/* - IRAM*/
AT91C_IRAM                EQU (0x00100000) ;- 32-KBytes FAST SRAM base address
AT91C_IRAM_SIZE           EQU (0x00008000) ;- 32-KBytes FAST SRAM size in byte (32 Kbytes)
/* - IRAM_MIN*/
AT91C_IRAM_MIN            EQU (0x00100000) ;- Minimum Internal RAM base address
AT91C_IRAM_MIN_SIZE       EQU (0x00008000) ;- Minimum Internal RAM size in byte (32 Kbytes)
/* - DPR*/
AT91C_DPR                 EQU (0x00200000) ;-  base address
AT91C_DPR_SIZE            EQU (0x00008000) ;-  size in byte (32 Kbytes)
/* - IROM*/
AT91C_IROM                EQU (0x00400000) ;- Internal ROM base address
AT91C_IROM_SIZE           EQU (0x00008000) ;- Internal ROM size in byte (32 Kbytes)
/* - EBI_CS0*/
AT91C_EBI_CS0             EQU (0x10000000) ;- EBI Chip Select 0 base address
AT91C_EBI_CS0_SIZE        EQU (0x10000000) ;- EBI Chip Select 0 size in byte (262144 Kbytes)
/* - EBI_CS1*/
AT91C_EBI_CS1             EQU (0x20000000) ;- EBI Chip Select 1 base address
AT91C_EBI_CS1_SIZE        EQU (0x10000000) ;- EBI Chip Select 1 size in byte (262144 Kbytes)
/* - EBI_BCRAM*/
AT91C_EBI_BCRAM           EQU (0x20000000) ;- BCRAM on EBI Chip Select 1 base address
AT91C_EBI_BCRAM_SIZE      EQU (0x10000000) ;- BCRAM on EBI Chip Select 1 size in byte (262144 Kbytes)
/* - EBI_BCRAM_16BIT*/
AT91C_EBI_BCRAM_16BIT     EQU (0x20000000) ;- BCRAM on EBI Chip Select 1 base address
AT91C_EBI_BCRAM_16BIT_SIZE EQU (0x02000000) ;- BCRAM on EBI Chip Select 1 size in byte (32768 Kbytes)
/* - EBI_BCRAM_32BIT*/
AT91C_EBI_BCRAM_32BIT     EQU (0x20000000) ;- BCRAM on EBI Chip Select 1 base address
AT91C_EBI_BCRAM_32BIT_SIZE EQU (0x04000000) ;- BCRAM on EBI Chip Select 1 size in byte (65536 Kbytes)
/* - EBI_CS2*/
AT91C_EBI_CS2             EQU (0x30000000) ;- EBI Chip Select 2 base address
AT91C_EBI_CS2_SIZE        EQU (0x10000000) ;- EBI Chip Select 2 size in byte (262144 Kbytes)
/* - EBI_CS3*/
AT91C_EBI_CS3             EQU (0x40000000) ;- EBI Chip Select 3 base address
AT91C_EBI_CS3_SIZE        EQU (0x10000000) ;- EBI Chip Select 3 size in byte (262144 Kbytes)
/* - EBI_SM*/
AT91C_EBI_SM              EQU (0x40000000) ;- SmartMedia on EBI Chip Select 3 base address
AT91C_EBI_SM_SIZE         EQU (0x10000000) ;- SmartMedia on EBI Chip Select 3 size in byte (262144 Kbytes)
/* - EBI_CS4*/
AT91C_EBI_CS4             EQU (0x50000000) ;- EBI Chip Select 4 base address
AT91C_EBI_CS4_SIZE        EQU (0x10000000) ;- EBI Chip Select 4 size in byte (262144 Kbytes)
/* - EBI_CF0*/
AT91C_EBI_CF0             EQU (0x50000000) ;- CompactFlash 0 on EBI Chip Select 4 base address
AT91C_EBI_CF0_SIZE        EQU (0x10000000) ;- CompactFlash 0 on EBI Chip Select 4 size in byte (262144 Kbytes)
/* - EBI_CS5*/
AT91C_EBI_CS5             EQU (0x60000000) ;- EBI Chip Select 5 base address
AT91C_EBI_CS5_SIZE        EQU (0x10000000) ;- EBI Chip Select 5 size in byte (262144 Kbytes)
/* - EBI_CF1*/
AT91C_EBI_CF1             EQU (0x60000000) ;- CompactFlash 1 on EBI Chip Select 5 base address
AT91C_EBI_CF1_SIZE        EQU (0x10000000) ;- CompactFlash 1 on EBI Chip Select 5 size in byte (262144 Kbytes)
/* - EBI_SDRAM*/
AT91C_EBI_SDRAM           EQU (0x70000000) ;- SDRAM on EBI Chip Select 6 base address
AT91C_EBI_SDRAM_SIZE      EQU (0x10000000) ;- SDRAM on EBI Chip Select 6 size in byte (262144 Kbytes)
/* - EBI_SDRAM_16BIT*/
AT91C_EBI_SDRAM_16BIT     EQU (0x70000000) ;- SDRAM on EBI Chip Select 6 base address
AT91C_EBI_SDRAM_16BIT_SIZE EQU (0x02000000) ;- SDRAM on EBI Chip Select 6 size in byte (32768 Kbytes)
/* - EBI_SDRAM_32BIT*/
AT91C_EBI_SDRAM_32BIT     EQU (0x70000000) ;- SDRAM on EBI Chip Select 6 base address
AT91C_EBI_SDRAM_32BIT_SIZE EQU (0x04000000) ;- SDRAM on EBI Chip Select 6 size in byte (65536 Kbytes)
#endif /* __IAR_SYSTEMS_ASM__ */


#endif /* AT91CAP9_UMC_H */
